[
  {
    "name": "Genesis",
    "slug": "genesis",
    "testament": "Old Testament",
    "category": "Law (Torah)",
    "author": "Moses",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God creates the heavens, earth, and all life in six days, culminating with humanity made in His image to rule creation.",
      "2": "God forms Adam, plants Eden, creates Eve as his partner, and establishes the first marriage in perfect harmony.",
      "3": "The serpent tempts Eve and Adam; they disobey God, bringing sin, death, and separation, yet God promises redemption.",
      "4": "Cain murders Abel out of jealousy; sin spreads as Cain builds the first city and his descendants develop civilization.",
      "5": "Adam's genealogy spans 1,656 years to Noah; Enoch walks with God and is taken; Methuselah lives 969 years.",
      "6": "Humanity's wickedness grieves God; He chooses Noah to build an ark and preserve life through the coming flood.",
      "7": "Noah, his family, and animals enter the ark; God shuts them in as rain falls for 40 days, flooding the earth.",
      "8": "The flood waters recede; Noah sends out birds to test the land, then exits the ark and offers sacrifice to God.",
      "9": "God establishes a covenant with Noah, permits eating meat, institutes human government, and promises never to flood the earth again.",
      "10": "The table of nations: descendants of Noah's sons spread across the earth, establishing 70 distinct people groups.",
      "11": "Humanity rebels by building Babel; God confuses their language and scatters them, then calls Abraham to start over."
    }
  },
  {
    "name": "Exodus",
    "slug": "exodus",
    "testament": "Old Testament",
    "category": "Law (Torah)",
    "author": "Moses",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Jacob's descendants multiply in Egypt; new Pharaoh oppresses Israel with slavery and attempts genocide.",
      "2": "Moses is born, raised in Pharaoh's house, flees to Midian after killing an Egyptian; God hears Israel's cries.",
      "3": "God calls Moses from the burning bush, reveals His name YAHWEH, and commissions him to deliver Israel.",
      "4": "God gives Moses miraculous signs; Aaron becomes his spokesman; Moses returns to Egypt with God's message.",
      "5": "Moses and Aaron confront Pharaoh; he refuses and increases Israel's burdens; the people blame Moses.",
      "6": "God reassures Moses of His covenant promises and power; genealogy of Moses and Aaron's lineage.",
      "7": "Aaron's staff becomes a serpent; the first plague turns water to blood throughout Egypt.",
      "8": "Plagues of frogs, gnats, and flies demonstrate God's power; Pharaoh repeatedly hardens his heart.",
      "9": "Plagues on livestock, boils, and devastating hail with fire show God's sovereignty over Egypt.",
      "10": "Locusts devour Egypt and thick darkness covers the land; Pharaoh's final refusal before the ultimate plague.",
      "11": "God announces the death of every firstborn; Egyptians will give Israel silver and gold as they leave.",
      "12": "The Passover instituted; death of Egypt's firstborn; Israel's exodus begins after 430 years in Egypt.",
      "13": "Consecration of firstborn; God leads Israel by pillar of cloud and fire toward the wilderness.",
      "14": "Pharaoh pursues Israel to the Red Sea; God parts the waters and destroys Egypt's army.",
      "15": "Moses and Miriam lead victory songs; bitter water at Marah made sweet; God promises healing.",
      "16": "Israel complains about food; God provides manna and quail; Sabbath principle introduced with gathering rules.",
      "17": "Water from the rock at Massah; Amalekites attack Israel; Moses' raised hands ensure Joshua's victory.",
      "18": "Jethro visits Moses, worships God, and advises him to delegate judicial responsibilities to capable leaders.",
      "19": "Israel arrives at Sinai; God proposes covenant relationship; the people prepare to meet their holy God.",
      "20": "The Ten Commandments given; Israel fears God's presence and asks Moses to be their mediator.",
      "21": "Laws about Hebrew servants, violence, and property damage establish justice and social order.",
      "22": "Laws concerning theft, property damage, moral conduct, and social justice reflect God's character.",
      "23": "Justice in legal proceedings; festivals and Sabbaths; promises for conquest of the Promised Land.",
      "24": "Moses reads the covenant; people agree; Moses, Aaron, and elders see God; Moses ascends for forty days.",
      "25": "Instructions for the ark, table, and lampstand; God desires to dwell among His people.",
      "26": "Detailed plans for the tabernacle structure: curtains, frames, and the veil separating holy places.",
      "27": "The bronze altar for sacrifices and the courtyard design; God's dwelling place takes shape.",
      "28": "Aaron and sons consecrated as priests; detailed instructions for sacred garments reflecting God's glory.",
      "29": "Ordination ceremony for priests; daily sacrifices; God promises to dwell among Israel.",
      "30": "Altar of incense, census tax, bronze basin, anointing oil, and incense recipes for worship.",
      "31": "Bezalel and Oholiab chosen as craftsmen; Sabbath as covenant sign; Moses receives stone tablets.",
      "32": "Israel worships golden calf while Moses is on mountain; Moses intercedes; 3,000 die for idolatry.",
      "33": "God threatens to withdraw His presence; Moses pleads; God reveals His glory and character.",
      "34": "New tablets; God proclaims His name and attributes; covenant renewed; Moses' face shines with glory.",
      "35": "Sabbath emphasized; people give generously for tabernacle construction; hearts willing and stirred.",
      "36": "Skilled workers begin construction; people give so much they must be restrained from bringing more.",
      "37": "Bezalel crafts the ark, table, and lampstand according to God's detailed specifications.",
      "38": "Bronze altar, basin, and courtyard completed; inventory of materials shows faithful stewardship.",
      "39": "Priestly garments made exactly as commanded; all work inspected and blessed by Moses.",
      "40": "Tabernacle erected on first day of second year; God's glory fills His dwelling place among Israel."
    }
  },
  {
    "name": "Leviticus",
    "slug": "leviticus",
    "testament": "Old Testament",
    "category": "Law (Torah)",
    "author": "Moses",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God instructs Moses on the burnt offering, detailing how the Israelites should present cattle, sheep, goats, or birds as voluntary offerings to atone for sin and express devotion to the Lord.",
      "2": "The grain offering is established as a way to present flour, oil, and frankincense to God, with portions burned on the altar and the remainder given to the priests as their provision.",
      "3": "The peace offering is described as a voluntary sacrifice of cattle, sheep, or goats to express gratitude and fellowship with God, with specific portions burned and others shared between priests and worshipers.",
      "4": "Sin offerings are prescribed for unintentional sins, with different requirements for the high priest, the congregation, leaders, and common people, emphasizing the seriousness of sin and need for atonement.",
      "5": "Additional sin offerings and guilt offerings are detailed for specific situations including false testimony, touching unclean things, and rash oaths, along with provisions for those who cannot afford standard offerings.",
      "6": "God provides instructions to the priests about maintaining the altar fire and handling the burnt offering, grain offering, and sin offering, emphasizing the sacred nature of their duties.",
      "7": "Detailed regulations for the guilt offering and peace offering are given, including what portions belong to the priests and prohibitions against eating fat and blood.",
      "8": "Moses consecrates Aaron and his sons as priests through washing, clothing them in sacred garments, anointing with oil, and offering sacrifices, establishing the priesthood for Israel.",
      "9": "Aaron begins his priestly ministry by offering sacrifices for himself and the people, culminating in God's fire consuming the offerings and His glory appearing to all Israel.",
      "10": "Nadab and Abihu, Aaron's sons, are killed by God's fire for offering unauthorized incense, teaching the importance of approaching God according to His prescribed ways and maintaining priestly holiness.",
      "11": "God establishes dietary laws distinguishing between clean and unclean animals, emphasizing Israel's call to holiness and separation from other nations through their eating practices.",
      "12": "Laws concerning purification after childbirth are given, requiring different periods of ceremonial uncleanness and specific offerings for male and female children.",
      "13": "Detailed instructions for diagnosing and managing skin diseases and mildew are provided, with priests serving as health inspectors to determine ceremonial cleanness or uncleanness.",
      "14": "The cleansing ritual for those healed of skin diseases is prescribed, involving birds, cedar wood, scarlet yarn, hyssop, and various offerings to restore them to community fellowship.",
      "15": "Laws regarding bodily discharges are established, detailing purification requirements for both men and women to maintain ceremonial cleanness in the camp.",
      "16": "The Day of Atonement is instituted as an annual ceremony where the high priest enters the Most Holy Place to make atonement for himself, the priesthood, and all Israel's sins.",
      "17": "Regulations about sacrifices and eating meat are given, requiring all sacrifices to be brought to the tabernacle and prohibiting the consumption of blood, which contains life and makes atonement.",
      "18": "God prohibits various sexual practices including incest, adultery, homosexuality, and bestiality, calling Israel to moral purity distinct from Egyptian and Canaanite customs.",
      "19": "The holiness code begins with calls to reverence parents, keep the Sabbath, avoid idolatry, and love one's neighbor as oneself, establishing foundational principles for holy living.",
      "20": "Penalties for serious sins are prescribed, including death for child sacrifice, adultery, homosexuality, and consulting mediums, emphasizing God's call for Israel to be holy and separate.",
      "21": "Special holiness requirements for priests are established, including restrictions on mourning practices, marriage, and physical defects, reflecting their sacred role as mediators between God and people.",
      "22": "Additional priestly regulations ensure ceremonial purity when handling sacred offerings and establish standards for acceptable sacrificial animals, maintaining the integrity of worship.",
      "23": "God establishes Israel's sacred calendar with detailed instructions for observing the Sabbath, Passover, Feast of Weeks, Feast of Trumpets, Day of Atonement, and Feast of Tabernacles.",
      "24": "Instructions for maintaining the lampstand and bread of the Presence are given, followed by the punishment of a blasphemer and the establishment of the principle of proportional justice.",
      "25": "The sabbatical year and Year of Jubilee are instituted to provide rest for the land, release for Hebrew slaves, and redemption of property, emphasizing God's ownership of all things.",
      "26": "God promises blessings for obedience including rain, abundant harvests, peace, and His presence, while warning of escalating curses for disobedience including exile from the land.",
      "27": "Laws concerning vows and dedicated offerings are established, including the redemption values for people, animals, houses, and fields dedicated to the Lord, concluding Leviticus with principles of sacred commitment."
    }
  },
  {
    "name": "Numbers",
    "slug": "numbers",
    "testament": "Old Testament",
    "category": "Law (Torah)",
    "author": "Moses",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Moses conducts the first census of Israel's fighting men (excluding Levites), numbering over 600,000 males aged twenty and above from the twelve tribes, as commanded by God at Mount Sinai.",
      "2": "God establishes the arrangement of the twelve tribes around the tabernacle during their wilderness encampments, with specific positioning and marching order under their respective banners.",
      "3": "The Levites are set apart for tabernacle service in place of Israel's firstborn, with Aaron's sons appointed as priests and the Levitical clans assigned specific duties for the sacred tent.",
      "4": "Detailed instructions are given for the Kohathites, Gershonites, and Merarites regarding their specific responsibilities in transporting and caring for the tabernacle and its holy objects.",
      "5": "Laws are established for maintaining camp purity through quarantine of the unclean, restitution for wrongs, and the ritual test for suspected adultery (the bitter water ordeal).",
      "6": "God provides regulations for the Nazirite vow of separation and gives Aaron the priestly blessing formula to pronounce over the Israelites.",
      "7": "The twelve tribal leaders present identical offerings for the dedication of the altar over twelve days, demonstrating unity and God's acceptance of their worship.",
      "8": "Aaron lights the seven lamps of the lampstand, and the Levites are ceremonially purified and set apart for their service in the tabernacle on behalf of all Israel.",
      "9": "Israel celebrates the first Passover in the wilderness, with provisions made for those ceremonially unclean, while the cloud of God's presence guides their movements.",
      "10": "Silver trumpets are made for assemblies and signaling marches, and Israel begins their journey from Sinai toward the Promised Land in organized formation.",
      "11": "The people complain about hardships and demand meat instead of manna, leading to God's anger, the provision of quail, and a plague as judgment for their ingratitude.",
      "12": "Miriam and Aaron challenge Moses' authority and unique relationship with God, resulting in Miriam being struck with leprosy until Moses intercedes for her healing.",
      "13": "Twelve spies are sent to scout the Promised Land and return with evidence of its abundance, but ten give a fearful report while only Joshua and Caleb encourage faith in God's promises.",
      "14": "Israel rebels against entering the Promised Land due to fear, prompting God's judgment that the entire generation (except Joshua and Caleb) will die in the wilderness over forty years.",
      "15": "God provides laws for offerings in the future land, establishes procedures for unintentional sins, and executes a man for deliberate Sabbath violation, while instituting tassels as reminders of God's commands.",
      "16": "Korah, Dathan, and Abiram lead a rebellion against Moses and Aaron's authority, resulting in the earth swallowing the rebels and fire consuming 250 incense offerers.",
      "17": "To confirm Aaron's unique priestly calling, God causes Aaron's staff to miraculously bud, blossom, and produce almonds among the twelve tribal staffs.",
      "18": "God establishes the permanent responsibilities and provisions for the priests and Levites, including their duties, portions of offerings, and the tithe system for their sustenance.",
      "19": "The ritual of the red heifer is instituted to provide ceremonial purification from defilement caused by contact with the dead, essential for maintaining covenant relationship with God.",
      "20": "Miriam dies, the people complain about lack of water, and Moses and Aaron sin by striking the rock instead of speaking to it, resulting in their exclusion from the Promised Land.",
      "21": "Israel defeats the Canaanites at Hormah, complains about the journey leading to fiery serpents as judgment, finds healing through the bronze serpent, and conquers the Amorite kings Sihon and Og.",
      "22": "Balak, king of Moab, hires the prophet Balaam to curse Israel, but God intervenes through a speaking donkey and commands Balaam to bless Israel instead.",
      "23": "Despite Balak's repeated attempts and offerings, Balaam pronounces blessings on Israel instead of curses, declaring God's faithfulness to His covenant people.",
      "24": "Balaam delivers his final oracles blessing Israel and prophesying their future dominance, including the messianic prophecy of the star and scepter from Jacob.",
      "25": "Israel falls into idolatry and immorality with Moabite women at Baal-Peor, leading to a plague that is stopped only when Phinehas executes an Israelite man and Midianite woman in zealous obedience.",
      "26": "A second census is conducted after the plague, showing God's faithfulness in maintaining Israel's numbers despite judgment, and establishing inheritance rights for the new generation entering Canaan.",
      "27": "The daughters of Zelophehad successfully petition for inheritance rights when there are no male heirs, and Moses is shown the Promised Land before God appoints Joshua as his successor.",
      "28": "God establishes the regular schedule of daily, weekly, and monthly offerings that Israel must maintain to worship Him properly in the land.",
      "29": "Detailed instructions are given for the special offerings required during the seventh month festivals: the Feast of Trumpets, Day of Atonement, and Feast of Tabernacles.",
      "30": "Laws regarding vows are established, particularly addressing the authority of fathers and husbands to confirm or nullify vows made by daughters and wives under their care.",
      "31": "God commands Israel to take vengeance on the Midianites for leading them into sin at Baal-Peor, resulting in complete victory and the distribution of spoils according to divine law.",
      "32": "The tribes of Reuben, Gad, and half of Manasseh request to settle east of the Jordan River, which Moses grants on condition they help conquer the Promised Land first.",
      "33": "Moses records the complete itinerary of Israel's forty-year wilderness journey from Egypt to the plains of Moab, demonstrating God's faithful guidance throughout their wanderings.",
      "34": "God defines the precise boundaries of the Promised Land that Israel will inherit and appoints leaders from each tribe to oversee the distribution of the territory.",
      "35": "The Levites are assigned forty-eight cities throughout Israel including six cities of refuge where those guilty of accidental manslaughter can find protection from vengeful relatives.",
      "36": "The final law addresses marriage restrictions for female heirs to ensure that tribal inheritances remain within their designated tribes, concluding the wilderness legislation at the plains of Moab."
    }
  },
  {
    "name": "Deuteronomy",
    "slug": "deuteronomy",
    "testament": "Old Testament",
    "category": "Law (Torah)",
    "author": "Moses",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Moses begins his farewell address by recounting Israel's journey from Mount Horeb, including the appointment of judges and the command to enter the Promised Land that their fathers' generation refused to obey.",
      "2": "Moses recounts Israel's wilderness wanderings and God's instructions to avoid conflict with the descendants of Esau and Lot while conquering the Amorite kingdoms east of the Jordan.",
      "3": "Moses describes the conquest of King Og of Bashan and the distribution of the Transjordan territory to Reuben, Gad, and half the tribe of Manasseh, while being reminded that he himself cannot enter the Promised Land.",
      "4": "Moses urges Israel to obey God's laws and statutes, warning against idolatry and emphasizing that their obedience will demonstrate God's wisdom to the nations and ensure their prosperity in the land.",
      "5": "Moses restates the Ten Commandments given at Mount Horeb and recalls how the people requested that Moses serve as mediator between them and God due to their fear of God's awesome presence.",
      "6": "Moses delivers the great commandment to love the Lord with all their heart, soul, and strength, instructing parents to teach God's laws diligently to their children and to remember God's faithfulness when they prosper in the land.",
      "7": "Moses commands Israel to completely destroy the Canaanite nations and their idols, reminding them that they are God's chosen people not because of their greatness but because of God's love and faithfulness to His promises.",
      "8": "Moses warns Israel to remember the Lord when they prosper in the Promised Land, recalling how God humbled them in the wilderness with manna to teach them that man lives by every word from God's mouth.",
      "9": "Moses reminds Israel that their conquest of the land is not due to their righteousness but because of the wickedness of the nations and God's faithfulness to His promises, recounting the golden calf incident as evidence of their rebellion.",
      "10": "Moses recounts the making of the second set of stone tablets, the construction of the ark, and emphasizes that God desires circumcised hearts that fear Him, serve Him, and care for the vulnerable in society.",
      "11": "Moses calls Israel to love and obey the Lord, promising blessings for obedience and curses for disobedience, and instructs them to teach God's words to their children and bind them as signs upon themselves.",
      "12": "Moses establishes laws for worship in the Promised Land, commanding the destruction of pagan worship sites and designating one central place where God will choose to put His name for sacrifices and offerings.",
      "13": "Moses warns against false prophets and idolatrous family members or cities, commanding that those who lead Israel away from the Lord must be put to death to purge evil from among them.",
      "14": "Moses reaffirms Israel's identity as God's holy people through dietary laws, distinguishing clean and unclean animals, and establishes the principle of tithing to support worship and care for the needy.",
      "15": "Moses institutes the sabbatical year for debt release and freeing Hebrew servants, commanding generous treatment of the poor and proper procedures for those who choose permanent servitude.",
      "16": "Moses establishes the three major annual festivals—Passover, Feast of Weeks, and Feast of Tabernacles—and provides instructions for appointing judges who will administer justice fairly without partiality or bribes.",
      "17": "Moses gives laws concerning proper sacrifices, procedures for dealing with idolatry, the role of priests and Levites in difficult legal cases, and regulations for future kings who must be guided by God's law.",
      "18": "Moses defines the inheritance and duties of the Levitical priests, warns against occult practices of the nations, and promises that God will raise up a prophet like Moses to speak His words to the people.",
      "19": "Moses establishes cities of refuge for accidental killers and sets procedures for witnesses in legal cases, emphasizing the principle of justice and the requirement of multiple witnesses for serious accusations.",
      "20": "Moses provides laws for warfare, including encouragement for soldiers, exemptions from military service, procedures for besieging cities, and instructions for dealing with both distant and nearby enemies.",
      "21": "Moses addresses various civil laws including procedures for unsolved murders, treatment of captive women, inheritance rights of firstborn sons, and dealing with rebellious children and executed criminals.",
      "22": "Moses establishes laws for social responsibility and moral purity, covering topics from returning lost property and helping neighbors to regulations concerning marriage, sexual conduct, and proper gender distinctions.",
      "23": "Moses defines who may enter the assembly of the Lord, establishes laws for maintaining cleanliness in military camps, and provides regulations for escaped slaves, temple prostitution, and lending practices.",
      "24": "Moses provides laws concerning divorce and remarriage, fair treatment of workers and debtors, justice for the vulnerable, and proper procedures for punishment while maintaining human dignity.",
      "25": "Moses establishes limits on corporal punishment, laws for levirate marriage to preserve family lines, honest business practices with accurate weights and measures, and the command to destroy the Amalekites.",
      "26": "Moses prescribes rituals for offering firstfruits and tithes that include reciting God's mighty acts in Israel's history, concluding with mutual covenant declarations between God and His people.",
      "27": "Moses, with the elders and priests, commands Israel to set up stones inscribed with the law on Mount Ebal and prescribes a covenant renewal ceremony with blessings and curses proclaimed from mounts Gerizim and Ebal.",
      "28": "Moses presents the covenant's blessings for obedience and extensive curses for disobedience, describing in vivid detail the prosperity that comes from following God and the devastating consequences of rebellion.",
      "29": "Moses calls Israel to renew their covenant with the Lord, warning that future generations will witness God's judgment if they forsake the covenant, while acknowledging that some things belong to God's secret counsel.",
      "30": "Moses prophesies Israel's future exile and restoration, calling them to choose life by loving and obeying the Lord, emphasizing that God's commandment is not too difficult or distant but near to their hearts.",
      "31": "Moses transfers leadership to Joshua, commands the regular public reading of the law, and receives God's prediction that Israel will rebel after his death, prompting the writing of a song as a witness against them.",
      "32": "Moses recites his song that serves as a prophetic witness, recounting God's faithfulness to unfaithful Israel and declaring that God will ultimately vindicate His people and judge their enemies.",
      "33": "Moses delivers his final blessing upon the twelve tribes of Israel, celebrating God as their eternal refuge and strength while prophesying each tribe's distinctive future and calling Israel blessed among nations.",
      "34": "Moses views the Promised Land from Mount Nebo before dying at age 120 with undiminished strength, and the narrative concludes by affirming that no prophet like Moses has since arisen in Israel."
    }
  },
  {
    "name": "Joshua",
    "slug": "joshua",
    "testament": "Old Testament",
    "category": "History",
    "author": "Joshua",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God commands Joshua to lead Israel into the Promised Land, promising His presence and success if they courageously obey His law. Joshua prepares the people for crossing the Jordan River into Canaan.",
      "2": "Joshua sends two spies to scout Jericho, where Rahab the prostitute hides them and professes faith in Israel's God. In return for her protection, the spies promise to spare her and her family when Israel conquers the city.",
      "3": "The Israelites cross the Jordan River on dry ground as God miraculously stops the flowing water when the priests carrying the ark step into it. This miracle demonstrates God's power and establishes Joshua's leadership before all Israel.",
      "4": "Twelve stones are taken from the Jordan riverbed to create a memorial at Gilgal, serving as a lasting testimony to God's mighty work for future generations. The crossing is completed and the people camp at Gilgal, their first base in the Promised Land.",
      "5": "The Israelite men are circumcised at Gilgal, and the people celebrate Passover in the Promised Land for the first time. The manna ceases as they begin eating the produce of Canaan, and Joshua encounters the commander of the Lord's army.",
      "6": "Jericho falls after Israel marches around the city for seven days according to God's specific instructions, with the walls collapsing when they shout and blow trumpets. Rahab and her family are spared, but the city is devoted to destruction except for items going to God's treasury.",
      "7": "Israel suffers defeat at Ai because Achan secretly took devoted items from Jericho, violating God's command. After Achan and his family are executed for their sin, God's anger is turned away from Israel.",
      "8": "Israel successfully conquers Ai using a divinely-given battle strategy involving an ambush, demonstrating that victory comes through obedience to God. Joshua builds an altar on Mount Ebal and publicly reads the entire law to all Israel.",
      "9": "The Gibeonites deceive Israel into making a peace treaty by pretending to be from a distant land, violating God's command to destroy all Canaanites. Though bound by their oath, Israel makes the Gibeonites servants, showing the consequences of not seeking God's counsel.",
      "10": "Joshua leads Israel to victory over a coalition of five Amorite kings who attacked Gibeon, with God fighting for Israel by sending hailstones and making the sun stand still. The southern region of Canaan is conquered as God delivers enemy after enemy into Israel's hands.",
      "11": "Joshua defeats a northern coalition led by Jabin of Hazor, completing the conquest of Canaan's major population centers. The chapter emphasizes that Joshua carried out all of Moses' commands and that the land had rest from war.",
      "12": "A comprehensive list records all the kings defeated by Moses east of the Jordan and by Joshua west of the Jordan. This chapter serves as a testimony to God's faithfulness in giving Israel victory over 31 kings and their territories.",
      "13": "Though much land remains to be possessed, God instructs Joshua to begin dividing the inheritance among the nine and a half tribes. The chapter details the territory of Reuben, Gad, and half of Manasseh who received their inheritance east of the Jordan.",
      "14": "The inheritance process begins west of the Jordan, with Caleb receiving Hebron as his personal inheritance due to his faithful service and wholehearted devotion to God. At 85 years old, Caleb demonstrates continued strength and faith in claiming his promised territory.",
      "15": "The detailed boundaries and cities of Judah's tribal inheritance are established, showing God's faithfulness in fulfilling His promises to the patriarchs. Caleb successfully drives out the Anakim from his inheritance, while the Jebusites remain in Jerusalem.",
      "16": "The inheritance boundaries for the tribe of Ephraim are described, though they fail to completely drive out the Canaanites from their territory. This partial obedience foreshadows future problems and compromises in Israel's faithfulness to God.",
      "17": "The other half of Manasseh receives their inheritance, including special provisions for Zelophehad's daughters who inherit land according to Moses' earlier ruling. The tribe complains about their allotment size, but Joshua challenges them to clear the forested hill country.",
      "18": "The remaining seven tribes receive their inheritances after Joshua rebukes their delay in claiming what God has given them. The tabernacle is set up at Shiloh, and surveyors map out the remaining land for division by lot.",
      "19": "The final six tribes (Simeon, Zebulun, Issachar, Asher, Naphtali, and Dan) receive their territorial inheritances through the casting of lots. Joshua himself receives the city of Timnath-serah as his personal inheritance, completing the land distribution process.",
      "20": "Six cities of refuge are established where those who accidentally kill someone can flee for protection from the avenger of blood. This provision demonstrates God's justice and mercy, providing due process while protecting both the innocent and the rights of victims' families.",
      "21": "The Levites receive 48 cities scattered throughout all the tribal territories, fulfilling God's promise to provide for those who serve Him in the tabernacle. The chapter concludes by affirming that God kept every promise He made to Israel regarding the land.",
      "22": "The eastern tribes (Reuben, Gad, and half of Manasseh) return home after faithfully serving in the conquest, but build an altar that nearly causes civil war. The crisis is resolved when they explain the altar is a witness to their faithfulness, not for forbidden worship.",
      "23": "In his first farewell address, an aged Joshua warns Israel to remain faithful to God and continue driving out the remaining Canaanites. He emphasizes that obedience brings blessing while disobedience will result in losing the Promised Land.",
      "24": "Joshua's final address recounts God's faithfulness throughout Israel's history and challenges the people to choose whom they will serve. Israel covenant renewally commits to serve the Lord alone, and Joshua dies at 110 years old, having faithfully completed his calling."
    }
  },
  {
    "name": "Judges",
    "slug": "judges",
    "testament": "Old Testament",
    "category": "History",
    "author": "Samuel (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "After Joshua’s death, Israel continues to fight remaining Canaanites. Judah leads, aided by Simeon. Some tribes fail to fully drive out inhabitants.",
      "2": "An angel rebukes Israel for disobedience. After Joshua’s generation dies, Israel falls into idolatry. God raises judges to deliver them, but the cycle of sin continues.",
      "3": "God leaves nations to test Israel. Othniel delivers them from Cushan-Rishathaim. Ehud kills Eglon of Moab, bringing peace. Shamgar strikes down 600 Philistines.",
      "4": "Deborah, a prophetess, leads Israel with Barak. God grants victory over Sisera’s army; Jael kills Sisera by driving a tent peg through his head.",
      "5": "The song of Deborah and Barak celebrates God’s victory over Canaan and Jael’s courage. The land has peace for 40 years.",
      "6": "Israel oppressed by Midian. God calls Gideon, who doubts and asks for signs. Gideon destroys Baal’s altar and gathers an army.",
      "7": "God reduces Gideon’s army to 300 to show His power. With trumpets, jars, and torches, they rout Midian’s vast army.",
      "8": "Gideon pursues and defeats Midian’s kings. Israel asks him to rule, but he refuses. He makes an ephod that becomes a snare to Israel.",
      "9": "Abimelek, Gideon’s son, seizes power by killing his brothers. His rule brings strife; he dies after a woman drops a millstone on his head.",
      "10": "Tola and Jair judge Israel. Later, Israel turns to idols, and God delivers them to Ammon. They cry for mercy, and He relents.",
      "11": "Jephthah, an outcast, is chosen to fight Ammon. He vows to sacrifice whatever first comes from his house. Victory comes, but his daughter is tragically offered.",
      "12": "Ephraim quarrels with Jephthah; thousands die. Jephthah judges six years. Ibzan, Elon, and Abdon serve as judges afterward.",
      "13": "Israel again sins. An angel tells Manoah’s wife she’ll bear Samson, set apart as a Nazirite from birth.",
      "14": "Samson desires a Philistine wife. He kills a lion and later finds honey in its carcass. He poses a riddle at his wedding feast.",
      "15": "Samson burns Philistine fields with foxes, kills many with a donkey’s jawbone after betrayal, and judges Israel for 20 years.",
      "16": "Samson loves Delilah, who betrays him. His hair is cut, he’s captured and blinded. He dies pulling down a Philistine temple, killing many.",
      "17": "Micah makes idols and hires a Levite as his priest, revealing Israel’s religious corruption.",
      "18": "The tribe of Dan steals Micah’s idols and priest, conquers Laish, and sets up idolatry.",
      "19": "A Levite’s concubine is abused and killed in Gibeah. He dismembers her body to summon Israel against such evil.",
      "20": "Israel unites against Benjamin for the atrocity in Gibeah. After heavy losses, Israel defeats Benjamin with God’s help.",
      "21": "Israel grieves Benjamin’s near destruction. Wives are found for the survivors through unconventional means. The book ends: “Everyone did what was right in his own eyes.”"
    }
  },
  {
    "name": "Ruth",
    "slug": "ruth",
    "testament": "Old Testament",
    "category": "History",
    "author": "Samuel (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Naomi’s family moves to Moab due to famine. Her husband and sons die, leaving Naomi and her daughters-in-law. Ruth clings to Naomi, pledging loyalty to her and to God. They return to Bethlehem at harvest time.",
      "2": "Ruth gleans in the fields of Boaz, a relative of Naomi. Boaz shows kindness and protection, providing food and favor. Naomi recognizes God’s providence and Boaz as a potential redeemer.",
      "3": "Naomi instructs Ruth to approach Boaz at the threshing floor. Ruth requests his protection as kinsman-redeemer. Boaz blesses her, promises to act, but mentions a nearer relative has first right.",
      "4": "Boaz redeems Ruth by negotiating with the nearer kinsman at the city gate. He marries Ruth, and they bear Obed, grandfather of King David. The story highlights God’s providence and Ruth’s place in the messianic line."
    }
  },
  {
    "name": "1 Samuel",
    "slug": "1-samuel",
    "testament": "Old Testament",
    "category": "History",
    "author": "Samuel, Gad, Nathan (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Hannah, barren and mocked, prays for a son and vows to dedicate him to the Lord. God grants Samuel, whom she presents to serve at Shiloh.",
      "2": "Hannah prays a song of praise. Eli’s sons, Hophni and Phinehas, are corrupt. A man of God foretells judgment on Eli’s household.",
      "3": "God calls young Samuel at night. Eli instructs him to answer. Samuel hears God’s word of judgment on Eli’s house and becomes recognized as a prophet.",
      "4": "Israel is defeated by the Philistines. The ark of God is captured. Eli’s sons die in battle, and Eli falls dead upon hearing the news.",
      "5": "The ark in Philistine territory brings plagues and humiliation to their god Dagon. The Philistines suffer tumors and panic.",
      "6": "The Philistines return the ark with guilt offerings. The people of Beth Shemesh rejoice but some die for irreverence toward the ark.",
      "7": "Samuel calls Israel to repent. At Mizpah, God thunders against the Philistines, granting victory. Samuel judges Israel faithfully.",
      "8": "Israel demands a king. Samuel warns of the burdens a king will impose, but the people insist. God grants their request.",
      "9": "Saul, searching for lost donkeys, meets Samuel. God reveals Saul as His choice for king. Samuel anoints Saul privately.",
      "10": "Samuel presents Saul to Israel. God’s Spirit comes upon Saul. Some accept him, others despise him.",
      "11": "Saul rallies Israel to defeat the Ammonites threatening Jabesh-gilead. The people affirm Saul as king with rejoicing.",
      "12": "Samuel gives a farewell speech, recounting God’s faithfulness. He warns Israel to obey God under their king, and prays as thunder confirms his words.",
      "13": "Saul leads Israel against the Philistines but disobeys by offering sacrifice himself. Samuel rebukes him and foretells loss of his dynasty.",
      "14": "Jonathan attacks a Philistine outpost, sparking victory. Saul makes a rash oath restricting food, causing trouble for Israel.",
      "15": "Saul spares King Agag and the best animals against God’s command. Samuel rebukes him: “To obey is better than sacrifice.” God rejects Saul as king.",
      "16": "God sends Samuel to Bethlehem to anoint David, son of Jesse. The Spirit comes on David. An evil spirit torments Saul; David plays the harp to soothe him.",
      "17": "David defeats Goliath with a sling and stone, declaring God’s power. Israel routs the Philistines. David becomes a hero.",
      "18": "David befriends Jonathan. Saul grows jealous of David’s success and plots against him. David prospers despite Saul’s hostility.",
      "19": "Saul orders David killed, but Jonathan intercedes. Saul again tries to kill David, who flees. God’s Spirit restrains Saul’s men and Saul himself.",
      "20": "Jonathan tests Saul’s intentions at a feast. Realizing Saul wants David dead, Jonathan warns David. The two make a covenant of friendship.",
      "21": "David flees to Nob, receives holy bread and Goliath’s sword. He escapes to Gath, feigns madness before King Achish.",
      "22": "Saul kills the priests of Nob for aiding David, except Abiathar who escapes. David gathers outcasts to himself as followers.",
      "23": "David rescues Keilah from the Philistines but flees from Saul’s pursuit. Jonathan encourages him. Saul nearly captures David but withdraws to fight Philistines.",
      "24": "David spares Saul in a cave, refusing to kill God’s anointed. He shows Saul the evidence, and Saul weeps, acknowledging David’s righteousness.",
      "25": "David seeks provisions from Nabal, who insults him. Abigail intercedes wisely, preventing bloodshed. God strikes Nabal dead; David marries Abigail.",
      "26": "David again spares Saul, taking his spear and water jug. He rebukes Saul, who admits his sin. David remains steadfast in not harming the king.",
      "27": "David flees to Philistine territory, living under King Achish in Ziklag. He raids enemies while deceiving Achish.",
      "28": "Saul, desperate before battle, consults the medium of Endor. Samuel’s spirit appears, foretelling Saul’s defeat and death.",
      "29": "Philistine leaders distrust David and send him away from their army. He returns to Ziklag.",
      "30": "Amalekites raid Ziklag, capturing families. David strengthens himself in God, pursues, and rescues all. Spoils are shared equally among his men.",
      "31": "Israel is defeated at Mount Gilboa. Saul’s sons, including Jonathan, are killed. Saul falls on his sword. The Philistines desecrate their bodies, but men of Jabesh-gilead recover them."
    }
  },
  {
    "name": "2 Samuel",
    "slug": "2-samuel",
    "testament": "Old Testament",
    "category": "History",
    "author": "Gad, Nathan (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "A man reports Saul’s death to David, claiming to have killed him. David mourns Saul and Jonathan with a lament over their bravery and love.",
      "2": "David is anointed king over Judah. Saul’s son Ish-bosheth becomes king over Israel. Abner and Joab’s men clash; Asahel is killed by Abner.",
      "3": "Abner defects to David after a quarrel with Ish-bosheth. Joab treacherously kills Abner in revenge. David laments Abner’s death.",
      "4": "Ish-bosheth is assassinated by two men, who bring his head to David. David executes them for murder and honors Ish-bosheth.",
      "5": "David is anointed king over all Israel. He captures Jerusalem and makes it his capital. God grants victory over the Philistines.",
      "6": "David brings the ark to Jerusalem. Uzzah dies for touching it. Later, with proper reverence, David dances before the ark. Michal despises him.",
      "7": "God makes a covenant with David, promising an eternal dynasty. David responds with a prayer of humble gratitude.",
      "8": "David defeats surrounding nations and reigns with justice. He dedicates captured treasures to the Lord and establishes officials.",
      "9": "David shows kindness to Mephibosheth, Jonathan’s crippled son, granting him Saul’s land and a permanent place at his table.",
      "10": "The Ammonites hire Aramean allies against Israel. David’s army, led by Joab, defeats them. The Arameans withdraw support for Ammon.",
      "11": "David commits adultery with Bathsheba and arranges Uriah’s death. Bathsheba becomes David’s wife, but God is displeased.",
      "12": "Nathan confronts David with a parable. David repents, but God announces consequences. Their first child dies; Solomon is later born.",
      "13": "Amnon rapes his sister Tamar. Absalom, Tamar’s brother, kills Amnon in revenge and flees into exile.",
      "14": "Joab arranges for Absalom’s return to Jerusalem. David allows him back but does not see him for two years.",
      "15": "Absalom wins the people’s favor and declares himself king at Hebron. David flees Jerusalem with his followers.",
      "16": "Ziba deceives David about Mephibosheth. Shimei curses David. Absalom enters Jerusalem and, on Ahithophel’s advice, sleeps with David’s concubines.",
      "17": "Ahithophel advises immediate pursuit, but Hushai counsels delay, saving David. Ahithophel, seeing his advice rejected, commits suicide.",
      "18": "David’s army defeats Absalom’s forces. Absalom is caught in a tree and killed by Joab. David mourns deeply for his son.",
      "19": "David returns to Jerusalem amid disputes. He shows mercy to Shimei and Mephibosheth, honors Barzillai, and faces division between Judah and Israel.",
      "20": "Sheba leads a revolt against David. Joab kills Amasa and besieges Abel Beth Maacah. A wise woman negotiates Sheba’s execution, ending the revolt.",
      "21": "Famine comes due to Saul’s past sin against the Gibeonites. Seven of Saul’s descendants are executed. David’s warriors defeat Philistine giants.",
      "22": "David sings a psalm of praise for God’s deliverance and faithfulness throughout his reign.",
      "23": "David’s last words exalt God’s covenant. The mighty men’s exploits are recounted, honoring their loyalty and bravery.",
      "24": "David orders a census, bringing guilt on Israel. God offers three judgments; David chooses plague. David builds an altar on Araunah’s threshing floor, where the plague stops."
    }
  },
  {
    "name": "1 Kings",
    "slug": "1-kings",
    "testament": "Old Testament",
    "category": "History",
    "author": "Jeremiah (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "David is old and frail. Adonijah exalts himself as king, but Nathan and Bathsheba secure Solomon’s coronation by David’s command.",
      "2": "David gives Solomon final instructions to be faithful and deal with adversaries. Solomon establishes his reign by executing Adonijah, Joab, and Shimei, and affirming loyal allies.",
      "3": "Solomon asks God for wisdom in a dream at Gibeon. God grants him wisdom and wealth. Solomon demonstrates discernment by judging between two women over a baby.",
      "4": "Solomon’s officials and governors are listed. Israel prospers under his reign, and Solomon’s wisdom becomes renowned throughout the world.",
      "5": "Solomon makes a treaty with Hiram of Tyre to supply cedar and laborers for building the temple. Preparations for construction begin.",
      "6": "Solomon builds the temple with precise detail, completing it in seven years. God promises His presence if Israel obeys His commands.",
      "7": "Solomon builds his palace and the Hall of Justice. Huram crafts bronze furnishings for the temple, including pillars, basins, and utensils.",
      "8": "The ark is brought into the temple. God’s glory fills the house. Solomon prays a dedicatory prayer, asking God to hear prayers directed toward this temple.",
      "9": "God reaffirms His covenant with Solomon. Solomon’s building projects expand, including cities and trade. Hiram receives towns from Solomon.",
      "10": "The Queen of Sheba visits Solomon, marvels at his wisdom, and praises God. Solomon’s wealth and splendor surpass all kings.",
      "11": "Solomon’s many foreign wives turn his heart to idolatry. God raises adversaries, including Jeroboam. God announces the kingdom will be torn from Solomon’s son.",
      "12": "Rehoboam becomes king. He rejects wise counsel and increases burdens, causing ten tribes to rebel and follow Jeroboam. Jeroboam establishes idolatrous worship in Bethel and Dan.",
      "13": "A man of God prophesies against Jeroboam’s altar. Jeroboam’s hand shrivels but is restored. The prophet disobeys God’s command and is killed by a lion.",
      "14": "Jeroboam’s son becomes sick. A prophet foretells judgment on Jeroboam’s house. Judah also turns to idolatry under Rehoboam. Rehoboam faces Egyptian invasion.",
      "15": "Abijam and Asa reign over Judah. Asa does what is right, removing idols, but does not eliminate high places. Nadab and Baasha reign in Israel; Baasha destroys Jeroboam’s house.",
      "16": "Baasha’s dynasty is condemned. Elah, Zimri, Omri, and Ahab follow as kings of Israel. Ahab marries Jezebel and promotes Baal worship, provoking God’s anger.",
      "17": "Elijah announces drought in Israel. God provides for him by ravens and a widow. Elijah raises the widow’s son from the dead, showing God’s power.",
      "18": "Elijah confronts Ahab and challenges Baal’s prophets on Mount Carmel. God answers Elijah with fire, proving He is God. The drought ends with Elijah’s prayer.",
      "19": "Elijah flees Jezebel in fear. God reveals Himself in a gentle whisper at Mount Horeb. Elijah is reassured and called to anoint successors, including Elisha.",
      "20": "Ahab defeats Ben-hadad of Aram with God’s help, but spares him against God’s command. A prophet condemns Ahab for letting him go.",
      "21": "Ahab covets Naboth’s vineyard. Jezebel arranges Naboth’s death. Elijah confronts Ahab, pronouncing doom on his house. Ahab humbles himself, delaying judgment.",
      "22": "Micaiah prophesies Ahab’s death despite pressure to agree with false prophets. Ahab disguises himself in battle but is killed. Jehoshaphat reigns in Judah; Ahaziah in Israel."
    }
  },
  {
    "name": "2 Kings",
    "slug": "2-kings",
    "testament": "Old Testament",
    "category": "History",
    "author": "Jeremiah (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "King Ahaziah seeks Baal-zebub’s counsel after an injury. Elijah confronts messengers, calls down fire on captains, and foretells Ahaziah’s death.",
      "2": "Elijah is taken up to heaven in a whirlwind. Elisha inherits his mantle, parts the Jordan, and performs miracles, including healing water and cursing mocking youths.",
      "3": "Jehoram of Israel, Jehoshaphat, and Edom ally against Moab. Elisha prophesies victory; God miraculously provides water and defeats Moab.",
      "4": "Elisha performs miracles: multiplying oil for a widow, raising a Shunammite’s son, purifying poisoned stew, and feeding a hundred men with limited bread.",
      "5": "Naaman, a Syrian commander, is healed of leprosy after washing in the Jordan. Gehazi, Elisha’s servant, lies for profit and is struck with leprosy.",
      "6": "Elisha makes an iron axe head float. He reveals Aramean ambushes. God blinds the enemy army. During siege, famine grips Samaria.",
      "7": "Elisha prophesies relief from famine. Four lepers discover the Arameans have fled. Samaria plunders the abandoned camp, fulfilling prophecy.",
      "8": "Elisha foretells seven years of famine and Hazael’s rise in Syria. Jehoram and Ahaziah reign in Judah, walking in wickedness like Ahab’s house.",
      "9": "Elisha’s prophet anoints Jehu king. Jehu kills Joram, Ahaziah, Jezebel, and Ahab’s household, fulfilling prophecy.",
      "10": "Jehu massacres Ahab’s seventy sons and destroys Baal worship in Israel, but does not turn from Jeroboam’s sins. God promises his dynasty four generations.",
      "11": "Athaliah seizes power in Judah but is overthrown by Jehoiada the priest, who crowns Joash as king. Athaliah is executed, and covenant worship is restored.",
      "12": "Joash repairs the temple but later compromises. He pays tribute to Hazael of Syria. His officials assassinate him, and Amaziah reigns.",
      "13": "Jehoahaz and Jehoash reign in Israel. They sin but occasionally seek God’s help. Elisha dies, leaving a legacy of miracles, including a resurrection.",
      "14": "Amaziah reigns in Judah, defeating Edom but losing to Israel. Jeroboam II reigns in Israel, expanding territory. Both walk in sin.",
      "15": "Multiple kings reign in Israel—Zechariah, Shallum, Menahem, Pekahiah, Pekah—marked by instability and assassination. In Judah, Azariah (Uzziah) prospers but is struck with leprosy.",
      "16": "Ahaz reigns in Judah, practicing idolatry and appealing to Assyria for help against Syria and Israel. He alters temple worship to please Assyria.",
      "17": "Hoshea, last king of Israel, rebels against Assyria. Samaria falls, and Israel is exiled. The cause: persistent idolatry and disobedience to God’s covenant.",
      "18": "Hezekiah reigns in Judah, reforms worship, and trusts God. Assyria invades; Rabshakeh mocks God. Hezekiah resists and seeks God’s help.",
      "19": "Hezekiah prays. Isaiah prophesies Assyria’s fall. That night, God’s angel strikes down 185,000 Assyrians. Sennacherib retreats and is killed by his sons.",
      "20": "Hezekiah falls ill but prays; God heals him, adding 15 years. The shadow on the sundial moves backward as a sign. Hezekiah shows envoys his treasures, prompting Isaiah’s warning of future Babylonian exile.",
      "21": "Manasseh reigns wickedly, filling Jerusalem with idolatry and bloodshed. Amon reigns briefly and is assassinated.",
      "22": "Josiah reigns and repairs the temple. The Book of the Law is found. Huldah the prophetess foretells judgment but promises Josiah mercy in his lifetime.",
      "23": "Josiah renews the covenant, destroys idols, and restores proper worship. Despite reforms, God decrees judgment. Josiah dies in battle at Megiddo.",
      "24": "Nebuchadnezzar of Babylon besieges Judah. Jehoiachin is taken captive, and Zedekiah becomes king. Babylon dominates Judah.",
      "25": "Jerusalem falls. The temple, palace, and city walls are destroyed. Many are exiled to Babylon. Gedaliah governs the remnant but is assassinated. Jehoiachin is later released from prison in Babylon."
    }
  },
  {
    "name": "1 Chronicles",
    "slug": "1-chronicles",
    "testament": "Old Testament",
    "category": "History",
    "author": "Ezra (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Genealogies from Adam through the patriarchs, tracing humanity’s beginnings and Israel’s ancestry.",
      "2": "Genealogies of Judah’s descendants, including Hezron’s line leading to David.",
      "3": "David’s descendants are listed, including Solomon and the kings of Judah down to the exile.",
      "4": "Genealogies of Judah’s and Simeon’s descendants, including Jabez’s prayer to God for blessing.",
      "5": "Genealogies of Reuben, Gad, and half of Manasseh, noting their wars and exile for unfaithfulness.",
      "6": "Genealogies of Levi’s descendants, including priests, musicians, and Levitical towns.",
      "7": "Genealogies of Issachar, Benjamin, Naphtali, Manasseh, Ephraim, and Asher.",
      "8": "Genealogies of Benjamin’s descendants, highlighting Saul’s family.",
      "9": "Genealogies of returned exiles and Levitical gatekeepers. Saul’s genealogy repeated.",
      "10": "The death of Saul and his sons at Mount Gilboa; Saul’s unfaithfulness causes his downfall.",
      "11": "David is anointed king. He captures Jerusalem, makes it his capital, and honors his mighty men.",
      "12": "Warriors from many tribes join David, strengthening his kingdom.",
      "13": "David attempts to bring the ark to Jerusalem; Uzzah dies for touching it irreverently.",
      "14": "David defeats the Philistines with God’s help, affirming God’s presence with him.",
      "15": "David organizes the Levites and brings the ark to Jerusalem with rejoicing.",
      "16": "David places the ark in a tent, appoints Levites for worship, and offers a psalm of thanks.",
      "17": "God promises David an eternal dynasty through the prophet Nathan. David responds with humility.",
      "18": "David defeats surrounding nations, establishing dominion and dedicating treasures to God.",
      "19": "David defeats the Ammonites and Arameans after their insult to his messengers.",
      "20": "David’s army defeats the Ammonites and Philistine giants. Rabbah is captured.",
      "21": "David’s census brings God’s wrath. A plague is stopped when David builds an altar on Araunah’s threshing floor.",
      "22": "David prepares materials and workers for the temple, instructing Solomon to build it.",
      "23": "David organizes the Levites by divisions for temple service.",
      "24": "David organizes the priests into 24 divisions for orderly temple worship.",
      "25": "David organizes musicians under Asaph, Heman, and Jeduthun for temple worship.",
      "26": "David organizes gatekeepers, treasurers, and other temple officials.",
      "27": "David organizes Israel’s military, tribal leaders, officials, and royal administrators.",
      "28": "David publicly charges Solomon to build the temple, giving him plans and encouraging him to trust God.",
      "29": "David leads Israel in generous offerings for the temple. He prays a prayer of praise. Solomon is made king, and David dies after a long reign."
    }
  },
  {
    "name": "2 Chronicles",
    "slug": "2-chronicles",
    "testament": "Old Testament",
    "category": "History",
    "author": "Ezra (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Solomon begins his reign, offers sacrifices at Gibeon, and asks God for wisdom. God grants him wisdom, wealth, and honor.",
      "2": "Solomon prepares to build the temple, securing materials and skilled workers from King Hiram of Tyre.",
      "3": "Solomon begins construction of the temple in Jerusalem, with detailed descriptions of its dimensions and decorations.",
      "4": "Temple furnishings are crafted: bronze altar, sea, lampstands, tables, courts, and vessels for worship.",
      "5": "The ark is brought into the temple. The glory of the Lord fills the house so the priests cannot stand to minister.",
      "6": "Solomon prays a dedication prayer, asking God to hear from heaven and forgive His people when they repent.",
      "7": "Fire comes down from heaven to consume the sacrifices. God appears to Solomon, promising blessing for obedience and exile for disobedience.",
      "8": "Solomon’s accomplishments: fortified cities, conscripted labor, temple service, and trade with Hiram.",
      "9": "The Queen of Sheba visits Solomon, marvels at his wisdom and wealth. Solomon’s greatness surpasses all kings. He dies after reigning 40 years.",
      "10": "Rehoboam becomes king. He rejects wise counsel, increases burdens, and Israel’s ten tribes rebel, making Jeroboam king.",
      "11": "Rehoboam fortifies Judah, is faithful at first, and priests and Levites migrate from Israel to Judah.",
      "12": "Rehoboam forsakes God, and Shishak of Egypt invades. Rehoboam humbles himself, and God spares total destruction.",
      "13": "Abijah reigns in Judah, defeats Jeroboam in battle by trusting God.",
      "14": "Asa reigns, removes idols, and experiences peace. God grants victory over a vast Cushite army.",
      "15": "Prophet Azariah encourages Asa to remain faithful. Asa reforms Judah, removes idols, and renews the covenant.",
      "16": "Asa relies on Aram instead of God against Israel. Hanani rebukes him; Asa imprisons him and later dies of disease.",
      "17": "Jehoshaphat reigns faithfully, strengthens Judah, and sends officials to teach God’s law throughout the land.",
      "18": "Jehoshaphat allies with Ahab. Micaiah prophesies Ahab’s death in battle. Ahab disguises himself but is killed.",
      "19": "Jehoshaphat appoints judges and exhorts them to judge faithfully, fearing God above all.",
      "20": "Jehoshaphat faces Moab and Ammon. He seeks God in prayer, and God miraculously defeats the enemies through confusion. Judah praises God.",
      "21": "Jehoram reigns wickedly in Judah, kills his brothers, and follows Ahab’s ways. He dies painfully, unloved.",
      "22": "Ahaziah reigns briefly and wickedly. Athaliah seizes power and kills the royal family, except Joash who is hidden.",
      "23": "Jehoiada the priest crowns Joash king. Athaliah is executed, and covenant worship is restored.",
      "24": "Joash repairs the temple under Jehoiada’s guidance, but after Jehoiada’s death he turns to idolatry and kills Jehoiada’s son. Joash is assassinated.",
      "25": "Amaziah reigns, initially following God but later worships Edomite idols. He is defeated by Israel and assassinated.",
      "26": "Uzziah reigns successfully and builds Judah’s strength. Pride leads him to usurp priestly duties; God strikes him with leprosy.",
      "27": "Jotham reigns faithfully, strengthens Judah, and builds cities. He prospers because he walks uprightly.",
      "28": "Ahaz reigns wickedly, practices idolatry, and sacrifices children. Judah suffers defeats, but prophets urge compassion on captives.",
      "29": "Hezekiah reigns faithfully, purifies the temple, restores worship, and leads Judah in covenant renewal.",
      "30": "Hezekiah invites all Israel and Judah to celebrate Passover in Jerusalem. Many respond, and the feast brings great joy.",
      "31": "Hezekiah organizes priests, Levites, and tithes. Worship is restored and Judah prospers.",
      "32": "Sennacherib of Assyria invades. Hezekiah prays, and God delivers Judah by striking down the Assyrians. Hezekiah later falls into pride but humbles himself.",
      "33": "Manasseh reigns wickedly, filling Jerusalem with idolatry. Later he repents in captivity, returns, and reforms. Amon reigns briefly and wickedly.",
      "34": "Josiah reigns faithfully, purges idolatry, and repairs the temple. The Book of the Law is found, leading to covenant renewal.",
      "35": "Josiah leads a great Passover celebration. Later, he dies in battle against Pharaoh Neco at Megiddo.",
      "36": "Judah’s last kings reign wickedly. Jerusalem is conquered by Babylon, the temple destroyed, and the people exiled. The book ends with Cyrus of Persia allowing Jews to return and rebuild."
    }
  },
  {
    "name": "Ezra",
    "slug": "ezra",
    "testament": "Old Testament",
    "category": "History",
    "author": "Ezra",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Cyrus of Persia issues a decree allowing Jews to return to Jerusalem and rebuild the temple. Sacred vessels taken by Nebuchadnezzar are returned.",
      "2": "A list of exiles returning from Babylon is recorded, detailing families, priests, Levites, singers, and servants. The total is about 50,000.",
      "3": "The altar is rebuilt, sacrifices resume, and the Feast of Tabernacles is celebrated. The temple foundation is laid, with great rejoicing and weeping.",
      "4": "Enemies of Judah oppose the rebuilding, writing accusations to Persian kings. Work on the temple halts for many years due to opposition.",
      "5": "Prophets Haggai and Zechariah encourage the rebuilding. Tattenai, governor of Trans-Euphrates, questions the work and reports to Darius.",
      "6": "Darius confirms Cyrus’ decree. The temple is completed and dedicated with joy. Passover is celebrated by all who returned.",
      "7": "Ezra, a skilled scribe, receives royal authority from Artaxerxes to teach and enforce God’s law. He leads a new group of exiles to Jerusalem.",
      "8": "Ezra lists those returning with him. He proclaims a fast for safe travel. God protects them, and temple treasures are delivered safely.",
      "9": "Ezra learns of intermarriage with pagan nations. He prays in deep grief, confessing Israel’s sin and acknowledging God’s mercy.",
      "10": "The people confess their sin and agree to separate from foreign wives. A list of those guilty of intermarriage is recorded."
    }
  },
  {
    "name": "Nehemiah",
    "slug": "nehemiah",
    "testament": "Old Testament",
    "category": "History",
    "author": "Nehemiah (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Nehemiah, cupbearer to the Persian king, hears of Jerusalem’s broken walls. He weeps, fasts, and prays for God’s mercy and favor.",
      "2": "Nehemiah receives Artaxerxes’ permission to rebuild Jerusalem’s walls. He inspects the ruins secretly and rallies the people to begin the work.",
      "3": "Families and groups rebuild sections of the wall, each contributing to the restoration effort with unity and diligence.",
      "4": "Opposition from enemies brings ridicule and threats. Nehemiah arms the workers, urging them to trust God and remain vigilant.",
      "5": "Nehemiah addresses internal injustice, rebuking nobles for exploiting the poor. He sets an example by serving without demanding governor’s privileges.",
      "6": "Enemies plot to distract and intimidate Nehemiah. He refuses their traps. The wall is completed in 52 days, and enemies lose confidence.",
      "7": "Nehemiah appoints leaders and records the genealogy of the first returnees under Zerubbabel to repopulate Jerusalem.",
      "8": "Ezra reads the Law publicly. The people weep, but Nehemiah and Ezra encourage them to rejoice. The Feast of Tabernacles is celebrated with joy.",
      "9": "The people confess sins and recount God’s faithfulness through history, renewing their covenant to obey His law.",
      "10": "Leaders and people make a written covenant, pledging to keep God’s commands, honor the Sabbath, and support the temple with tithes and offerings.",
      "11": "Leaders settle in Jerusalem, and others are chosen by lot to live there. Genealogies of priests, Levites, and gatekeepers are recorded.",
      "12": "Priests and Levites are listed. The wall’s dedication is celebrated with great rejoicing, music, and sacrifices. Worship is organized.",
      "13": "Nehemiah returns to find corruption: foreign influence, neglect of temple duties, Sabbath-breaking, and intermarriage. He rebukes and reforms the people, restoring covenant faithfulness."
    }
  },
  {
    "name": "Esther",
    "slug": "esther",
    "testament": "Old Testament",
    "category": "History",
    "author": "Unknown (trad. Mordecai)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "King Xerxes holds a lavish feast. Queen Vashti refuses his command to appear, so she is deposed to set an example for all women.",
      "2": "Esther, a Jewish orphan raised by Mordecai, is chosen as queen. Mordecai uncovers a plot against the king and reports it.",
      "3": "Haman rises to power and demands honor, but Mordecai refuses to bow. Enraged, Haman plots to destroy all Jews and casts lots (Purim) to set the date.",
      "4": "Mordecai urges Esther to plead with the king. Esther agrees, saying, “If I perish, I perish,” and prepares to approach the king uninvited.",
      "5": "Esther approaches the king, who receives her favorably. She invites the king and Haman to a banquet, arousing Haman’s pride and fury toward Mordecai.",
      "6": "The king, unable to sleep, reads records and learns of Mordecai’s past loyalty. Haman, intending to seek Mordecai’s death, is ordered to honor him publicly instead.",
      "7": "At Esther’s banquet, she exposes Haman’s plot against her people. The king orders Haman to be hanged on the gallows he had prepared for Mordecai.",
      "8": "The king grants Esther and Mordecai authority to write a decree allowing Jews to defend themselves. Mordecai is honored, and the Jews rejoice.",
      "9": "The Jews defeat their enemies on the appointed day. Purim is established as an annual feast to celebrate their deliverance.",
      "10": "Mordecai is exalted to second in command under the king, bringing prosperity and peace to the Jews."
    }
  },
  {
    "name": "Job",
    "slug": "job",
    "testament": "Old Testament",
    "category": "Poetry & Writings",
    "author": "Unknown",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Job, a righteous man, is blessed with wealth and family. Satan challenges his integrity. God permits Satan to test him. Job loses possessions and children but remains faithful.",
      "2": "Satan is allowed to afflict Job with painful sores. Job’s wife urges him to curse God, but he refuses. Three friends—Eliphaz, Bildad, and Zophar—come to comfort him.",
      "3": "Job laments his birth, wishing he had never lived, and pours out his anguish.",
      "4": "Eliphaz speaks, suggesting Job’s suffering is due to hidden sin and urging him to seek God for restoration.",
      "5": "Eliphaz continues, emphasizing that God disciplines but also heals those who repent.",
      "6": "Job responds, expressing the weight of his suffering and disappointment with his friends’ lack of compassion.",
      "7": "Job laments life’s brevity and misery, questioning why God seems to target him.",
      "8": "Bildad argues that Job’s children may have sinned, and that Job should repent for God to restore him.",
      "9": "Job acknowledges God’s power and sovereignty but despairs of contending with Him, longing for a mediator.",
      "10": "Job pleads with God to explain his suffering and laments being born only to suffer.",
      "11": "Zophar accuses Job of great guilt and urges him to repent, promising restoration if he does.",
      "12": "Job responds by affirming his knowledge of God’s wisdom and power, countering his friends’ simplistic views.",
      "13": "Job declares his desire to argue his case before God and accuses his friends of speaking falsely for God.",
      "14": "Job reflects on human frailty, death, and his longing for renewal beyond the grave.",
      "15": "Eliphaz insists Job’s words show guilt, describing the fate of the wicked as hopeless.",
      "16": "Job laments his friends’ cruelty, describing himself as crushed by God, yet he hopes for a heavenly witness.",
      "17": "Job despairs of life, feeling mocked and abandoned, and longs for the grave as relief.",
      "18": "Bildad describes the terrifying fate of the wicked, implying Job fits this pattern.",
      "19": "Job laments abandonment by friends and family but declares faith: “I know my Redeemer lives.”",
      "20": "Zophar argues that the wicked prosper briefly but quickly face judgment and destruction.",
      "21": "Job observes that many wicked live long, prosperous lives, contradicting his friends’ claims.",
      "22": "Eliphaz accuses Job of oppression and great sin, urging him to repent for restoration.",
      "23": "Job longs to present his case before God, confident he would be vindicated, though he cannot find Him.",
      "24": "Job observes injustice in the world, with the wicked oppressing the poor, seemingly unpunished.",
      "25": "Bildad emphasizes human unworthiness before God’s greatness and holiness.",
      "26": "Job marvels at God’s power in creation, describing His control over the heavens and seas.",
      "27": "Job maintains his integrity, insisting he will not deny his righteousness, though describing the fate of the wicked.",
      "28": "A poem on wisdom: true wisdom is hidden from man and found only in the fear of the Lord.",
      "29": "Job recalls his past honor, prosperity, and respect, when God’s blessing was evident in his life.",
      "30": "Job laments his present humiliation and suffering, contrasting it with his former honor.",
      "31": "Job makes his final defense, declaring his innocence and integrity in moral, social, and spiritual matters.",
      "32": "Elihu, a younger man, speaks after the friends fall silent, angry at both Job and the friends’ failure.",
      "33": "Elihu argues that God speaks through suffering to correct and save people from pride and destruction.",
      "34": "Elihu defends God’s justice, insisting He cannot do wrong, and challenges Job’s claims of innocence.",
      "35": "Elihu argues that human sin or righteousness does not affect God’s nature but affects other people.",
      "36": "Elihu insists God uses suffering to teach and discipline, calling Job to humble submission.",
      "37": "Elihu describes God’s greatness in creation and His control over storms, preparing for God’s appearance.",
      "38": "God speaks from the whirlwind, questioning Job about creation to reveal His wisdom and Job’s limitations.",
      "39": "God continues, describing animals and nature to highlight His power and wisdom beyond human control.",
      "40": "God challenges Job again. Job humbles himself. God describes the behemoth as an example of His mighty creation.",
      "41": "God describes Leviathan’s power, emphasizing human inability and His own unmatched strength.",
      "42": "Job repents in humility. God rebukes Job’s friends for misrepresenting Him. Job intercedes for them, and God restores Job’s fortunes, blessing him greatly."
    }
  },
  {
    "name": "Psalms",
    "slug": "psalms",
    "testament": "Old Testament",
    "category": "Poetry & Writings",
    "author": "David & others",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Anonymous (wisdom psalm). Theme: contrast of righteous and wicked. The blessed one delights in God’s law and prospers, while the wicked perish.",
      "2": "Davidic (royal/messianic psalm). Theme: God’s anointed King. Nations rebel, but God establishes His King; refuge in Him brings blessing.",
      "3": "Davidic (when fleeing Absalom). Theme: trust amid danger. Surrounded by enemies, David cries to God and rests in His sustaining protection.",
      "4": "Davidic. Theme: evening prayer of trust. David calls on God for deliverance, exhorts trust, and finds peace in God alone.",
      "5": "Davidic. Theme: morning prayer for guidance. David contrasts the wicked and the righteous, asking God to lead him in His way.",
      "6": "Davidic (penitential psalm). Theme: cry for mercy. David pleads for healing and deliverance, trusting God will hear and save.",
      "7": "Davidic (concerning Cush the Benjamite). Theme: appeal for justice. David calls on God as righteous judge against false accusations.",
      "8": "Davidic (hymn). Theme: God’s majesty and human dignity. Creation reveals God’s glory, and humanity is crowned with honor under Him.",
      "9": "Davidic. Theme: thanksgiving for God’s justice. David praises God for judging nations and delivering the oppressed.",
      "10": "Anonymous (lament). Theme: God’s justice for the oppressed. The psalmist laments the arrogance of the wicked and calls on God to act.",
      "11": "Davidic. Theme: confidence in God’s justice. Though foundations crumble, the Lord is righteous and tests both wicked and just.",
      "12": "Davidic. Theme: God’s faithful word. Surrounded by lies and deceit, David trusts the pure and flawless word of the Lord.",
      "13": "Davidic. Theme: prayer in despair. Feeling abandoned, David cries out, but ends with renewed trust in God’s steadfast love.",
      "14": "Davidic. Theme: human corruption. The fool denies God, all are corrupt, but God is with the righteous generation.",
      "15": "Davidic. Theme: who may dwell with God. A description of the righteous life: blamelessness, truthfulness, and integrity.",
      "16": "Davidic (Miktam). Theme: God as refuge. David delights in God’s presence, confident in His eternal security and hope.",
      "17": "Davidic (prayer). Theme: plea for vindication. David calls on God to examine his heart and protect him from violent enemies.",
      "18": "Davidic (royal thanksgiving). Theme: God’s deliverance. David praises God for rescuing him from enemies, exalting His power and faithfulness.",
      "19": "Davidic. Theme: God’s revelation. The heavens declare God’s glory, and His law is perfect, reviving the soul.",
      "20": "Davidic (royal psalm). Theme: prayer for victory. The people pray for the king’s success, trusting God over human power.",
      "21": "Davidic (royal psalm). Theme: thanksgiving for victory. David rejoices in God’s strength and salvation; the king’s enemies will be destroyed.",
      "22": "Davidic (lament/messianic). Theme: suffering and deliverance. David cries of forsakenness, yet trusts God; prophecy fulfilled in Christ’s crucifixion.",
      "23": "Davidic (shepherd psalm). Theme: God as shepherd. The Lord provides, guides, protects, and restores, giving eternal security.",
      "24": "Davidic. Theme: the King of glory. God owns the earth; only the pure may ascend His hill. The King of glory enters triumphantly.",
      "25": "Davidic (acrostic prayer). Theme: trust and guidance. David pleads for forgiveness, guidance, and deliverance from enemies.",
      "26": "Davidic. Theme: integrity before God. David appeals for vindication, walking blamelessly and loving God’s house.",
      "27": "Davidic. Theme: trust in God’s presence. The Lord is my light and salvation; David longs to dwell in God’s house and seeks His help.",
      "28": "Davidic. Theme: prayer for deliverance. David pleads not to be dragged with the wicked; he praises God for hearing his cry.",
      "29": "Davidic (hymn). Theme: the voice of the Lord. God’s voice thunders over creation; He reigns as King, giving peace to His people.",
      "30": "Davidic (song for temple dedication). Theme: thanksgiving for deliverance. Mourning turns to dancing as God rescues from death.",
      "31": "Davidic. Theme: refuge in God. In distress, David entrusts his spirit to God, praising His steadfast love.",
      "32": "Davidic (penitential psalm). Theme: blessing of forgiveness. Confession brings relief; God forgives and surrounds with steadfast love.",
      "33": "Anonymous (hymn). Theme: praise of God’s sovereignty. God’s word is upright, His plans stand forever, and He cares for His people.",
      "34": "Davidic (when feigning madness before Abimelek). Theme: God delivers the righteous. David calls to taste and see God’s goodness.",
      "35": "Davidic. Theme: plea for vindication. David asks God to contend with those who attack him, rejoicing when the Lord rescues.",
      "36": "Davidic. Theme: contrast of wickedness and God’s love. The wicked plot evil, but God’s steadfast love reaches the heavens.",
      "37": "Davidic (wisdom psalm). Theme: trust vs. fretting. The wicked wither, but the righteous inherit the land and know God’s peace.",
      "38": "Davidic (penitential psalm). Theme: cry under discipline. David confesses sin, laments suffering, and seeks God’s salvation.",
      "39": "Davidic. Theme: life’s brevity. David reflects on human frailty, pleading for deliverance and hope in God.",
      "40": "Davidic. Theme: thanksgiving and petition. David praises God’s past deliverance, declares His works, and prays for present help.",
      "41": "Davidic. Theme: blessed are those who consider the poor. David prays for healing, laments betrayal by a close friend, and affirms God’s sustaining presence.",
      "42": "Sons of Korah (lament). Theme: longing for God. As a deer pants for water, so the psalmist thirsts for God amid despair and exile.",
      "43": "Anonymous (linked to Psalm 42, likely Korahite). Theme: prayer for vindication. The psalmist pleads for God’s light and truth to lead him back to His altar.",
      "44": "Sons of Korah (communal lament). Theme: appeal for God’s help. Despite faithfulness, Israel suffers defeat and pleads for deliverance.",
      "45": "Sons of Korah (royal/wedding psalm). Theme: the king’s majesty and the bride’s beauty, foreshadowing Christ the Bridegroom.",
      "46": "Sons of Korah. Theme: God our refuge. Though nations rage and the earth shakes, God is present and exalted among the nations.",
      "47": "Sons of Korah. Theme: God the King of all nations. A call to clap and shout in triumph, for God reigns over the earth.",
      "48": "Sons of Korah (hymn). Theme: Zion, the city of God. God’s greatness and protection are celebrated in His holy city.",
      "49": "Sons of Korah (wisdom psalm). Theme: the futility of wealth. Rich and poor alike face death, but God redeems the faithful.",
      "50": "Asaph. Theme: true worship. God summons the earth, condemning empty ritual and demanding obedience and thanksgiving.",
      "51": "Davidic (after sin with Bathsheba). Theme: repentance. David confesses sin, asks for a clean heart, and pleads for renewed joy in God’s salvation.",
      "52": "Davidic (when Doeg betrayed him). Theme: God’s judgment on the deceitful. The wicked trust in riches, but the righteous trust in God’s steadfast love.",
      "53": "Davidic. Theme: human corruption. The fool denies God; all are corrupt, but God saves His people.",
      "54": "Davidic (when Ziphites betrayed him). Theme: prayer for deliverance. David trusts God to repay his enemies and uphold him.",
      "55": "Davidic. Theme: betrayal’s pain. David laments treachery by a close companion but casts his burden on the Lord.",
      "56": "Davidic (when seized by Philistines in Gath). Theme: trust amid fear. When afraid, David trusts God, who delivers him from death.",
      "57": "Davidic (when fleeing Saul in a cave). Theme: refuge in God. Amid danger, David sings praise for God’s steadfast love and faithfulness.",
      "58": "Davidic. Theme: condemnation of unjust rulers. The wicked are likened to venomous snakes, but the righteous rejoice at God’s judgment.",
      "59": "Davidic (when Saul sent men to watch his house). Theme: deliverance from enemies. David prays for protection and praises God as fortress.",
      "60": "Davidic (after battle with Aram and Edom). Theme: national lament and hope. Israel cries for restoration, but God promises victory.",
      "61": "Davidic. Theme: prayer for refuge. From the ends of the earth David cries to God, asking to be led to the rock higher than himself and to dwell in God’s presence forever.",
      "62": "Davidic. Theme: trust in God alone. Salvation, honor, and refuge are found in God, not in wealth or human strength.",
      "63": "Davidic (when in the wilderness of Judah). Theme: longing for God’s presence. David thirsts for God, praising Him even in dry and weary places.",
      "64": "Davidic. Theme: deliverance from secret plots. David laments the schemes of the wicked, but God will strike them down.",
      "65": "Davidic (song of praise). Theme: God’s abundant provision. The psalm celebrates God’s forgiveness, power over creation, and blessing of the earth.",
      "66": "Anonymous (hymn). Theme: praise for God’s mighty deeds. The psalmist recalls God’s works in Israel’s history and personal deliverance.",
      "67": "Anonymous (song). Theme: God’s blessing for the nations. A prayer that God’s face shine on His people so all nations may know His salvation.",
      "68": "Davidic. Theme: God as victorious warrior. God scatters His enemies, cares for the fatherless, and dwells in Zion amid triumph.",
      "69": "Davidic (lament/messianic). Theme: suffering servant. David cries out in deep distress, foreshadowing Christ’s passion.",
      "70": "Davidic. Theme: urgent plea for help. A short psalm asking God to deliver quickly from adversaries.",
      "71": "Anonymous (likely elderly psalmist). Theme: lifelong trust. From youth to old age, the psalmist declares God’s faithfulness and seeks continued deliverance.",
      "72": "Solomonic (or for Solomon). Theme: the ideal king. A prayer for righteous rule, justice for the poor, and worldwide dominion; foreshadows Christ.",
      "73": "Asaph (wisdom psalm). Theme: struggle with the prosperity of the wicked. The psalmist finds resolution in God’s presence and eternal justice.",
      "74": "Asaph. Theme: lament over destruction. The psalmist cries to God after the sanctuary is defiled, pleading for deliverance from enemies.",
      "75": "Asaph. Theme: God the righteous judge. The psalm declares that exaltation comes from God, who will bring down the wicked.",
      "76": "Asaph. Theme: God’s awe-inspiring power. God is praised for His victory over enemies, instilling fear among the nations.",
      "77": "Asaph. Theme: remembering God’s deeds. In trouble, the psalmist recalls God’s wonders, especially the exodus, as grounds for hope.",
      "78": "Asaph (historical psalm). Theme: Israel’s repeated rebellion. The psalm recounts God’s faithfulness and Israel’s failures, urging future generations to trust Him.",
      "79": "Asaph (communal lament). Theme: plea after destruction. The psalmist cries out as Jerusalem lies in ruins, asking God for mercy and justice.",
      "80": "Asaph. Theme: prayer for restoration. God is addressed as the Shepherd of Israel, asked to shine His face and save His people.",
      "81": "Asaph. Theme: call to covenant faithfulness. God recalls His deliverance of Israel, urges obedience, and laments their stubbornness.",
      "82": "Asaph. Theme: God the supreme Judge. God rebukes unjust earthly rulers, declaring His authority over all nations.",
      "83": "Asaph. Theme: prayer against hostile nations. The psalmist pleads with God to defeat conspiring enemies and show His supremacy.",
      "84": "Sons of Korah. Theme: longing for God’s dwelling. Blessed are those who live in God’s house and find strength in His presence.",
      "85": "Sons of Korah. Theme: plea for restoration. The psalm recalls past deliverance, prays for revival, and trusts in God’s steadfast love.",
      "86": "Davidic. Theme: prayer for mercy and help. David cries out for God’s grace and affirms His greatness among the nations.",
      "87": "Sons of Korah. Theme: Zion, the city of God. Nations are counted as born in Zion, showing God’s universal plan of redemption.",
      "88": "Sons of Korah (Heman the Ezrahite). Theme: darkest lament. The psalmist cries out from deep suffering, feeling abandoned by God.",
      "89": "Ethan the Ezrahite. Theme: God’s covenant with David. The psalm praises God’s faithfulness but laments apparent rejection of the king.",
      "90": "Moses. Theme: God’s eternity and human frailty. Life is short under God’s wrath, so the psalmist asks God to teach us to number our days.",
      "91": "Anonymous. Theme: God our refuge. Those who dwell in His shelter are protected; He delivers from fear, plague, and danger.",
      "92": "Anonymous (Sabbath psalm). Theme: praise for God’s works. The righteous flourish like palm trees while the wicked perish.",
      "93": "Anonymous. Theme: God reigns in majesty. The Lord is enthroned, mightier than the seas, and His decrees stand firm.",
      "94": "Anonymous. Theme: plea for justice. The psalmist asks God to punish the arrogant and affirms His discipline brings blessing.",
      "95": "Anonymous. Theme: call to worship and obedience. God is the great King; Israel is warned not to harden their hearts like in the wilderness.",
      "96": "Anonymous. Theme: God’s reign proclaimed to the nations. A new song celebrates His glory and coming judgment with equity.",
      "97": "Anonymous. Theme: the Lord reigns. Fire and lightning reveal His glory, idols are shamed, and the righteous rejoice in Him.",
      "98": "Anonymous. Theme: joy in God’s salvation. Sing to the Lord for His marvelous deeds; He will judge the world with righteousness.",
      "99": "Anonymous. Theme: the holy King. God reigns over nations in justice, exalted in Zion, worthy of worship.",
      "100": "Anonymous (thanksgiving psalm). Theme: call to joyful worship. All lands are summoned to serve the Lord with gladness, for His steadfast love endures forever.",
      "101": "Davidic. Theme: commitment to integrity. David vows to live blamelessly, reject wickedness, and rule justly in his house.",
      "102": "Anonymous (penitential/lament). Theme: prayer of the afflicted. The psalmist laments personal and national suffering, yet affirms God’s eternal reign and future restoration of Zion.",
      "103": "Davidic. Theme: praise for God’s mercy. Bless the Lord, who forgives, heals, redeems, and shows steadfast love from everlasting to everlasting.",
      "104": "Anonymous (hymn). Theme: God the Creator and Sustainer. The psalm celebrates God’s majesty, creation’s order, and His providential care for all creatures.",
      "105": "Anonymous (historical psalm). Theme: God’s covenant faithfulness. Recounts God’s deeds from Abraham through the exodus and settlement in Canaan.",
      "106": "Anonymous. Theme: Israel’s unfaithfulness. The psalm confesses sins throughout Israel’s history, yet affirms God’s steadfast love and plea for deliverance.",
      "107": "Anonymous. Theme: thanksgiving for deliverance. God rescues people from distress—wanderers, prisoners, the sick, and sailors—showing His steadfast love.",
      "108": "Davidic (combination of Psalms 57 & 60). Theme: confidence in victory. David praises God and calls for His help over nations.",
      "109": "Davidic (lament). Theme: plea against false accusers. David calls for judgment on his enemies but ends affirming God as his deliverer.",
      "110": "Davidic (royal/messianic psalm). Theme: the Lord’s anointed king and priest. The Messiah reigns at God’s right hand as priest forever.",
      "111": "Anonymous. Theme: praise for God’s works. His deeds are majestic, His covenant remembered, and His precepts trustworthy.",
      "112": "Anonymous (wisdom psalm). Theme: blessings of the righteous. Those who fear the Lord are steadfast, generous, and remembered forever.",
      "113": "Anonymous (Hallel psalm). Theme: praise to the exalted Lord. God raises the poor and needy, showing His greatness.",
      "114": "Anonymous (Hallel psalm). Theme: God’s power at the exodus. The sea fled and mountains trembled at His presence.",
      "115": "Anonymous (Hallel psalm). Theme: God vs. idols. Unlike powerless idols, the Lord blesses those who trust Him.",
      "116": "Anonymous (Hallel psalm). Theme: thanksgiving for deliverance. The psalmist loves the Lord who heard his cry and vows to call on Him forever.",
      "117": "Anonymous (shortest psalm). Theme: universal praise. All nations are called to glorify God for His steadfast love.",
      "118": "Anonymous (Hallel psalm). Theme: thanksgiving for God’s salvation. The rejected stone becomes the cornerstone; His love endures forever.",
      "119": "Anonymous (acrostic psalm). Theme: delight in God’s law. The longest psalm exalts God’s word as life-giving, guiding, and sustaining.",
      "120": "Anonymous (Song of Ascents). Theme: prayer for deliverance. The psalmist, living among deceitful people, calls on the Lord for peace.",
      "121": "Anonymous (Song of Ascents). Theme: God our keeper. The psalmist lifts eyes to the hills, affirming help comes from the Lord, who guards His people day and night.",
      "122": "Davidic (Song of Ascents). Theme: joy in Jerusalem. The psalmist rejoices in going to God’s house and prays for the peace of Jerusalem.",
      "123": "Anonymous (Song of Ascents). Theme: plea for mercy. The psalmist looks to God’s hand like a servant to a master, asking for mercy amid scorn.",
      "124": "Davidic (Song of Ascents). Theme: God our deliverer. If the Lord had not been on Israel’s side, enemies would have swallowed them alive.",
      "125": "Anonymous (Song of Ascents). Theme: security in God. Those who trust the Lord are like Mount Zion, unshakable and enduring forever.",
      "126": "Anonymous (Song of Ascents). Theme: restoration joy. The psalm recalls God’s past restoration and prays for renewed blessing, with weeping turning into joy.",
      "127": "Solomonic (Song of Ascents). Theme: God builds and sustains. Labor, security, and family prosper only by God’s blessing.",
      "128": "Anonymous (Song of Ascents). Theme: blessings of fearing God. Those who walk in His ways enjoy fruitful family life and peace in Israel.",
      "129": "Anonymous (Song of Ascents). Theme: perseverance amid affliction. Though afflicted from youth, Israel affirms the Lord’s justice against oppressors.",
      "130": "Anonymous (Song of Ascents). Theme: hope in forgiveness. From the depths, the psalmist cries for mercy, waiting on God’s steadfast love and redemption.",
      "131": "Davidic (Song of Ascents). Theme: humility and trust. David quiets his soul like a weaned child, resting in the Lord.",
      "132": "Anonymous (Song of Ascents). Theme: God’s covenant with David. The psalm recalls David’s devotion and affirms God’s promise to dwell in Zion.",
      "133": "Davidic (Song of Ascents). Theme: blessing of unity. Brothers dwelling in unity is like precious oil and the dew of Hermon.",
      "134": "Anonymous (Song of Ascents). Theme: call to bless the Lord. Servants of the Lord in His house are exhorted to lift hands in praise.",
      "135": "Anonymous (hymn). Theme: praise for God’s mighty acts. Unlike idols, God does whatever He pleases and vindicates His people.",
      "136": "Anonymous (liturgical psalm). Theme: God’s steadfast love endures forever. Recounts creation, exodus, conquest, and ongoing providence with refrain.",
      "137": "Anonymous (exilic lament). Theme: grief in Babylon. Exiles weep by the rivers, remembering Zion, and call for justice on their captors.",
      "138": "Davidic. Theme: thanksgiving for God’s steadfast love. David praises God’s faithfulness and prays for continued care.",
      "139": "Davidic. Theme: God’s intimate knowledge. God knows all thoughts and deeds, is present everywhere, and formed us in the womb.",
      "140": "Davidic. Theme: prayer for deliverance from the violent. David asks God to protect him from evildoers and affirms His justice for the needy.",
      "141": "Davidic. Theme: prayer for purity and protection. David asks God to guard his words and heart, and to keep him safe from the wicked.",
      "142": "Davidic (when in the cave). Theme: cry from isolation. David pours out his complaint, acknowledging God as his only refuge.",
      "143": "Davidic (penitential psalm). Theme: prayer for mercy and guidance. David confesses human unrighteousness and seeks God’s deliverance and leading.",
      "144": "Davidic. Theme: God who gives victory. David praises God as his rock, prays for deliverance, and asks blessing on the nation.",
      "145": "Davidic (acrostic hymn). Theme: praise of God’s greatness. The psalmist exalts God’s majesty, goodness, and everlasting kingdom.",
      "146": "Anonymous (Hallel psalm). Theme: trust in God, not princes. God cares for the oppressed, blind, and stranger; He reigns forever.",
      "147": "Anonymous (Hallel psalm). Theme: praise for God’s care. God heals the brokenhearted, governs creation, and blesses Jerusalem.",
      "148": "Anonymous (Hallel psalm). Theme: all creation praises God. Heaven, earth, animals, and people are summoned to worship the Lord.",
      "149": "Anonymous (Hallel psalm). Theme: call to joyful praise. God’s people rejoice in Him and triumph over enemies with His justice.",
      "150": "Anonymous (final Hallel psalm). Theme: universal praise. In a climactic call, everything that has breath is exhorted to praise the Lord with instruments and song."
    }
  },
  {
    "name": "Proverbs",
    "slug": "proverbs",
    "testament": "Old Testament",
    "category": "Poetry & Writings",
    "author": "Solomon & others",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Proverbs begins with a call to wisdom, warning against enticement of sinners and urging fear of the Lord as the foundation of knowledge.",
      "2": "Wisdom protects from evil, delivering from wicked men and adulterous women, and grants understanding of righteousness and justice.",
      "3": "Trust in the Lord with all your heart. Wisdom brings blessing, healing, and favor. Discipline and generosity are encouraged.",
      "4": "A father instructs his son to pursue wisdom diligently, avoiding the path of the wicked and walking in righteousness.",
      "5": "Warnings against adultery: the seductress leads to destruction. Faithfulness in marriage is commended.",
      "6": "Warnings against laziness, dishonesty, and sowing discord. Adultery is again condemned as self-destructive.",
      "7": "A vivid warning against the adulteress, showing how she entices and destroys the foolish young man.",
      "8": "Wisdom personified calls out, declaring her role in creation and her blessings for those who seek her.",
      "9": "Wisdom and folly are personified as hostesses inviting guests. Choosing wisdom leads to life; folly leads to death.",
      "10": "Proverbs of Solomon begin, contrasting the righteous and the wicked in speech, work, and destiny.",
      "11": "Righteousness brings life and stability, while wickedness leads to downfall. Generosity is rewarded.",
      "12": "The righteous are established, diligent, and truthful; the wicked face trouble and ruin.",
      "13": "Wise living brings blessing; laziness, folly, and poor speech lead to ruin.",
      "14": "The wise build up, but the foolish tear down. Righteousness exalts a nation; sin is a reproach.",
      "15": "Gentle words turn away wrath. God sees all. Righteousness and humility bring blessing.",
      "16": "Commit your works to the Lord. God directs human steps. Pride leads to downfall; humility to honor.",
      "17": "Better peace with little than strife with plenty. The Lord tests hearts. Friends love; fools bring grief.",
      "18": "Words bring life or death. A fool loves quarrels. A brother offended is hard to win back.",
      "19": "Wealth attracts many friends. Discipline children. Fear of the Lord leads to life.",
      "20": "Honesty is valued. Wine leads to mockery. The Lord directs steps. A faithful person is rare.",
      "21": "God weighs hearts. Sacrifice is meaningless without obedience. Righteousness brings life.",
      "22": "A good name is better than riches. Train up a child in the way he should go. Warnings against debt and injustice.",
      "23": "Warnings against gluttony, drunkenness, and envy. Parents are urged to discipline children in wisdom.",
      "24": "Do not envy evildoers. Wisdom builds houses. The righteous may fall but rise again. Prepare for battle with counsel.",
      "25": "Proverbs of Solomon copied by Hezekiah’s men. Wise speech, patience, and self-control are praised.",
      "26": "Fools despise wisdom. Laziness and gossip cause ruin. Hypocrisy and deceit are condemned.",
      "27": "Do not boast about tomorrow. Iron sharpens iron. Faithful friends are a blessing.",
      "28": "The wicked flee though none pursue. Greed and injustice bring ruin. Trust in the Lord brings prosperity.",
      "29": "A stiff-necked people are destroyed. Discipline brings wisdom. Righteousness exalts a nation.",
      "30": "Sayings of Agur: reflections on human limits, creation’s wonders, and warnings against arrogance.",
      "31": "Sayings of King Lemuel: warnings against lust and drunkenness. The virtuous woman is praised for her wisdom, diligence, and fear of the Lord."
    }
  },
  {
    "name": "Ecclesiastes",
    "slug": "ecclesiastes",
    "testament": "Old Testament",
    "category": "Poetry & Writings",
    "author": "Solomon (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "The Teacher reflects on life’s futility: all is vanity. Generations come and go, and nothing is truly new under the sun.",
      "2": "The Teacher pursues pleasure, projects, wealth, and wisdom, yet finds them meaningless. Both wise and foolish share the same fate of death.",
      "3": "There is a time for everything under heaven. God has made everything beautiful in its time. Humans cannot fathom His work from beginning to end.",
      "4": "The Teacher laments oppression, envy, and toil. Companionship is better than isolation, for two are stronger than one.",
      "5": "Caution is urged in approaching God. Wealth and possessions cannot satisfy, but fearing God and enjoying His gifts brings meaning.",
      "6": "Riches without the ability to enjoy them are meaningless. Human desires are endless, and the future is uncertain.",
      "7": "Wisdom is valuable, though limited. The Teacher reflects on human wickedness and the importance of fearing God.",
      "8": "Obedience to kings is urged, but ultimate sovereignty belongs to God. Humans cannot fully understand His ways.",
      "9": "Death comes to all. The Teacher urges enjoying life’s simple pleasures as God’s gift, for wisdom and effort alone cannot control outcomes.",
      "10": "Wisdom protects, but folly brings danger. Leaders and workers are exhorted to act wisely and avoid foolishness.",
      "11": "Take risks and be generous, for the future is uncertain. Youth should rejoice but remember God will judge all deeds.",
      "12": "Remember your Creator in youth, before old age and death come. The conclusion: fear God and keep His commandments, for this is the whole duty of man."
    }
  },
  {
    "name": "Song of Songs",
    "slug": "song-of-songs",
    "testament": "Old Testament",
    "category": "Poetry & Writings",
    "author": "Solomon (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "The bride expresses her love and desire for her beloved. She delights in his affection, and he praises her beauty.",
      "2": "The bride and groom delight in each other. The bride longs for her beloved’s presence. Love is described as delightful and life-giving.",
      "3": "The bride searches for her beloved at night and finds him. A royal wedding procession is described with splendor.",
      "4": "The groom praises the bride’s beauty in detail. Their love is celebrated as a garden of delight.",
      "5": "The bride dreams of her beloved, but he withdraws when she hesitates. She searches for him, suffering mistreatment, and describes his excellence.",
      "6": "The bride praises her beloved. The groom describes her beauty and uniqueness, exalting her above others.",
      "7": "The groom praises the bride’s physical beauty with imagery of grace and fruitfulness. Their mutual desire and intimacy are expressed.",
      "8": "The bride desires public acknowledgment of their love. Love is celebrated as strong and unyielding. The poem concludes with longing and union."
    }
  },
  {
    "name": "Isaiah",
    "slug": "isaiah",
    "testament": "Old Testament",
    "category": "Major Prophets",
    "author": "Isaiah",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God calls out Israel's rebellion and sin, comparing the nation to Sodom and Gomorrah. Despite their religious rituals, God rejects their worship because of injustice and oppression. He calls for repentance and promises restoration if they obey.",
      "2": "Isaiah's vision of the future temple mountain where all nations will come to learn God's ways. Swords will be beaten into plowshares in the messianic age. The prophet calls people to walk in God's light rather than in pride and idolatry.",
      "3": "God's judgment on Jerusalem and Judah for their corrupt leadership and social injustice. The proud women of Zion will be humbled. Leaders who should guide the people instead lead them astray, bringing divine judgment.",
      "4": "After judgment comes purification and restoration. The Branch of the Lord will be beautiful and glorious. Jerusalem will be cleansed, and God's presence will return as a canopy of protection over Mount Zion.",
      "5": "The song of the vineyard - God planted Israel as a vineyard expecting justice but found bloodshed, righteousness but cries of distress. Six woes are pronounced on the wicked. God will bring foreign nations to judge Israel.",
      "6": "Isaiah's call vision in the year King Uzziah died. He sees the Lord on His throne, seraphim proclaiming God's holiness. Isaiah confesses his sinfulness, is cleansed, and accepts God's commission to preach to a hardened people.",
      "7": "The Immanuel prophecy during Ahaz's reign. Syria and Israel threaten Judah, but God promises deliverance through a virgin bearing a son called Immanuel. Ahaz's lack of faith brings Assyrian invasion.",
      "8": "The birth of Maher-shalal-hash-baz as a sign of coming judgment. Isaiah's disciples are sealed as witnesses. The chapter warns against seeking mediums instead of God's word, ending with hope for those in darkness.",
      "9": "The great light shining in darkness - a child is born who will be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace. His government will bring endless peace to David's throne. God's anger burns against Israel's pride.",
      "10": "Woe to those who make unjust laws and deprive the poor of justice. Assyria is God's rod of judgment, but they will be punished for their pride. A remnant will return to the Mighty God.",
      "11": "The messianic king from Jesse's root will rule with righteousness and justice. The Spirit will rest on Him. In His kingdom, the wolf will lie with the lamb. He will gather the dispersed of Israel and Judah.",
      "12": "A song of salvation and thanksgiving for God's deliverance. The redeemed will draw water from the wells of salvation with joy and praise the Holy One of Israel among all peoples.",
      "13": "Oracle against Babylon. The day of the Lord comes with wrath and fierce anger. Babylon's pride will be brought low, and the city will become like Sodom and Gomorrah, uninhabited forever.",
      "14": "Israel will be restored and rule over their oppressors. The king of Babylon falls from heaven like Lucifer. His pride and ambition to be like God brings his downfall. Philistia is also warned of coming judgment.",
      "15": "Prophecy against Moab. Their cities will be destroyed in one night. The people flee as refugees, mourning their devastation. Even Isaiah's heart cries out for Moab in their distress.",
      "16": "Moab seeks refuge in Zion during their time of judgment. The Moabites are advised to send tribute to Jerusalem. Their pride will be humbled, and their glory will come to an end within three years.",
      "17": "Damascus and Israel will be destroyed together because they forgot the God of their salvation. Though they plant pleasant plants, the harvest will be a day of grief and incurable pain.",
      "18": "A message to the land beyond the rivers of Cush (Ethiopia). God will watch and act at the proper time. When the harvest is ready, He will cut down His enemies and bring tribute to Mount Zion.",
      "19": "Egypt's judgment as their gods fail and civil war breaks out. The Nile will dry up and their economy collapse. Yet Egypt will know the Lord, and Israel, Egypt, and Assyria will worship together.",
      "20": "Isaiah walks naked and barefoot for three years as a sign of Egypt and Ethiopia's coming captivity by Assyria. Those who trust in these nations instead of God will be ashamed and disappointed.",
      "21": "The fall of Babylon is announced. The watchman reports the collapse of Babylon's gods. Dumah (Edom) and Arabia also face judgment. Arabia's glory will fail within a year.",
      "22": "The valley of vision - Jerusalem's false confidence in their defenses instead of trusting in God. When judgment comes, they feast instead of repent. Shebna is removed from office, and Eliakim is installed as a faithful steward.",
      "23": "Oracle against Tyre, the merchant city. Her trade networks will be broken, and she will be forgotten for seventy years. Afterward, she will return to her trade and dedicate her profits to the Lord.",
      "24": "The earth is laid waste because its inhabitants have broken God's eternal covenant. The city of chaos is broken down. Yet the righteous remnant will sing from the ends of the earth of God's majesty.",
      "25": "A song of praise for God's deliverance. He destroys the stronghold of ruthless nations and provides a feast for all peoples. Death itself will be swallowed up forever, and tears wiped from all faces.",
      "26": "A song of salvation for the strong city with salvation as its walls. The righteous enter through its gates. God brings down the proud city and establishes peace for those who trust in the everlasting Rock.",
      "27": "The Lord will punish Leviathan and the dragon of the sea. Israel is God's vineyard that He guards and waters. The scattered people will be gathered to worship at the holy mountain in Jerusalem.",
      "28": "Woe to the drunkards of Ephraim whose fading crown will be trampled. God will be a crown of glory to the remnant. The cornerstone is laid in Zion for those who believe. Judgment will sweep away lies.",
      "29": "Ariel (Jerusalem) will be besieged and brought low, speaking from the dust. Their enemies will be like a dream that vanishes. The people honor God with their lips while their hearts are far away. Wisdom will return.",
      "30": "Woe to the rebellious children who make plans without God's counsel and seek Egypt's help. They reject God's word and want smooth lies. Though God waits to be gracious, judgment must come first before restoration.",
      "31": "Woe to those who go to Egypt for help instead of looking to the Holy One of Israel. Egypt's horses are flesh, not spirit. God will defend Jerusalem like birds flying overhead, protecting and delivering.",
      "32": "A king will reign in righteousness, and princes will rule with justice. The Spirit will transform the wilderness into a fruitful field. Peace and security will be the fruit of righteousness forever.",
      "33": "Woe to the destroyer who will himself be destroyed. God will arise and be exalted. He fills Zion with justice and righteousness. The king in his beauty will be seen, and Jerusalem will be a quiet dwelling.",
      "34": "God's judgment on all nations, especially Edom. The land will become a wasteland inhabited by wild animals. God's book records all this, and His Spirit will gather them. The sword is bathed in heaven for judgment.",
      "35": "The wilderness and desert will bloom and be glad. The weak will be strengthened, and the fearful encouraged. Waters will spring up in the desert. The redeemed will walk on the Highway of Holiness to Zion with joy.",
      "36": "Sennacherib's invasion and Rabshakeh's blasphemous threats against Jerusalem and Hezekiah. The Assyrian commander mocks God and tries to turn the people against their king through propaganda and psychological warfare.",
      "37": "Hezekiah receives Isaiah's prophecy and prays to God. Isaiah prophesies Sennacherib's defeat and death. God's angel destroys 185,000 Assyrians in one night. Sennacherib returns to Nineveh and is murdered by his sons.",
      "38": "Hezekiah's illness and recovery after Isaiah's prophecy of death. The king prays desperately, and God grants him fifteen more years. The sun's shadow moves backward as a sign. Hezekiah's psalm of thanksgiving for healing.",
      "39": "Babylonian envoys visit Hezekiah during his recovery. The proud king shows them all his treasures. Isaiah prophesies that everything will be carried to Babylon, and some of his sons will become eunuchs there.",
      "40": "Comfort God's people! Their warfare is ended, and their sin pardoned. Prepare the way of the Lord in the wilderness. All flesh is grass, but God's word stands forever. God feeds His flock like a shepherd.",
      "41": "God challenges the idols to prove their power by predicting the future. He has raised up Cyrus from the east to accomplish His purposes. Israel is God's chosen servant whom He will help and not forsake.",
      "42": "The first Servant Song - God's chosen one will bring justice to the nations gently and faithfully. God calls His people to be a light to the nations but they have become blind and deaf to His purposes.",
      "43": "Fear not, for God has redeemed Israel. They will pass through waters and fire safely. God will gather them from all directions. They are His witnesses that He alone is God and Savior.",
      "44": "God will pour His Spirit on Israel's offspring like water on thirsty ground. He formed them and will help them. The folly of idolatry is exposed - making gods from the same wood used for cooking fires.",
      "45": "Cyrus is God's anointed to subdue nations and rebuild Jerusalem. God alone is creator and sovereign. He forms light and darkness, makes peace and creates calamity. Let righteousness spring up from the earth.",
      "46": "Babylon's idols Bel and Nebo are carried away by beasts while God carries His people. He declares the end from the beginning. His counsel will stand, and He will call a bird of prey (Cyrus) from the east.",
      "47": "Babylon, the virgin daughter, will sit in the dust as a slave. Her sorceries and enchantments cannot save her from sudden destruction. She trusted in her wickedness saying, 'No one sees me,' but judgment comes.",
      "48": "God calls stubborn Israel to listen. He declared things long ago because He knew they were treacherous. For His name's sake, He restrains His anger. Come out of Babylon - the Lord has redeemed Jacob.",
      "49": "The second Servant Song - called from the womb to restore Israel and be a light to the nations. Though Israel seems forgotten, God will not forget them. Kings will bow down to the Holy One of Israel.",
      "50": "Where is the divorce certificate? Israel was sold for their iniquities. The third Servant Song - He gives His back to those who strike and does not hide from shame, knowing God helps Him.",
      "51": "Listen, you who pursue righteousness! Look to Abraham your father. God will comfort Zion and make her wilderness like Eden. His salvation will be forever, but the heavens will vanish like smoke.",
      "52": "Awake, Zion, and put on beautiful garments! Shake off the dust and break free from bondage. How beautiful are the feet of those who bring good news! All will see God's salvation.",
      "53": "The fourth Servant Song - the suffering servant despised and rejected by men. He bore our griefs and carried our sorrows. By His wounds we are healed. He was cut off for our transgressions.",
      "54": "Sing, barren woman! Your children will be more than those of the married woman. God will gather you with great compassion. His kindness will not depart, and His covenant of peace will not be removed.",
      "55": "Come to the waters, everyone who thirsts! Buy wine and milk without money. Seek the Lord while He may be found. His thoughts and ways are higher than ours. His word will accomplish its purpose.",
      "56": "Maintain justice and do righteousness, for God's salvation is near. Foreigners and eunuchs who keep His covenant will have a place in His house. It will be called a house of prayer for all nations.",
      "57": "The righteous perish while no one understands. Israel commits adultery with idols on every high hill. Yet God dwells with the contrite and humble to revive their hearts and heal their backslidings.",
      "58": "True fasting that God desires is not religious ritual but breaking chains of injustice, sharing bread with the hungry, and caring for the oppressed. Then your light will shine like the dawn.",
      "59": "God's hand is not too short to save, but sins separate people from Him. He sees the lack of justice and intervenes with His own arm. He comes as Redeemer to those who turn from transgression.",
      "60": "Arise, shine, for your light has come! Nations will come to your light and kings to your brightness. The wealth of nations will flow to you, and you will know that the Lord is your Savior.",
      "61": "The Spirit of the Lord is upon me to preach good news to the poor, bind up the brokenhearted, and proclaim liberty to captives. You will be called oaks of righteousness, priests of the Lord.",
      "62": "For Zion's sake I will not keep silent until her vindication shines like the dawn. You will be called by a new name and be a crown of beauty in God's hand. You will never again be forsaken.",
      "63": "Who is this coming from Edom in crimson garments? It is God who speaks in righteousness, mighty to save. He has trodden the winepress alone. Isaiah recalls God's loving kindness and mercy to Israel.",
      "64": "Oh that You would rend the heavens and come down! We have all become like one who is unclean. Yet You are our Father, and we are the clay. Your holy cities are a wilderness, and Your temple is burned.",
      "65": "God was ready to be found by those who did not seek Him. He will create new heavens and a new earth. Former things will not be remembered. There will be no more weeping or cries of distress.",
      "66": "Heaven is God's throne and earth His footstool - what house could contain Him? He looks to the humble and contrite. Before Zion travailed, she gave birth. All nations will come to see His glory and worship."
    }
  },
  {
    "name": "Jeremiah",
    "slug": "jeremiah",
    "testament": "Old Testament",
    "category": "Major Prophets",
    "author": "Jeremiah",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God calls Jeremiah as a prophet, assuring him of His presence and giving him authority over nations to uproot and to plant.",
      "2": "God accuses Israel of forsaking Him, the fountain of living waters, for worthless idols. Their unfaithfulness is exposed.",
      "3": "God likens Israel’s idolatry to adultery. Yet He calls them to return, promising restoration if they repent.",
      "4": "Jeremiah warns of coming judgment through invasion. Disaster from the north is imminent due to Israel’s sins.",
      "5": "God condemns widespread corruption. Both poor and rich reject Him. Prophets and priests deceive the people.",
      "6": "Jerusalem’s destruction is announced. Despite warnings, the people refuse correction. Their sacrifices are worthless to God.",
      "7": "Jeremiah delivers the temple sermon, warning that rituals cannot replace obedience. Shiloh’s fate warns Jerusalem.",
      "8": "The people persist in lies and refuse to repent. Jeremiah grieves over their incurable wound.",
      "9": "Jeremiah laments deceit and idolatry. God warns that trusting in wisdom, might, or riches is worthless—boasting must be in knowing Him.",
      "10": "Idols are worthless compared to the living God. Judgment is certain, and Jeremiah prays for correction.",
      "11": "God recalls the covenant with Israel. Conspiracy against Jeremiah arises; God promises judgment on the people.",
      "12": "Jeremiah questions why the wicked prosper. God challenges him to endure greater trials and foretells judgment on nations.",
      "13": "A ruined linen belt symbolizes Judah’s pride. Drunkenness and captivity are foretold. The people are urged to repent.",
      "14": "A drought devastates the land. False prophets deceive, but Jeremiah intercedes. God declares judgment unavoidable.",
      "15": "God tells Jeremiah not to pray for the people. Jeremiah laments his calling, but God reassures him of His presence.",
      "16": "Jeremiah is commanded not to marry, symbolizing coming judgment. Future restoration is promised when God gathers His people.",
      "17": "Trust in man leads to curse; trust in God leads to blessing. The heart is deceitful. Jeremiah prays for deliverance.",
      "18": "The potter’s house illustrates God’s sovereignty. Judah resists His shaping and plots against Jeremiah.",
      "19": "Jeremiah breaks a clay jar at Topheth, symbolizing Jerusalem’s coming destruction.",
      "20": "Jeremiah is beaten and mocked by Pashhur. He laments his suffering yet reaffirms God’s word burning within him.",
      "21": "God tells King Zedekiah that Jerusalem will fall to Babylon. Only surrender ensures life.",
      "22": "Jeremiah warns Judah’s kings to do justice or face ruin. Jehoiakim and Coniah are condemned.",
      "23": "False prophets are condemned. God promises a righteous Branch from David’s line who will reign as king.",
      "24": "Two baskets of figs symbolize exiles: good figs represent those in exile who will be restored; bad figs represent those who remain and will perish.",
      "25": "Judah’s seventy years of exile are foretold. Nations will also drink God’s cup of wrath.",
      "26": "Jeremiah’s temple sermon leads to threats of death, but some defend him, recalling past prophets.",
      "27": "Jeremiah wears a yoke, urging submission to Babylon. False prophets contradict him.",
      "28": "Hananiah falsely prophesies peace and breaks Jeremiah’s yoke. Jeremiah declares Babylon’s yoke will be iron. Hananiah dies as foretold.",
      "29": "Jeremiah’s letter to exiles urges them to seek peace in Babylon and trust God’s promise of future restoration.",
      "30": "God promises restoration and a new covenant. Israel’s captivity will end, and David’s line will reign.",
      "31": "The new covenant is promised: God’s law written on hearts, forgiveness of sins, and restoration of Israel.",
      "32": "Jeremiah buys a field while imprisoned, symbolizing future hope and restoration despite Jerusalem’s siege.",
      "33": "God reaffirms His covenant with David and Levi. Future restoration and prosperity are promised.",
      "34": "Judah breaks its covenant to free slaves. God announces destruction because of their unfaithfulness.",
      "35": "The Rechabites’ faithfulness contrasts with Judah’s disobedience. God promises blessing to them.",
      "36": "Jeremiah dictates God’s words to Baruch. King Jehoiakim burns the scroll. Jeremiah dictates another scroll with added words.",
      "37": "Jeremiah warns Zedekiah of Babylon’s victory. He is arrested and imprisoned on false charges.",
      "38": "Jeremiah is thrown into a cistern but rescued by Ebed-Melek. He tells Zedekiah to surrender or face destruction.",
      "39": "Jerusalem falls to Babylon. Zedekiah is captured. Jeremiah is spared and released by the Babylonians.",
      "40": "Gedaliah is appointed governor. He urges peace, but Ishmael plots against him.",
      "41": "Ishmael assassinates Gedaliah and slaughters many, then is pursued and defeated by Johanan.",
      "42": "Survivors ask Jeremiah for guidance but disobey God’s word, choosing to flee to Egypt.",
      "43": "The people forcibly take Jeremiah to Egypt. He prophesies Babylon’s conquest of Egypt.",
      "44": "Jeremiah condemns the Jews in Egypt for idolatry. They refuse to listen, sealing their judgment.",
      "45": "A word to Baruch: though judgment is coming, God promises to preserve his life.",
      "46": "Prophecies against Egypt: God will punish Egypt, but later restore it.",
      "47": "Prophecy against the Philistines: they will be devastated by Babylon.",
      "48": "Prophecy against Moab: its pride will bring destruction, though restoration is promised in the future.",
      "49": "Prophecies against Ammon, Edom, Damascus, Kedar, Hazor, and Elam: they will be judged but some restored.",
      "50": "Prophecy against Babylon: it will fall as God redeems Israel.",
      "51": "God’s judgment on Babylon is confirmed. Babylon will sink, never to rise again.",
      "52": "Jerusalem falls as in 2 Kings. The temple is destroyed, and the people exiled. Jehoiachin is later released in Babylon."
    }
  },
  {
    "name": "Lamentations",
    "slug": "lamentations",
    "testament": "Old Testament",
    "category": "Major Prophets",
    "author": "Jeremiah (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Jerusalem, once full of people, sits desolate. She weeps bitterly over her destruction, confessing her sins as the cause of her suffering.",
      "2": "God’s anger has brought ruin to Zion. The temple and city are destroyed. The people mourn as children and priests perish.",
      "3": "Jeremiah laments deep personal suffering but finds hope in God’s steadfast love and mercies, which are new every morning.",
      "4": "The horrors of Jerusalem’s siege are described: famine, cruelty, and the downfall of princes. God’s wrath has been poured out fully.",
      "5": "A communal prayer pleads for God’s mercy and restoration. The people confess their suffering and call on God not to forget them."
    }
  },
  {
    "name": "Ezekiel",
    "slug": "ezekiel",
    "testament": "Old Testament",
    "category": "Major Prophets",
    "author": "Ezekiel",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Ezekiel sees a vision of God’s glory: four living creatures and wheels within wheels, radiant with God’s presence.",
      "2": "God commissions Ezekiel as a prophet to a rebellious Israel, calling him to speak His words whether they listen or not.",
      "3": "Ezekiel eats the scroll, symbolizing God’s message within him. He is appointed as a watchman responsible to warn Israel.",
      "4": "Ezekiel enacts a siege against Jerusalem with symbolic actions, lying on his sides and eating rationed food.",
      "5": "Ezekiel cuts his hair to symbolize Jerusalem’s fate: some burned, some struck, some scattered, all under God’s judgment.",
      "6": "Prophecy against Israel’s mountains: idolatrous high places will be destroyed, but a remnant will survive.",
      "7": "The end has come for Israel. Disaster, doom, and God’s wrath will fall because of their sins.",
      "8": "Ezekiel sees visions of abominations in the temple: idolatry and corruption provoking God’s judgment.",
      "9": "God commands angels to mark the faithful, while others are struck down in judgment. God’s glory begins departing.",
      "10": "Ezekiel sees God’s glory departing the temple, with cherubim and wheels full of fire.",
      "11": "Leaders are condemned for wickedness. God promises judgment, but also future restoration and a new heart for His people.",
      "12": "Ezekiel enacts exile by packing belongings. God announces that exile and judgment are certain and near.",
      "13": "False prophets and prophetesses are condemned for lying visions and false security.",
      "14": "Idolatrous elders are rebuked. Even Noah, Daniel, and Job could only save themselves by righteousness.",
      "15": "Jerusalem is compared to a useless vine, destined only for fire.",
      "16": "Jerusalem is portrayed as an unfaithful wife who prostituted herself with idols. Yet God promises eventual restoration.",
      "17": "A parable of two eagles and a vine symbolizes Judah’s alliances. God promises to plant a righteous Branch.",
      "18": "Each person is responsible for their own sin. The righteous live; the wicked die. God desires repentance, not death.",
      "19": "A lament for Israel’s princes, portrayed as young lions and a withered vine.",
      "20": "God recounts Israel’s rebellion from Egypt onward. Yet He promises to restore them for His name’s sake.",
      "21": "God’s sword of judgment is unsheathed against Jerusalem and Ammon.",
      "22": "Jerusalem is condemned for bloodshed, idolatry, and corruption. Leaders, priests, and prophets are all corrupt.",
      "23": "The allegory of two sisters, Oholah and Oholibah, represents Israel and Judah’s unfaithfulness with foreign nations.",
      "24": "The siege of Jerusalem begins. Ezekiel uses a boiling pot as a sign. His wife dies, and he cannot mourn, symbolizing the people’s shock.",
      "25": "Judgment is proclaimed on Ammon, Moab, Edom, and Philistia for their hostility toward Israel.",
      "26": "Prophecy against Tyre: it will be destroyed by many nations and become bare rock.",
      "27": "A lament over Tyre’s wealth and trade, now destined for ruin.",
      "28": "Judgment against the pride of Tyre’s ruler. A prophecy of lamentation against Sidon. God promises restoration for Israel.",
      "29": "Judgment against Egypt: it will be desolate for forty years, then restored but never great again.",
      "30": "The day of the Lord against Egypt and her allies: devastation and ruin are decreed.",
      "31": "Assyria is likened to a great cedar, felled because of pride. Egypt will share its fate.",
      "32": "A lament for Pharaoh, likening him to a fallen monster. Egypt will descend to the grave with other nations.",
      "33": "Ezekiel is appointed a watchman again. Each person is accountable. News arrives that Jerusalem has fallen.",
      "34": "God condemns Israel’s shepherds (leaders). He promises to shepherd His people Himself and to raise up a Davidic shepherd.",
      "35": "Judgment against Mount Seir (Edom) for perpetual hostility toward Israel.",
      "36": "God promises restoration for Israel’s land and people. He will give them a new heart and spirit.",
      "37": "The valley of dry bones symbolizes Israel’s restoration. Two sticks become one, symbolizing a reunited nation under David’s king.",
      "38": "Prophecy against Gog of Magog: a future invasion of Israel will be destroyed by God’s power.",
      "39": "Gog’s armies are defeated and buried. God’s glory is revealed among the nations.",
      "40": "Ezekiel sees a vision of a new temple, with detailed measurements and descriptions.",
      "41": "The temple’s interior is described in detail, with decorations and measurements.",
      "42": "Chambers for priests are described, emphasizing holiness and separation.",
      "43": "God’s glory returns to the temple. Instructions for the altar and sacrifices are given.",
      "44": "Regulations for the temple: the prince and priests have specific roles. The Levites are warned for past unfaithfulness.",
      "45": "Land is divided: a portion for the Lord, priests, Levites, and the prince. Regulations for offerings are given.",
      "46": "The prince has specific worship responsibilities. Regulations for offerings and temple use are given.",
      "47": "Ezekiel sees water flowing from the temple, bringing life to the land. Land boundaries are described.",
      "48": "The land is divided among the tribes. The city and temple are described. The city is named: “The Lord is There.”"
    }
  },
  {
    "name": "Daniel",
    "slug": "daniel",
    "testament": "Old Testament",
    "category": "Major Prophets",
    "author": "Daniel (Aramaic portions)",
    "language": "Hebrew/Aramaic",
    "chapterSummaries": {
      "1": "Daniel and his friends are taken to Babylon. They refuse the king’s food, choosing vegetables and water. God blesses them with wisdom and health.",
      "2": "Nebuchadnezzar dreams of a great statue. Daniel interprets it as successive kingdoms, ending with God’s eternal kingdom. The king honors Daniel.",
      "3": "Shadrach, Meshach, and Abednego refuse to worship the golden image. They are thrown into a fiery furnace but delivered unharmed by God.",
      "4": "Nebuchadnezzar dreams of a great tree cut down. Daniel interprets it as the king’s humbling. Nebuchadnezzar becomes insane, then restored, praising God.",
      "5": "Belshazzar’s feast desecrates sacred vessels. A hand writes on the wall: “MENE, MENE, TEKEL, PARSIN.” Daniel interprets. That night Babylon falls.",
      "6": "Daniel prays despite a decree against it. He is thrown into the lions’ den but God delivers him. Darius honors Daniel’s God.",
      "7": "Daniel dreams of four beasts representing kingdoms. The Ancient of Days judges, and the Son of Man receives an everlasting kingdom.",
      "8": "Daniel sees a vision of a ram and a goat, symbolizing Medo-Persia and Greece. The little horn arises, foreshadowing oppression.",
      "9": "Daniel prays a confession for Israel. Gabriel reveals the prophecy of seventy weeks, pointing to the Messiah and future desolation.",
      "10": "Daniel has a vision of a glorious man. He is strengthened to hear prophecies of great conflict to come.",
      "11": "A detailed prophecy of conflicts between kings of the North and South unfolds, leading to a contemptible ruler and great persecution.",
      "12": "The end times are described: Michael will arise, resurrection will occur, and the righteous will shine. Daniel is told to seal the words until the end."
    }
  },
  {
    "name": "Hosea",
    "slug": "hosea",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Hosea",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God commands Hosea to marry Gomer, symbolizing Israel’s unfaithfulness. Their children’s names signify judgment: Jezreel, Lo-Ruhamah, and Lo-Ammi.",
      "2": "God describes Israel as an unfaithful wife. Yet He promises to allure her back, betrothing her forever in righteousness and love.",
      "3": "Hosea redeems Gomer, showing God’s love for Israel despite their unfaithfulness. Israel will be restored after a period without king or sacrifice.",
      "4": "God brings charges against Israel: no faithfulness, love, or knowledge of Him. Priests and people alike are corrupt.",
      "5": "Israel and Judah are condemned for unfaithfulness. God withdraws, waiting for their repentance.",
      "6": "Israel offers shallow repentance. God desires steadfast love, not sacrifice. Their loyalty fades quickly.",
      "7": "Israel is compared to a hot oven of sin, filled with intrigue and alliances with foreign nations instead of God.",
      "8": "Israel has sown the wind and will reap the whirlwind. Idols and foreign alliances will bring destruction.",
      "9": "Israel’s joy turns to mourning. Exile is coming as punishment for their idolatry and wickedness.",
      "10": "Israel is a spreading vine but uses prosperity for idolatry. Judgment will come; they will be exiled and their king removed.",
      "11": "God recalls His love in calling Israel out of Egypt. Though they turn away, His compassion prevails, promising restoration.",
      "12": "Israel is deceitful like Jacob. God reminds them of His faithfulness, urging them to return in love and justice.",
      "13": "Israel’s idolatry brings death and destruction. God declares judgment but also promises ultimate redemption from death.",
      "14": "A call to repentance: Israel is urged to return to God. He promises healing, love, and flourishing for the repentant."
    }
  },
  {
    "name": "Joel",
    "slug": "joel",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Joel",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "A devastating locust plague strikes the land. Joel calls the people, priests, and elders to lament and fast before the Lord.",
      "2": "A greater day of the Lord is described, with invading armies like locusts. Yet God calls His people to return with repentance, promising restoration and the outpouring of His Spirit.",
      "3": "God gathers the nations for judgment in the Valley of Jehoshaphat. He defends His people, promises blessing for Zion, and declares that the Lord dwells in Jerusalem."
    }
  },
  {
    "name": "Amos",
    "slug": "amos",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Amos",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Amos proclaims God’s judgment on surrounding nations—Damascus, Gaza, Tyre, Edom, Ammon—for cruelty and violence.",
      "2": "Judgment is declared on Moab, Judah, and Israel. Israel is condemned for injustice, oppression, and idolatry.",
      "3": "God declares judgment on Israel because they alone were chosen and yet rebelled. Calamity comes by His hand.",
      "4": "Israel is warned for oppressing the poor and practicing false worship. God sent calamities, yet they did not return to Him.",
      "5": "A lament for Israel: seek the Lord and live. God hates empty rituals but desires justice to roll like waters and righteousness like a stream.",
      "6": "Woe to the complacent in Zion. Israel’s pride will lead to destruction and exile.",
      "7": "Amos sees visions of judgment: locusts, fire, and a plumb line. Amaziah the priest opposes him, but Amos stands firm.",
      "8": "A vision of a basket of ripe fruit symbolizes Israel’s end. Injustice and greed bring God’s wrath; a famine of hearing God’s word is foretold.",
      "9": "God’s judgment is inescapable, yet He promises restoration: Israel will be replanted and never again uprooted."
    }
  },
  {
    "name": "Obadiah",
    "slug": "obadiah",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Obadiah",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Obadiah prophesies judgment against Edom for pride and violence against Israel. The day of the Lord is near: nations will be judged, but deliverance and holiness will come to Zion."
    }
  },
  {
    "name": "Jonah",
    "slug": "jonah",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Jonah",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God calls Jonah to preach against Nineveh. Jonah flees by ship, but God sends a storm. Jonah is thrown overboard and swallowed by a great fish.",
      "2": "From the fish’s belly, Jonah prays a prayer of repentance and thanksgiving. God commands the fish to vomit him onto dry land.",
      "3": "Jonah preaches in Nineveh. The people, from king to commoner, repent in sackcloth and fasting. God relents from destroying the city.",
      "4": "Jonah becomes angry at God’s mercy. God teaches him through a plant that His compassion extends to all people."
    }
  },
  {
    "name": "Micah",
    "slug": "micah",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Micah",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Micah proclaims God’s judgment on Samaria and Jerusalem for idolatry and sin. Their cities will face ruin.",
      "2": "Woe to those who oppress and seize land. False prophets promise ease, but judgment is coming. Yet God promises to gather a remnant.",
      "3": "Leaders and prophets are condemned for injustice and corruption. Zion will be plowed like a field because of their sins.",
      "4": "In the last days, nations will stream to the mountain of the Lord. God will bring peace, and the exiles will be restored.",
      "5": "A ruler will come from Bethlehem to shepherd God’s people in strength. Israel will triumph over enemies through God’s deliverance.",
      "6": "God brings a case against His people, asking what He has done wrong. True worship is to act justly, love mercy, and walk humbly with God.",
      "7": "Micah laments corruption but hopes in God’s salvation. God will forgive and restore His people, showing steadfast love."
    }
  },
  {
    "name": "Nahum",
    "slug": "nahum",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Nahum",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "The Lord is a jealous and avenging God, slow to anger but mighty in power. He promises judgment on Nineveh but refuge for those who trust Him.",
      "2": "The fall of Nineveh is vividly described: the attackers advance, defenses collapse, and the city is plundered.",
      "3": "Woe to Nineveh, the city of blood. Her cruelty and idolatry bring shame and destruction. None will mourn her fall."
    }
  },
  {
    "name": "Habakkuk",
    "slug": "habakkuk",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Habakkuk",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Habakkuk questions why God allows injustice. God responds that He is raising up the Babylonians to bring judgment.",
      "2": "Habakkuk waits for God’s answer. God declares woe to the proud and unjust but promises the righteous will live by faith.",
      "3": "Habakkuk prays, recalling God’s mighty deeds. Though facing hardship, he rejoices in the Lord as his strength and salvation."
    }
  },
  {
    "name": "Zephaniah",
    "slug": "zephaniah",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Zephaniah",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Zephaniah announces the coming day of the Lord: judgment on Judah for idolatry and complacency. The whole earth will be consumed.",
      "2": "A call to seek the Lord before His anger falls. Judgment is pronounced on surrounding nations—Philistia, Moab, Ammon, Cush, and Assyria.",
      "3": "Jerusalem is condemned for rebellion and corruption, but God promises to purify the nations. A humble remnant will rejoice as God restores His people."
    }
  },
  {
    "name": "Haggai",
    "slug": "haggai",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Haggai",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Through Haggai, God rebukes the people for neglecting the temple while focusing on their own houses. The leaders and people obey and begin rebuilding.",
      "2": "God encourages the builders, promising His glory will fill the temple. He assures blessing for obedience and foretells Zerubbabel’s significance in His plan."
    }
  },
  {
    "name": "Zechariah",
    "slug": "zechariah",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Zechariah",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Zechariah calls the people to return to the Lord. He sees visions of horsemen patrolling the earth and God’s promise to restore Jerusalem.",
      "2": "A vision of a man measuring Jerusalem: God will be its protection and glory. Exiles are urged to return, for God will dwell among His people.",
      "3": "Joshua the high priest stands accused but is cleansed and clothed in righteousness. God promises His servant, the Branch.",
      "4": "Zechariah sees a golden lampstand and two olive trees, symbolizing God’s Spirit empowering Zerubbabel to rebuild the temple.",
      "5": "A flying scroll symbolizes judgment on thieves and liars. A woman in a basket represents wickedness being carried away.",
      "6": "Four chariots symbolize God’s judgment on the nations. Joshua the high priest is crowned, pointing to the coming Branch who will rule and build God’s temple.",
      "7": "God rebukes empty fasting. True worship is justice, mercy, and compassion.",
      "8": "God promises to bless Jerusalem with peace, prosperity, and truth. Many nations will come to seek the Lord.",
      "9": "Judgment is proclaimed on Israel’s enemies. A humble king, riding on a donkey, is promised to bring peace to the nations.",
      "10": "God promises to strengthen and restore His people, gathering them from exile and blessing them abundantly.",
      "11": "Zechariah acts as a shepherd, symbolizing Israel’s rejection of God’s true shepherd. Thirty pieces of silver foreshadow betrayal of the Messiah.",
      "12": "God promises to defend Jerusalem. He will pour out a spirit of grace and supplication, and the people will mourn for the one they pierced.",
      "13": "A fountain is opened to cleanse from sin. Idols and false prophets are removed. The Shepherd is struck, and the sheep are scattered.",
      "14": "The day of the Lord: nations gather against Jerusalem, but the Lord comes to reign as King over all the earth. Jerusalem will be secure, and all nations will worship the Lord."
    }
  },
  {
    "name": "Malachi",
    "slug": "malachi",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Malachi",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God declares His love for Israel but rebukes the priests for offering defiled sacrifices. His name will be great among the nations.",
      "2": "The priests are warned for corrupt teaching. God condemns unfaithfulness in marriage and calls for covenant faithfulness.",
      "3": "God promises to send His messenger before the Lord’s coming. He calls Israel to return to Him and rebukes them for withholding tithes. A distinction is made between the righteous and the wicked.",
      "4": "The day of the Lord is coming, burning like fire for the wicked but bringing healing for the righteous. Elijah will come before the great and dreadful day of the Lord."
    }
  },
  {
    "name": "Matthew",
    "slug": "matthew",
    "testament": "New Testament",
    "category": "Gospels",
    "author": "Matthew",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Jesus' genealogy proves He's the promised Messiah; virgin Mary conceives by the Holy Spirit; Joseph obeys God's angel.",
      "2": "Wise men worship infant Jesus; jealous Herod massacres Bethlehem's babies; the family flees to Egypt, fulfilling prophecy.",
      "3": "John the Baptist prepares the way for Messiah; Jesus is baptized, receiving the Spirit and the Father's approval.",
      "4": "Satan tempts Jesus in the wilderness for 40 days; Jesus resists with Scripture and begins His Galilean ministry.",
      "5": "Jesus teaches the Beatitudes and kingdom principles; believers are salt and light; righteousness exceeds that of Pharisees.",
      "6": "Jesus teaches about authentic worship: giving, prayer, and fasting are for God's glory, not human recognition.",
      "7": "Don't judge others harshly; ask God persistently; the narrow gate leads to life; false prophets bear bad fruit.",
      "8": "Jesus demonstrates His authority by healing leprosy, paralysis, fever, and storms; the cost of discipleship is high.",
      "9": "Jesus heals a paralytic, calls Matthew, raises the dead, heals bleeding and blindness; workers are few but harvest is plentiful.",
      "10": "Jesus commissions the twelve apostles to preach to Israel; persecution will come, but God will vindicate the faithful.",
      "11": "John the Baptist questions Jesus from prison; Jesus pronounces woes on unrepentant cities but invites the weary to find rest in His gentle yoke.",
      "12": "Pharisees attack Jesus for Sabbath healing and grain-picking; they accuse Him of casting out demons by Beelzebul, but Jesus warns against blasphemy of the Spirit.",
      "13": "Jesus teaches kingdom parables: sower, weeds, mustard seed, hidden treasure, pearl, and net; only some understand these mysteries of heaven.",
      "14": "Herod beheads John the Baptist; Jesus feeds 5,000 with five loaves and two fish, then walks on water, calming the disciples' fears.",
      "15": "Jesus confronts Pharisees about their traditions that nullify God's commands; He heals the Canaanite woman's daughter and feeds 4,000 in the wilderness.",
      "16": "Pharisees seek a sign but receive only Jonah's; Peter confesses Jesus as the Messiah, receives keys to the kingdom, but rebukes Jesus' death prediction.",
      "17": "Jesus is transfigured before Peter, James, and John; Moses and Elijah appear; Jesus heals an epileptic boy and teaches about faith and His coming death.",
      "18": "Jesus teaches about greatness through childlike humility, church discipline for sin, and unlimited forgiveness illustrated by the unforgiving servant parable.",
      "19": "Jesus teaches about divorce, blesses children, and encounters the rich young ruler who cannot abandon his wealth for eternal life and perfect discipleship.",
      "20": "The parable of vineyard workers reveals God's gracious generosity; Jesus predicts His death a third time and teaches that greatness comes through servant leadership.",
      "21": "Jesus enters Jerusalem triumphantly, cleanses the temple of money-changers, curses the fruitless fig tree, and faces challenges to His divine authority.",
      "22": "Jesus tells the wedding feast parable, answers questions about taxes to Caesar, resurrection with seven brothers, and identifies love as the greatest commandment.",
      "23": "Jesus pronounces seven woes against the scribes and Pharisees for their hypocrisy, calling them whitewashed tombs, and laments over Jerusalem's rejection.",
      "24": "Jesus predicts the temple's destruction and describes signs of His second coming, urging watchfulness since no one knows the day or hour.",
      "25": "Three parables about readiness: ten virgins, talents, and sheep and goats; Jesus separates the righteous from the wicked in final judgment.",
      "26": "Jesus is anointed at Bethany, celebrates the Last Supper establishing the New Covenant, agonizes in Gethsemane, and is betrayed by Judas and arrested.",
      "27": "Judas hangs himself; Jesus faces trials before Pilate and is crucified between two thieves, dying as darkness covers the land and the temple veil tears.",
      "28": "Women discover the empty tomb; an angel announces Jesus' resurrection; Jesus appears to His disciples and gives the Great Commission to make disciples of all nations."
    }
  },
  {
    "name": "Mark",
    "slug": "mark",
    "testament": "New Testament",
    "category": "Gospels",
    "author": "Mark",
    "language": "Greek",
    "chapterSummaries": {
      "1": "John baptizes Jesus; the Spirit descends; Jesus calls fishermen; teaches with authority; heals many.",
      "2": "Jesus heals paralytic; calls Levi; defends disciples' behavior on Sabbath and fasting.",
      "3": "Withered hand healed on Sabbath; twelve apostles chosen; Jesus accused of casting out demons by Beelzebul.",
      "4": "Parable of sower and others; Jesus calms the storm, showing power over nature.",
      "5": "Legion of demons cast into swine; Jairus' daughter raised; woman with bleeding healed.",
      "6": "Rejection in Nazareth; twelve sent out; John the Baptist beheaded; feeding of 5,000; Jesus walks on water.",
      "7": "Pharisees criticized for tradition over God's law; Syrophoenician woman's faith; deaf man healed.",
      "8": "Feeding 4,000; Pharisees seek sign; Peter confesses Jesus as Christ; cross predicted.",
      "9": "Transfiguration reveals Jesus' glory; boy with demon healed; greatness through service.",
      "10": "Divorce teaching; children blessed; rich young ruler; James and John's request; blind Bartimaeus healed.",
      "11": "Triumphal entry; temple cleansed; fig tree cursed; authority questioned.",
      "12": "Parable of vineyard tenants; taxes to Caesar; resurrection question; greatest commandment; widow's offering.",
      "13": "Temple's destruction predicted; signs of the end; perseverance encouraged; no one knows the hour.",
      "14": "Anointing at Bethany; Last Supper; Gethsemane agony; betrayal and arrest; Peter's denial.",
      "15": "Trial before Pilate; crucifixion between two thieves; Joseph of Arimathea buries Jesus.",
      "16": "Empty tomb; angel announces resurrection; women flee in fear; appearances to disciples; great commission."
    }
  },
  {
    "name": "Luke",
    "slug": "luke",
    "testament": "New Testament",
    "category": "Gospels",
    "author": "Luke",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Angel Gabriel announces Jesus' birth to Mary; Mary visits Elizabeth, praising God; Zechariah's song celebrates salvation for all people.",
      "2": "Jesus born in Bethlehem; angels announce good news to shepherds; Jesus presented in temple where Simeon and Anna recognize the Messiah.",
      "3": "John the Baptist calls all to repentance; Jesus baptized and affirmed by the Father; Luke traces Jesus' universal genealogy to Adam.",
      "4": "Satan tempts Jesus who responds with Scripture; Jesus begins ministry in Nazareth, proclaiming good news to the poor but facing rejection.",
      "5": "Jesus calls fishermen disciples; cleanses leper and paralytic, demonstrating power over sickness; calls tax collector Levi, dining with sinners.",
      "6": "Jesus teaches that mercy matters more than Sabbath rules; chooses twelve apostles; blesses the poor and marginalied in radical kingdom teaching.",
      "7": "Jesus heals centurion's servant and widow's son; John the Baptist questions from prison; Jesus defends ministry to outcasts and sinners.",
      "8": "Women support Jesus' ministry; parable of soils; Jesus calms storm and heals demon-possessed man, showing power over nature and evil.",
      "9": "Twelve sent to preach and heal; feeding of 5,000; Peter confesses Jesus as Messiah; transfiguration reveals Jesus' glory; journey to Jerusalem begins.",
      "10": "Seventy-two sent out with kingdom authority; Good Samaritan teaches love for neighbors; Mary chooses better portion while Martha serves anxiously.",
      "11": "Jesus teaches disciples to pray; delivers man from demon; religious leaders accuse Him of using Satan's power; warns against spiritual pride.",
      "12": "Jesus warns against hypocrisy; teaches about worry and wealth; calls disciples to readiness for His return and faithful stewardship.",
      "13": "Jesus calls all to repentance; heals bent woman on Sabbath; kingdom grows like mustard seed; narrow door requires urgent response.",
      "14": "Jesus heals on Sabbath; teaches humility at dinner; parables about discipleship's cost and the great banquet welcoming outcasts.",
      "15": "Three parables of lost things found: sheep, coin, and prodigal son, revealing God's heart for seeking and saving the lost.",
      "16": "Shrewd manager parable teaches faithful stewardship; rich man and Lazarus shows eternal consequences of ignoring the poor.",
      "17": "Jesus teaches about forgiveness, faith, and humble service; heals ten lepers but only Samaritan returns grateful; kingdom is within you.",
      "18": "Persistent widow and humble tax collector teach about prayer; Jesus welcomes children; rich ruler can't let go of wealth for eternal life.",
      "19": "Jesus saves tax collector Zacchaeus; parable of ten minas about faithful service; triumphal entry and temple cleansing in Jerusalem.",
      "20": "Religious leaders challenge Jesus' authority; parable of wicked tenants; questions about taxes, resurrection, and David's son confound opponents.",
      "21": "Widow's offering shows true generosity; Jesus predicts temple's destruction and His return; disciples must endure persecution with patient faith.",
      "22": "Judas betrays Jesus for money; Last Supper establishes new covenant; Jesus agonizes in prayer; arrested while disciples argue about greatness.",
      "23": "Jesus tried before Pilate and Herod; crucified between two criminals, showing mercy to repentant thief; buried by Joseph of Arimathea.",
      "24": "Women find empty tomb; Jesus appears on Emmaus road; shows disciples His wounds; explains Scripture; ascends after commissioning them as witnesses."
    }
  },
  {
    "name": "John",
    "slug": "john",
    "testament": "New Testament",
    "category": "Gospels",
    "author": "John",
    "language": "Greek",
    "chapterSummaries": {
      "1": "The Word became flesh; John the Baptist testifies to Jesus; first disciples called; Jesus is the Lamb of God.",
      "2": "Wedding at Cana: Jesus' first miracle; cleansing the temple shows His zeal for God's house.",
      "3": "Nicodemus learns about new birth; Jesus explains God's love and the necessity of believing in Him.",
      "4": "Samaritan woman at the well discovers living water; many Samaritans believe; official's son healed.",
      "5": "Lame man healed at pool of Bethesda on Sabbath; Jesus claims equality with the Father.",
      "6": "Feeding 5,000; walking on water; Jesus is the bread of life; many disciples turn away.",
      "7": "Jesus teaches at Feast of Tabernacles; division among people; living water promised to believers.",
      "8": "Woman caught in adultery; Jesus is the light of the world; truth sets free; Abraham rejoiced to see Jesus' day.",
      "9": "Man born blind receives sight; Pharisees investigate and expel him; Jesus reveals spiritual blindness.",
      "10": "Jesus is the good shepherd who lays down His life; sheep know His voice; unity with the Father.",
      "11": "Lazarus dies and is raised after four days; Martha confesses Jesus as Messiah; plot to kill Jesus intensifies.",
      "12": "Mary anoints Jesus' feet; triumphal entry; Jesus predicts His death and glorification; some Greeks seek Him.",
      "13": "Jesus washes disciples' feet; teaches about humble service; predicts betrayal; gives new commandment of love.",
      "14": "Jesus is the way, truth, and life; promises the Holy Spirit as Helper; peace amid trouble.",
      "15": "Jesus is the true vine; believers must remain in Him to bear fruit; world will hate His followers.",
      "16": "Holy Spirit will convict the world; sorrow will turn to joy; Jesus has overcome the world.",
      "17": "Jesus' high priestly prayer for Himself, His disciples, and all future believers; unity and glory.",
      "18": "Betrayal and arrest in garden; trials before Annas, Caiaphas, and Pilate; Peter's denials.",
      "19": "Jesus scourged and crucified; 'It is finished'; buried in Joseph's new tomb; Sabbath approaches.",
      "20": "Empty tomb; Jesus appears to Mary, then disciples; Thomas believes; these signs written for faith.",
      "21": "Miraculous catch of fish; Jesus restores Peter with threefold commissioning to feed His sheep."
    }
  },
  {
    "name": "Acts",
    "slug": "acts",
    "testament": "New Testament",
    "category": "Acts",
    "author": "Luke",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Jesus ascends to heaven after commanding the apostles to wait for the Holy Spirit and be witnesses to the ends of the earth. Matthias is chosen to replace Judas among the twelve apostles.",
      "2": "The Holy Spirit comes upon the apostles at Pentecost, enabling them to speak in different languages. Peter preaches boldly, and about 3,000 people are baptized and added to the church.",
      "3": "Peter and John heal a lame man at the temple gate, drawing a crowd to whom Peter preaches about Jesus as the promised Messiah. The healing demonstrates God's power working through the apostles.",
      "4": "Peter and John are arrested for preaching about Jesus but boldly defend their faith before the religious authorities. The early church prays for boldness and continues to grow in unity and power.",
      "5": "Ananias and Sapphira die for lying to the Holy Spirit about their offering, demonstrating God's holiness. The apostles perform many signs and wonders despite increasing persecution from religious leaders.",
      "6": "Seven deacons, including Stephen, are chosen to serve the church and care for widows. Stephen performs great wonders and faces opposition from those who cannot refute his Spirit-filled wisdom.",
      "7": "Stephen delivers a powerful speech tracing Israel's history and accusing the religious leaders of rejecting God's messengers. He becomes the first Christian martyr, stoned to death while Saul watches approvingly.",
      "8": "Persecution scatters Christians throughout Judea and Samaria, spreading the gospel beyond Jerusalem. Philip preaches in Samaria and baptizes an Ethiopian eunuch, showing the gospel reaching all nations.",
      "9": "Saul encounters the risen Christ on the road to Damascus and is dramatically converted from persecutor to preacher. Ananias baptizes Saul, who immediately begins proclaiming Jesus as the Son of God.",
      "10": "God gives Peter a vision about clean and unclean foods, preparing him to preach to Cornelius, a Gentile centurion. The Holy Spirit falls on Cornelius and his household, proving that salvation is for all people.",
      "11": "Peter defends his ministry to Gentiles before the Jerusalem church, explaining God's clear leading through visions and the Spirit's work. The church in Antioch grows and becomes the first place where believers are called Christians.",
      "12": "King Herod persecutes the church, executing James and imprisoning Peter, but an angel miraculously frees Peter from prison. Herod dies under God's judgment, while the word of God continues to spread.",
      "13": "The Holy Spirit sends Barnabas and Saul (Paul) on their first missionary journey from Antioch. They preach in Cyprus and Pisidian Antioch, where Paul delivers his first recorded sermon about Jesus as the promised Savior.",
      "14": "Paul and Barnabas continue their missionary work in Iconium, Lystra, and Derbe, facing both acceptance and persecution. They strengthen new believers and appoint elders before returning to Antioch to report on God's work among the Gentiles.",
      "15": "The Jerusalem Council meets to decide whether Gentile converts must follow Jewish law, concluding that salvation is by grace alone. This pivotal decision opens the door for the gospel to spread freely among all nations.",
      "16": "Paul begins his second missionary journey with Silas, traveling through Asia Minor and receiving the Macedonian call to Europe. In Philippi, Lydia becomes a believer and Paul and Silas are miraculously freed from prison.",
      "17": "Paul preaches in Thessalonica and Berea, then travels to Athens where he delivers his famous sermon about the unknown God. Some mock his message about resurrection, but others believe and join him.",
      "18": "Paul spends 18 months in Corinth, working with Aquila and Priscilla while establishing a strong church. Despite opposition, God encourages Paul in a vision to continue speaking boldly.",
      "19": "Paul ministers in Ephesus for over two years, performing extraordinary miracles and seeing many turn from magic and idolatry to Christ. A riot erupts when silversmiths fear losing business from decreased idol worship.",
      "20": "Paul travels through Macedonia and Greece, then delivers a farewell address to the Ephesian elders in Miletus. He warns them of coming difficulties and commends them to God's grace while heading toward Jerusalem.",
      "21": "Despite warnings from the Holy Spirit, Paul continues to Jerusalem where he is arrested in the temple after being falsely accused of bringing Gentiles into restricted areas. Roman soldiers rescue him from an angry mob.",
      "22": "Paul addresses the Jerusalem crowd in Hebrew, recounting his conversion and calling to minister to the Gentiles. The crowd listens until he mentions the Gentiles, then erupts in anger demanding his death.",
      "23": "Paul appears before the Sanhedrin and cleverly divides the council by raising the issue of resurrection. After discovering a plot to kill Paul, Roman officials secretly transfer him to Caesarea for his protection.",
      "24": "Paul defends himself before Governor Felix against accusations brought by the high priest Ananias and lawyer Tertullus. Felix keeps Paul imprisoned for two years, occasionally summoning him to hear about faith in Christ.",
      "25": "The new governor Festus hears Paul's case and suggests he return to Jerusalem for trial. Paul exercises his right as a Roman citizen and appeals to Caesar, ensuring his journey to Rome.",
      "26": "Paul presents his defense before King Agrippa, powerfully recounting his conversion and calling to preach to both Jews and Gentiles. Agrippa admits Paul could have been freed if he hadn't appealed to Caesar.",
      "27": "Paul begins his journey to Rome as a prisoner, encountering a fierce storm at sea that threatens to destroy the ship. Through Paul's faith and God's protection, all 276 people aboard safely reach the island of Malta.",
      "28": "After being shipwrecked on Malta and bitten by a viper with no harm, Paul is recognized as special by the islanders. He finally reaches Rome, where he continues preaching about the kingdom of God with boldness and freedom."
    }
  },
  {
    "name": "Romans",
    "slug": "romans",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul declares the gospel as God's power for salvation; all humanity is guilty before God and under His wrath.",
      "2": "God's judgment is impartial and based on deeds; both Jews and Gentiles are condemned; true circumcision is of the heart.",
      "3": "All have sinned and fall short of God's glory; justification comes only through faith in Jesus Christ, not works.",
      "4": "Abraham was justified by faith before circumcision; he's the father of all believers; righteousness is credited, not earned.",
      "5": "Justified believers have peace with God; Adam brought sin and death, but Christ brings grace and life to all.",
      "6": "Believers died to sin in baptism and live new lives; sin no longer masters us; we're slaves to righteousness.",
      "7": "The law reveals sin but cannot save; Paul struggles with his sinful nature; only Christ delivers from condemnation.",
      "8": "No condemnation for those in Christ; the Spirit gives life; all creation awaits redemption; nothing separates us from God's love.",
      "9": "God's sovereign election is evident in Israel's history; not all descendants of Abraham are true Israel; God has mercy on whom He chooses.",
      "10": "Israel's zeal without knowledge led to rejection of Christ; salvation is available to all who call on the Lord, both Jew and Gentile.",
      "11": "Israel's hardening is partial and temporary; Gentiles are grafted into the olive tree while natural branches await restoration through God's faithfulness.",
      "12": "Present your bodies as living sacrifices; be transformed by renewing your mind; use spiritual gifts to serve the body of Christ in love.",
      "13": "Submit to governing authorities as God's servants; love fulfills the law; live as children of light awaiting Christ's return.",
      "14": "Don't judge weaker brothers over disputable matters; live by faith and seek what builds up others rather than personal liberty.",
      "15": "Strong believers should bear the weaknesses of others; Christ unites Jews and Gentiles; Paul shares his ministry plans and requests prayer.",
      "16": "Personal greetings to faithful servants; beware of divisive false teachers; the mystery of the gospel is now revealed to all nations."
    }
  },
  {
    "name": "1 Corinthians",
    "slug": "1-corinthians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul planted, Apollos watered, but God gave growth; Christ crucified is wisdom and power, not worldly wisdom.",
      "2": "Paul's ministry demonstrated Spirit's power, not eloquent words; spiritual truths are spiritually discerned.",
      "3": "Corinthians are still carnal babies; ministers are servants; the church is God's temple and building.",
      "4": "Apostles are stewards and spectacles to the world; Paul warns against pride and appoints Timothy.",
      "5": "Sexual immorality in the church must be judged; deliver the offender to Satan for restoration.",
      "6": "Christians shouldn't sue each other; our bodies are temples; flee sexual immorality and honor God.",
      "7": "Marriage is good; singleness allows undistracted devotion; remain in your calling when converted.",
      "8": "Knowledge puffs up, love builds up; be careful not to cause weaker brothers to stumble.",
      "9": "Paul's rights as apostle; he becomes all things to all men to save some; run to win.",
      "10": "Israel's wilderness failures warn us; flee idolatry; seek others' good, not your own.",
      "11": "Head coverings reflect divine order; the Lord's Supper requires proper examination and unity.",
      "12": "One Spirit gives diverse gifts to one body; every member is important; seek the best gifts.",
      "13": "Love is the most excellent way; it's patient, kind, not envious; greatest of faith, hope, love.",
      "14": "Prophecy builds up the church more than tongues; women should ask husbands at home; all things orderly.",
      "15": "Christ's resurrection is historical fact and future hope; death is swallowed up in victory.",
      "16": "Collection for Jerusalem saints; final instructions; Maranatha (Come, Lord Jesus)."
    }
  },
  {
    "name": "2 Corinthians",
    "slug": "2-corinthians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul greets the church, praising God as the Father of compassion. He explains his suffering and God’s comfort, affirming his sincerity.",
      "2": "Paul urges forgiveness for the repentant offender. He explains his ministry and rejoices in the fragrance of Christ through believers.",
      "3": "Paul contrasts the old covenant of law with the new covenant of the Spirit, which brings righteousness and lasting glory.",
      "4": "Paul describes the gospel treasure in jars of clay, showing God’s power. Suffering produces perseverance as believers fix their eyes on the unseen.",
      "5": "Believers long for heavenly dwelling. Through Christ, God reconciles the world to Himself. Paul calls Christians ambassadors of reconciliation.",
      "6": "Paul urges the Corinthians not to receive God’s grace in vain. He defends his ministry and calls for holiness and separation from idolatry.",
      "7": "Paul rejoices in the Corinthians’ repentance after his previous letter, expressing his deep comfort and joy.",
      "8": "Paul encourages generosity, citing the Macedonians’ example and Christ’s self-giving. He commends Titus and other messengers.",
      "9": "Paul stresses cheerful giving, assuring God’s abundant provision for generous givers.",
      "10": "Paul defends his apostolic authority, emphasizing spiritual weapons and boasting only in the Lord.",
      "11": "Paul contrasts himself with false apostles, recounting his sufferings and sacrifices for the gospel.",
      "12": "Paul describes his vision of heaven and his thorn in the flesh, which keeps him humble. God’s grace is sufficient.",
      "13": "Paul exhorts self-examination, warns of discipline if needed, and closes with blessings of grace, love, and fellowship."
    }
  },
  {
    "name": "Galatians",
    "slug": "galatians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul defends his apostolic authority as divinely appointed, not from men, and expresses amazement that the Galatians are turning to a different gospel. He declares that anyone preaching a gospel contrary to what he preached should be accursed.",
      "2": "Paul recounts his confrontation with Peter over eating with Gentiles and his defense of the gospel before the Jerusalem apostles. He establishes that justification comes through faith in Christ, not by works of the law, declaring 'I have been crucified with Christ.'",
      "3": "Paul argues that the Galatians received the Spirit by faith, not law-keeping, and that Abraham was justified by faith before the law existed. The law served as a guardian until Christ came, and now all who believe are sons of God regardless of ethnicity or status.",
      "4": "Paul explains that believers were once enslaved but now are adopted as sons and heirs through Christ. He appeals personally to the Galatians and uses the allegory of Sarah and Hagar to contrast freedom in Christ with bondage under law.",
      "5": "Paul commands the Galatians to stand firm in their freedom and not submit again to slavery under the law. He contrasts the works of the flesh with the fruit of the Spirit, emphasizing that those led by the Spirit are not under law.",
      "6": "Paul instructs believers to restore fallen brothers gently, bear one another's burdens, and not grow weary in doing good. He concludes by emphasizing that what matters is not circumcision but being a new creation in Christ."
    }
  },
  {
    "name": "Ephesians",
    "slug": "ephesians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul praises God for every spiritual blessing in Christ, including election, adoption, redemption, and the inheritance believers have in Christ. He prays that the Ephesians would have wisdom to understand their calling and Christ's power that raised Him from the dead.",
      "2": "Paul describes how believers were dead in sins but made alive together with Christ by grace through faith, not works. Jews and Gentiles are now united as one body in Christ, with access to the Father through the Spirit.",
      "3": "Paul reveals the mystery that Gentiles are fellow heirs and members of the body of Christ through the gospel. He prays that Christ would dwell in their hearts and that they would know the love of Christ that surpasses knowledge.",
      "4": "Paul urges believers to walk worthy of their calling, maintaining unity in the Spirit while recognizing diverse gifts given to build up the body. He contrasts the old self with the new self, emphasizing truthfulness, controlled anger, honest work, and edifying speech.",
      "5": "Paul calls believers to imitate God as beloved children, walking in love and light rather than darkness. He addresses marriage relationships as reflecting Christ and the church, with mutual submission, husbands loving sacrificially, and wives respecting their husbands.",
      "6": "Paul instructs children to obey parents, fathers not to provoke children, and slaves/masters to serve faithfully as unto the Lord. He concludes with the call to put on God's armor for spiritual warfare against spiritual forces of evil."
    }
  },
  {
    "name": "Philippians",
    "slug": "philippians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul expresses confidence that God will complete the good work begun in the Philippians and shares his joy despite imprisonment. He explains that his circumstances have advanced the gospel and declares his desire to depart and be with Christ, though remaining would benefit them.",
      "2": "Paul urges the Philippians to have the same mind as Christ, who humbled Himself to death on a cross and was therefore exalted by God. He commends Timothy and Epaphroditus as examples of selfless service and announces their coming visits.",
      "3": "Paul warns against Judaizers and declares his own impressive credentials as worthless compared to knowing Christ. He describes pressing on toward the goal of the upward call, forgetting what lies behind, and warns against enemies of the cross who focus on earthly things.",
      "4": "Paul urges two women to agree in the Lord, calls for rejoicing always and making requests known to God with thanksgiving. He teaches contentment in all circumstances through Christ's strength and thanks the Philippians for their partnership in supporting his ministry."
    }
  },
  {
    "name": "Colossians",
    "slug": "colossians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul thanks God for the Colossians’ faith and prays for them. He exalts Christ as the image of God and head of the church, reconciling all through His blood.",
      "2": "Paul warns against false teachings, urging them to remain rooted in Christ, not in human tradition or legalism.",
      "3": "Paul calls for setting minds on things above. Believers are to put off the old self and put on love, peace, and gratitude. Instructions are given for households.",
      "4": "Paul exhorts prayer, wise conduct, and greetings from his companions. Final encouragement is given to Archippus to fulfill his ministry."
    }
  },
  {
    "name": "1 Thessalonians",
    "slug": "1-thessalonians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul thanks God for the Thessalonians’ faith, love, and hope, which became an example throughout the region.",
      "2": "Paul recalls his ministry among them, likening himself to a parent. He rejoices in their faith despite persecution.",
      "3": "Paul sends Timothy to strengthen them. Timothy’s report of their steadfastness brings Paul comfort and joy.",
      "4": "Paul urges holiness, love, and diligence. He comforts them with teaching about Christ’s return and the resurrection.",
      "5": "Paul reminds them the day of the Lord will come unexpectedly. He exhorts watchfulness, encouragement, and prayer."
    }
  },
  {
    "name": "2 Thessalonians",
    "slug": "2-thessalonians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul encourages believers facing persecution, assuring them of God’s justice and Christ’s return in glory.",
      "2": "Paul explains that the day of the Lord has not come yet. The man of lawlessness must first be revealed. Believers are urged to stand firm.",
      "3": "Paul exhorts prayer, warns against idleness, and commands discipline for those who disobey. He blesses them with peace."
    }
  },
  {
    "name": "1 Timothy",
    "slug": "1-timothy",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul charges Timothy to oppose false teachers and uphold the gospel. He shares his own testimony of grace.",
      "2": "Paul instructs prayer for all people, including rulers. Guidelines for men and women in worship are given.",
      "3": "Qualifications for overseers and deacons are outlined. Paul describes the church as the pillar of truth.",
      "4": "Paul warns against false asceticism. He encourages Timothy to set an example in speech, conduct, love, faith, and purity.",
      "5": "Paul gives instructions on caring for widows, honoring elders, and correcting sin in the community.",
      "6": "Paul warns against greed and false teaching. He exhorts Timothy to pursue righteousness and guard the faith."
    }
  },
  {
    "name": "2 Timothy",
    "slug": "2-timothy",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul encourages Timothy to be bold, remembering his sincere faith. He is not to be ashamed of the gospel or Paul’s chains.",
      "2": "Timothy is exhorted to be strong in grace, like a soldier, athlete, and farmer. Paul stresses faithful teaching and endurance.",
      "3": "Paul warns of godlessness in the last days. Scripture is declared God-breathed and sufficient for teaching and equipping.",
      "4": "Paul charges Timothy to preach the word faithfully. Paul reflects on his impending death, declaring he has fought the good fight."
    }
  },
  {
    "name": "Titus",
    "slug": "titus",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul instructs Titus to appoint qualified elders and to oppose false teachers who disrupt households.",
      "2": "Paul urges teaching sound doctrine: older and younger men and women are to live godly lives, showing the grace of God.",
      "3": "Paul reminds believers to submit to authorities, be devoted to good works, and avoid foolish controversies. He closes with final greetings."
    }
  },
  {
    "name": "Philemon",
    "slug": "philemon",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul appeals to Philemon to forgive and receive back Onesimus, his runaway slave, now a brother in Christ. Paul offers to repay any debt."
    }
  },
  {
    "name": "Hebrews",
    "slug": "hebrews",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "Unknown (trad. Paul)",
    "language": "Greek",
    "chapterSummaries": {
      "1": "God has spoken through His Son, who is superior to angels as the heir of all things, the radiance of God's glory, and the exact representation of His nature.",
      "2": "Christ became human to suffer death for everyone, being made like His brothers to become a merciful and faithful high priest who can help those who are tempted.",
      "3": "Jesus is superior to Moses as the builder is greater than the house; believers must hold fast to their confidence and not harden their hearts as Israel did in the wilderness.",
      "4": "A Sabbath rest remains for God's people; the Word of God is living and active, and Jesus our great high priest enables us to approach the throne of grace with confidence.",
      "5": "Christ learned obedience through suffering and became the source of eternal salvation for all who obey Him, appointed as high priest according to the order of Melchizedek.",
      "6": "Mature believers must move beyond elementary teachings; though apostasy brings severe consequences, God's faithful promises and oath provide hope as an anchor for the soul.",
      "7": "Melchizedek's eternal priesthood prefigures Christ's superior priesthood, which replaces the Levitical system and guarantees a better covenant through His permanent intercession.",
      "8": "Christ serves as high priest of a better covenant with better promises, making the first covenant obsolete as God writes His law on believers' hearts and minds.",
      "9": "Christ entered the heavenly sanctuary with His own blood, obtaining eternal redemption through His once-for-all sacrifice that cleanses the conscience from dead works to serve the living God.",
      "10": "Christ's single offering has perfected forever those who are being sanctified; believers must draw near with confidence, hold fast their confession, and encourage one another as the Day approaches.",
      "11": "Faith is the assurance of things hoped for and conviction of things not seen, demonstrated by heroes from Abel to Moses who gained approval through faith despite not receiving the promises.",
      "12": "Believers must run with endurance the race set before them, fixing their eyes on Jesus who endured the cross; God's discipline proves His love and produces righteous character in His children.",
      "13": "Practical instructions for Christian living include hospitality, marriage purity, contentment, obedience to leaders, and offering continual sacrifice of praise through Jesus, our unchanging Lord."
    }
  },
  {
    "name": "James",
    "slug": "james",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "James",
    "language": "Greek",
    "chapterSummaries": {
      "1": "James addresses trials as opportunities for joy and perseverance, leading to maturity, and emphasizes asking God for wisdom in faith without doubting. He contrasts the rich and poor, warns against being deceived about good gifts from God, and calls for being doers of the word, not just hearers.",
      "2": "James condemns showing partiality to the rich while dishonoring the poor and argues that faith without works is dead. He uses Abraham's willingness to sacrifice Isaac and Rahab's assistance to the spies as examples of faith demonstrated through actions.",
      "3": "James warns that not many should become teachers due to greater judgment and focuses on controlling the tongue, which though small, can cause great damage like a fire. He contrasts earthly wisdom (bitter jealousy and selfish ambition) with heavenly wisdom (pure, peaceable, gentle, reasonable).",
      "4": "James addresses conflicts arising from pleasures and desires, calling believers to submit to God and resist the devil. He warns against speaking against one another, boasting about tomorrow's plans without acknowledging God's will, and condemning the rich who withhold wages from laborers.",
      "5": "James begins by condemning rich oppressors and calling them to weep over coming judgment for hoarding wealth and oppressing workers. He then encourages believers to be patient in suffering until the Lord's coming, avoid swearing oaths, pray for the sick with faith, and restore wandering brothers from error."
    }
  },
  {
    "name": "1 Peter",
    "slug": "1-peter",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "Peter",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Peter blesses God for the living hope believers have through Christ's resurrection and an imperishable inheritance, encouraging joy despite present trials that test faith. He calls believers to be holy as God is holy and to love one another fervently from the heart, having been born again through God's word.",
      "2": "Peter describes believers as living stones being built into a spiritual house and a chosen people, called out of darkness into light. He instructs believers to abstain from fleshly lusts as aliens and strangers, submitting to human authorities and serving as free people who honor God.",
      "3": "Peter addresses wives to win unbelieving husbands through godly conduct and husbands to honor their wives as fellow heirs of grace. He calls all believers to unity, love, humility, and blessing others rather than returning evil for evil, prepared to give a defense for their hope with gentleness.",
      "4": "Peter encourages believers to arm themselves with Christ's mindset of suffering for righteousness rather than living for human lusts. He emphasizes using spiritual gifts to serve one another, rejoicing in sharing Christ's sufferings, and entrusting their souls to the faithful Creator while doing good.",
      "5": "Peter exhorts elders to shepherd God's flock willingly and by example, not for gain, while younger believers should submit and all should be clothed with humility. He encourages casting anxiety on God, being sober and watchful against the devil, and standing firm in faith despite suffering."
    }
  },
  {
    "name": "2 Peter",
    "slug": "2-peter",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "Peter",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Peter urges growth in faith, virtue, and knowledge. He reminds them of eyewitness testimony of Christ’s glory and the surety of Scripture.",
      "2": "False teachers are condemned for greed and immorality. Peter recalls examples of judgment: fallen angels, the flood, and Sodom.",
      "3": "Scoffers doubt Christ’s return, but Peter assures God’s timing is patient. The day of the Lord will come, bringing new heavens and a new earth."
    }
  },
  {
    "name": "1 John",
    "slug": "1-john",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "John",
    "language": "Greek",
    "chapterSummaries": {
      "1": "John proclaims the Word of life. Believers must walk in the light, confessing sins, for forgiveness through Christ.",
      "2": "Jesus is our advocate and atoning sacrifice. Believers must obey God’s commands and love one another. Antichrists deny Christ.",
      "3": "We are children of God and must live righteously. Love is shown in action, not words alone.",
      "4": "Test the spirits; true confession is that Jesus came in the flesh. God is love, and we must love one another.",
      "5": "Faith in Christ overcomes the world. The Spirit, water, and blood testify. Believers have eternal life and confidence in prayer."
    }
  },
  {
    "name": "2 John",
    "slug": "2-john",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "John",
    "language": "Greek",
    "chapterSummaries": {
      "1": "John urges believers to walk in truth and love. He warns against deceivers who deny Christ and instructs not to welcome them."
    }
  },
  {
    "name": "3 John",
    "slug": "3-john",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "John",
    "language": "Greek",
    "chapterSummaries": {
      "1": "John commends Gaius for hospitality and walking in the truth. He rebukes Diotrephes for arrogance and praises Demetrius for faithfulness."
    }
  },
  {
    "name": "Jude",
    "slug": "jude",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "Jude",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Jude urges believers to contend for the faith against ungodly infiltrators. He recalls past judgments and warns of false teachers. He closes with a doxology to God who keeps believers safe."
    }
  },
  {
    "name": "Revelation",
    "slug": "revelation",
    "testament": "New Testament",
    "category": "Apocalypse",
    "author": "John",
    "language": "Greek",
    "chapterSummaries": {
      "1": "John receives a vision of the glorified Christ walking among seven golden lampstands, His appearance radiating divine majesty and authority as the Living One who holds the keys of death and Hades.",
      "2": "Christ addresses four of the seven churches—Ephesus, Smyrna, Pergamum, and Thyatira—with specific commendations, rebukes, and promises for those who overcome and remain faithful.",
      "3": "Christ completes His messages to the seven churches—Sardis, Philadelphia, and Laodicea—calling them to repentance, faithfulness, and spiritual fervor while promising eternal rewards to overcomers.",
      "4": "John is taken up to heaven and sees God's throne surrounded by twenty-four elders and four living creatures who continually worship the Holy One who created all things for His pleasure.",
      "5": "A sealed scroll appears in God's right hand, and only the Lamb who was slain is worthy to open it, receiving worship from all creation as the One who redeemed people from every tribe and nation.",
      "6": "The Lamb opens the first six seals, unleashing conquest, war, famine, death, martyrs crying for justice, and cosmic upheaval as God's judgment begins upon the earth.",
      "7": "Before the seventh seal, 144,000 servants of God are sealed from the twelve tribes of Israel, and John sees a great multitude from every nation worshiping before the throne having come out of great tribulation.",
      "8": "The seventh seal brings silence in heaven, then seven angels with trumpets begin God's judgments on earth through hail, fire, a burning mountain, a fallen star, and darkness covering a third of creation.",
      "9": "The fifth and sixth trumpets release demonic locusts from the abyss to torment unrepentant humanity, followed by a massive army of 200 million horsemen killing a third of mankind, yet people still refuse to repent.",
      "10": "A mighty angel holding a little scroll declares that in the days of the seventh trumpet, God's mystery will be completed, and John is commanded to eat the scroll which is sweet in his mouth but bitter in his stomach.",
      "11": "John measures the temple while two witnesses prophesy for 1,260 days with great power until they are killed and resurrected; the seventh trumpet sounds, announcing Christ's eternal kingdom and God's wrath.",
      "12": "A woman clothed with the sun gives birth to a male child who will rule the nations, while a great red dragon seeks to devour the child; war breaks out in heaven, and Satan is cast down to earth with great fury.",
      "13": "Two beasts emerge—one from the sea with authority over all nations, and one from the earth performing signs to deceive people into worshiping the first beast and receiving its mark, 666.",
      "14": "The Lamb stands with 144,000 on Mount Zion singing a new song; three angels proclaim the eternal gospel, announce Babylon's fall, and warn against receiving the beast's mark before the harvest of the earth.",
      "15": "Seven angels prepare to pour out the seven last plagues containing God's completed wrath, while those who conquered the beast sing the song of Moses and the Lamb beside a sea of glass mixed with fire.",
      "16": "The seven bowls of God's wrath are poured out, bringing painful sores, death in the seas and rivers, scorching heat, darkness on the beast's kingdom, and the great earthquake at Armageddon.",
      "17": "John sees the judgment of the great prostitute Babylon who sits on many waters, drunk with the blood of saints, riding a scarlet beast with seven heads representing kings and kingdoms.",
      "18": "Babylon the great falls suddenly and completely, bringing mourning to kings, merchants, and sailors who profited from her luxury, while heaven rejoices over God's righteous judgment of her corruption.",
      "19": "Heaven celebrates with hallelujah choruses for God's judgment and the marriage supper of the Lamb; Christ returns as King of Kings and Lord of Lords to defeat the beast and false prophet at Armageddon.",
      "20": "Satan is bound for 1,000 years while martyrs reign with Christ; after his release and final rebellion, Satan is cast into the lake of fire, and all the dead face the great white throne judgment.",
      "21": "God creates new heavens and a new earth with the New Jerusalem descending as a bride; He dwells with His people, wiping away all tears, pain, and death in the eternal city of perfect glory.",
      "22": "The angel shows John the river of life and tree of life in the New Jerusalem; Jesus declares His soon coming and invites all who thirst to take the water of life freely as the Spirit and bride say 'Come.'"
    }
  }
]
