[
  {
    "name": "Genesis",
    "slug": "genesis",
    "testament": "Old Testament",
    "category": "Law (Torah)",
    "author": "Moses",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God creates the heavens, earth, and all life in six days, culminating with humanity made in His image to rule creation.",
      "2": "God forms Adam, plants Eden, creates Eve as his partner, and establishes the first marriage in perfect harmony.",
      "3": "The serpent tempts Eve and Adam; they disobey God, bringing sin, death, and separation, yet God promises redemption.",
      "4": "Cain murders Abel out of jealousy; sin spreads as Cain builds the first city and his descendants develop civilization.",
      "5": "Adam's genealogy spans 1,656 years to Noah; Enoch walks with God and is taken; Methuselah lives 969 years.",
      "6": "Humanity's wickedness grieves God; He chooses Noah to build an ark and preserve life through the coming flood.",
      "7": "Noah, his family, and animals enter the ark; God shuts them in as rain falls for 40 days, flooding the earth.",
      "8": "The flood waters recede; Noah sends out birds to test the land, then exits the ark and offers sacrifice to God.",
      "9": "God establishes a covenant with Noah, permits eating meat, institutes human government, and promises never to flood the earth again.",
      "10": "The table of nations: descendants of Noah's sons spread across the earth, establishing 70 distinct people groups.",
      "11": "Humanity rebels by building Babel; God confuses their language and scatters them, then calls Abraham to start over."
    }
  },
  {
    "name": "Exodus",
    "slug": "exodus",
    "testament": "Old Testament",
    "category": "Law (Torah)",
    "author": "Moses",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Jacob's descendants multiply in Egypt; new Pharaoh oppresses Israel with slavery and attempts genocide.",
      "2": "Moses is born, raised in Pharaoh's house, flees to Midian after killing an Egyptian; God hears Israel's cries.",
      "3": "God calls Moses from the burning bush, reveals His name YAHWEH, and commissions him to deliver Israel.",
      "4": "God gives Moses miraculous signs; Aaron becomes his spokesman; Moses returns to Egypt with God's message.",
      "5": "Moses and Aaron confront Pharaoh; he refuses and increases Israel's burdens; the people blame Moses.",
      "6": "God reassures Moses of His covenant promises and power; genealogy of Moses and Aaron's lineage.",
      "7": "Aaron's staff becomes a serpent; the first plague turns water to blood throughout Egypt.",
      "8": "Plagues of frogs, gnats, and flies demonstrate God's power; Pharaoh repeatedly hardens his heart.",
      "9": "Plagues on livestock, boils, and devastating hail with fire show God's sovereignty over Egypt.",
      "10": "Locusts devour Egypt and thick darkness covers the land; Pharaoh's final refusal before the ultimate plague.",
      "11": "God announces the death of every firstborn; Egyptians will give Israel silver and gold as they leave.",
      "12": "The Passover instituted; death of Egypt's firstborn; Israel's exodus begins after 430 years in Egypt.",
      "13": "Consecration of firstborn; God leads Israel by pillar of cloud and fire toward the wilderness.",
      "14": "Pharaoh pursues Israel to the Red Sea; God parts the waters and destroys Egypt's army.",
      "15": "Moses and Miriam lead victory songs; bitter water at Marah made sweet; God promises healing.",
      "16": "Israel complains about food; God provides manna and quail; Sabbath principle introduced with gathering rules.",
      "17": "Water from the rock at Massah; Amalekites attack Israel; Moses' raised hands ensure Joshua's victory.",
      "18": "Jethro visits Moses, worships God, and advises him to delegate judicial responsibilities to capable leaders.",
      "19": "Israel arrives at Sinai; God proposes covenant relationship; the people prepare to meet their holy God.",
      "20": "The Ten Commandments given; Israel fears God's presence and asks Moses to be their mediator.",
      "21": "Laws about Hebrew servants, violence, and property damage establish justice and social order.",
      "22": "Laws concerning theft, property damage, moral conduct, and social justice reflect God's character.",
      "23": "Justice in legal proceedings; festivals and Sabbaths; promises for conquest of the Promised Land.",
      "24": "Moses reads the covenant; people agree; Moses, Aaron, and elders see God; Moses ascends for forty days.",
      "25": "Instructions for the ark, table, and lampstand; God desires to dwell among His people.",
      "26": "Detailed plans for the tabernacle structure: curtains, frames, and the veil separating holy places.",
      "27": "The bronze altar for sacrifices and the courtyard design; God's dwelling place takes shape.",
      "28": "Aaron and sons consecrated as priests; detailed instructions for sacred garments reflecting God's glory.",
      "29": "Ordination ceremony for priests; daily sacrifices; God promises to dwell among Israel.",
      "30": "Altar of incense, census tax, bronze basin, anointing oil, and incense recipes for worship.",
      "31": "Bezalel and Oholiab chosen as craftsmen; Sabbath as covenant sign; Moses receives stone tablets.",
      "32": "Israel worships golden calf while Moses is on mountain; Moses intercedes; 3,000 die for idolatry.",
      "33": "God threatens to withdraw His presence; Moses pleads; God reveals His glory and character.",
      "34": "New tablets; God proclaims His name and attributes; covenant renewed; Moses' face shines with glory.",
      "35": "Sabbath emphasized; people give generously for tabernacle construction; hearts willing and stirred.",
      "36": "Skilled workers begin construction; people give so much they must be restrained from bringing more.",
      "37": "Bezalel crafts the ark, table, and lampstand according to God's detailed specifications.",
      "38": "Bronze altar, basin, and courtyard completed; inventory of materials shows faithful stewardship.",
      "39": "Priestly garments made exactly as commanded; all work inspected and blessed by Moses.",
      "40": "Tabernacle erected on first day of second year; God's glory fills His dwelling place among Israel."
    }
  },
  {
    "name": "Leviticus",
    "slug": "leviticus",
    "testament": "Old Testament",
    "category": "Law (Torah)",
    "author": "Moses",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God instructs Moses on the burnt offering, detailing how the Israelites should present cattle, sheep, goats, or birds as voluntary offerings to atone for sin and express devotion to the Lord.",
      "2": "The grain offering is established as a way to present flour, oil, and frankincense to God, with portions burned on the altar and the remainder given to the priests as their provision.",
      "3": "The peace offering is described as a voluntary sacrifice of cattle, sheep, or goats to express gratitude and fellowship with God, with specific portions burned and others shared between priests and worshipers.",
      "4": "Sin offerings are prescribed for unintentional sins, with different requirements for the high priest, the congregation, leaders, and common people, emphasizing the seriousness of sin and need for atonement.",
      "5": "Additional sin offerings and guilt offerings are detailed for specific situations including false testimony, touching unclean things, and rash oaths, along with provisions for those who cannot afford standard offerings.",
      "6": "God provides instructions to the priests about maintaining the altar fire and handling the burnt offering, grain offering, and sin offering, emphasizing the sacred nature of their duties.",
      "7": "Detailed regulations for the guilt offering and peace offering are given, including what portions belong to the priests and prohibitions against eating fat and blood.",
      "8": "Moses consecrates Aaron and his sons as priests through washing, clothing them in sacred garments, anointing with oil, and offering sacrifices, establishing the priesthood for Israel.",
      "9": "Aaron begins his priestly ministry by offering sacrifices for himself and the people, culminating in God's fire consuming the offerings and His glory appearing to all Israel.",
      "10": "Nadab and Abihu, Aaron's sons, are killed by God's fire for offering unauthorized incense, teaching the importance of approaching God according to His prescribed ways and maintaining priestly holiness.",
      "11": "God establishes dietary laws distinguishing between clean and unclean animals, emphasizing Israel's call to holiness and separation from other nations through their eating practices.",
      "12": "Laws concerning purification after childbirth are given, requiring different periods of ceremonial uncleanness and specific offerings for male and female children.",
      "13": "Detailed instructions for diagnosing and managing skin diseases and mildew are provided, with priests serving as health inspectors to determine ceremonial cleanness or uncleanness.",
      "14": "The cleansing ritual for those healed of skin diseases is prescribed, involving birds, cedar wood, scarlet yarn, hyssop, and various offerings to restore them to community fellowship.",
      "15": "Laws regarding bodily discharges are established, detailing purification requirements for both men and women to maintain ceremonial cleanness in the camp.",
      "16": "The Day of Atonement is instituted as an annual ceremony where the high priest enters the Most Holy Place to make atonement for himself, the priesthood, and all Israel's sins.",
      "17": "Regulations about sacrifices and eating meat are given, requiring all sacrifices to be brought to the tabernacle and prohibiting the consumption of blood, which contains life and makes atonement.",
      "18": "God prohibits various sexual practices including incest, adultery, homosexuality, and bestiality, calling Israel to moral purity distinct from Egyptian and Canaanite customs.",
      "19": "The holiness code begins with calls to reverence parents, keep the Sabbath, avoid idolatry, and love one's neighbor as oneself, establishing foundational principles for holy living.",
      "20": "Penalties for serious sins are prescribed, including death for child sacrifice, adultery, homosexuality, and consulting mediums, emphasizing God's call for Israel to be holy and separate.",
      "21": "Special holiness requirements for priests are established, including restrictions on mourning practices, marriage, and physical defects, reflecting their sacred role as mediators between God and people.",
      "22": "Additional priestly regulations ensure ceremonial purity when handling sacred offerings and establish standards for acceptable sacrificial animals, maintaining the integrity of worship.",
      "23": "God establishes Israel's sacred calendar with detailed instructions for observing the Sabbath, Passover, Feast of Weeks, Feast of Trumpets, Day of Atonement, and Feast of Tabernacles.",
      "24": "Instructions for maintaining the lampstand and bread of the Presence are given, followed by the punishment of a blasphemer and the establishment of the principle of proportional justice.",
      "25": "The sabbatical year and Year of Jubilee are instituted to provide rest for the land, release for Hebrew slaves, and redemption of property, emphasizing God's ownership of all things.",
      "26": "God promises blessings for obedience including rain, abundant harvests, peace, and His presence, while warning of escalating curses for disobedience including exile from the land.",
      "27": "Laws concerning vows and dedicated offerings are established, including the redemption values for people, animals, houses, and fields dedicated to the Lord, concluding Leviticus with principles of sacred commitment."
    }
  },
  {
    "name": "Numbers",
    "slug": "numbers",
    "testament": "Old Testament",
    "category": "Law (Torah)",
    "author": "Moses",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Moses conducts the first census of Israel's fighting men (excluding Levites), numbering over 600,000 males aged twenty and above from the twelve tribes, as commanded by God at Mount Sinai.",
      "2": "God establishes the arrangement of the twelve tribes around the tabernacle during their wilderness encampments, with specific positioning and marching order under their respective banners.",
      "3": "The Levites are set apart for tabernacle service in place of Israel's firstborn, with Aaron's sons appointed as priests and the Levitical clans assigned specific duties for the sacred tent.",
      "4": "Detailed instructions are given for the Kohathites, Gershonites, and Merarites regarding their specific responsibilities in transporting and caring for the tabernacle and its holy objects.",
      "5": "Laws are established for maintaining camp purity through quarantine of the unclean, restitution for wrongs, and the ritual test for suspected adultery (the bitter water ordeal).",
      "6": "God provides regulations for the Nazirite vow of separation and gives Aaron the priestly blessing formula to pronounce over the Israelites.",
      "7": "The twelve tribal leaders present identical offerings for the dedication of the altar over twelve days, demonstrating unity and God's acceptance of their worship.",
      "8": "Aaron lights the seven lamps of the lampstand, and the Levites are ceremonially purified and set apart for their service in the tabernacle on behalf of all Israel.",
      "9": "Israel celebrates the first Passover in the wilderness, with provisions made for those ceremonially unclean, while the cloud of God's presence guides their movements.",
      "10": "Silver trumpets are made for assemblies and signaling marches, and Israel begins their journey from Sinai toward the Promised Land in organized formation.",
      "11": "The people complain about hardships and demand meat instead of manna, leading to God's anger, the provision of quail, and a plague as judgment for their ingratitude.",
      "12": "Miriam and Aaron challenge Moses' authority and unique relationship with God, resulting in Miriam being struck with leprosy until Moses intercedes for her healing.",
      "13": "Twelve spies are sent to scout the Promised Land and return with evidence of its abundance, but ten give a fearful report while only Joshua and Caleb encourage faith in God's promises.",
      "14": "Israel rebels against entering the Promised Land due to fear, prompting God's judgment that the entire generation (except Joshua and Caleb) will die in the wilderness over forty years.",
      "15": "God provides laws for offerings in the future land, establishes procedures for unintentional sins, and executes a man for deliberate Sabbath violation, while instituting tassels as reminders of God's commands.",
      "16": "Korah, Dathan, and Abiram lead a rebellion against Moses and Aaron's authority, resulting in the earth swallowing the rebels and fire consuming 250 incense offerers.",
      "17": "To confirm Aaron's unique priestly calling, God causes Aaron's staff to miraculously bud, blossom, and produce almonds among the twelve tribal staffs.",
      "18": "God establishes the permanent responsibilities and provisions for the priests and Levites, including their duties, portions of offerings, and the tithe system for their sustenance.",
      "19": "The ritual of the red heifer is instituted to provide ceremonial purification from defilement caused by contact with the dead, essential for maintaining covenant relationship with God.",
      "20": "Miriam dies, the people complain about lack of water, and Moses and Aaron sin by striking the rock instead of speaking to it, resulting in their exclusion from the Promised Land.",
      "21": "Israel defeats the Canaanites at Hormah, complains about the journey leading to fiery serpents as judgment, finds healing through the bronze serpent, and conquers the Amorite kings Sihon and Og.",
      "22": "Balak, king of Moab, hires the prophet Balaam to curse Israel, but God intervenes through a speaking donkey and commands Balaam to bless Israel instead.",
      "23": "Despite Balak's repeated attempts and offerings, Balaam pronounces blessings on Israel instead of curses, declaring God's faithfulness to His covenant people.",
      "24": "Balaam delivers his final oracles blessing Israel and prophesying their future dominance, including the messianic prophecy of the star and scepter from Jacob.",
      "25": "Israel falls into idolatry and immorality with Moabite women at Baal-Peor, leading to a plague that is stopped only when Phinehas executes an Israelite man and Midianite woman in zealous obedience.",
      "26": "A second census is conducted after the plague, showing God's faithfulness in maintaining Israel's numbers despite judgment, and establishing inheritance rights for the new generation entering Canaan.",
      "27": "The daughters of Zelophehad successfully petition for inheritance rights when there are no male heirs, and Moses is shown the Promised Land before God appoints Joshua as his successor.",
      "28": "God establishes the regular schedule of daily, weekly, and monthly offerings that Israel must maintain to worship Him properly in the land.",
      "29": "Detailed instructions are given for the special offerings required during the seventh month festivals: the Feast of Trumpets, Day of Atonement, and Feast of Tabernacles.",
      "30": "Laws regarding vows are established, particularly addressing the authority of fathers and husbands to confirm or nullify vows made by daughters and wives under their care.",
      "31": "God commands Israel to take vengeance on the Midianites for leading them into sin at Baal-Peor, resulting in complete victory and the distribution of spoils according to divine law.",
      "32": "The tribes of Reuben, Gad, and half of Manasseh request to settle east of the Jordan River, which Moses grants on condition they help conquer the Promised Land first.",
      "33": "Moses records the complete itinerary of Israel's forty-year wilderness journey from Egypt to the plains of Moab, demonstrating God's faithful guidance throughout their wanderings.",
      "34": "God defines the precise boundaries of the Promised Land that Israel will inherit and appoints leaders from each tribe to oversee the distribution of the territory.",
      "35": "The Levites are assigned forty-eight cities throughout Israel including six cities of refuge where those guilty of accidental manslaughter can find protection from vengeful relatives.",
      "36": "The final law addresses marriage restrictions for female heirs to ensure that tribal inheritances remain within their designated tribes, concluding the wilderness legislation at the plains of Moab."
    }
  },
  {
    "name": "Deuteronomy",
    "slug": "deuteronomy",
    "testament": "Old Testament",
    "category": "Law (Torah)",
    "author": "Moses",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Moses begins his farewell address by recounting Israel's journey from Mount Horeb, including the appointment of judges and the command to enter the Promised Land that their fathers' generation refused to obey.",
      "2": "Moses recounts Israel's wilderness wanderings and God's instructions to avoid conflict with the descendants of Esau and Lot while conquering the Amorite kingdoms east of the Jordan.",
      "3": "Moses describes the conquest of King Og of Bashan and the distribution of the Transjordan territory to Reuben, Gad, and half the tribe of Manasseh, while being reminded that he himself cannot enter the Promised Land.",
      "4": "Moses urges Israel to obey God's laws and statutes, warning against idolatry and emphasizing that their obedience will demonstrate God's wisdom to the nations and ensure their prosperity in the land.",
      "5": "Moses restates the Ten Commandments given at Mount Horeb and recalls how the people requested that Moses serve as mediator between them and God due to their fear of God's awesome presence.",
      "6": "Moses delivers the great commandment to love the Lord with all their heart, soul, and strength, instructing parents to teach God's laws diligently to their children and to remember God's faithfulness when they prosper in the land.",
      "7": "Moses commands Israel to completely destroy the Canaanite nations and their idols, reminding them that they are God's chosen people not because of their greatness but because of God's love and faithfulness to His promises.",
      "8": "Moses warns Israel to remember the Lord when they prosper in the Promised Land, recalling how God humbled them in the wilderness with manna to teach them that man lives by every word from God's mouth.",
      "9": "Moses reminds Israel that their conquest of the land is not due to their righteousness but because of the wickedness of the nations and God's faithfulness to His promises, recounting the golden calf incident as evidence of their rebellion.",
      "10": "Moses recounts the making of the second set of stone tablets, the construction of the ark, and emphasizes that God desires circumcised hearts that fear Him, serve Him, and care for the vulnerable in society.",
      "11": "Moses calls Israel to love and obey the Lord, promising blessings for obedience and curses for disobedience, and instructs them to teach God's words to their children and bind them as signs upon themselves.",
      "12": "Moses establishes laws for worship in the Promised Land, commanding the destruction of pagan worship sites and designating one central place where God will choose to put His name for sacrifices and offerings.",
      "13": "Moses warns against false prophets and idolatrous family members or cities, commanding that those who lead Israel away from the Lord must be put to death to purge evil from among them.",
      "14": "Moses reaffirms Israel's identity as God's holy people through dietary laws, distinguishing clean and unclean animals, and establishes the principle of tithing to support worship and care for the needy.",
      "15": "Moses institutes the sabbatical year for debt release and freeing Hebrew servants, commanding generous treatment of the poor and proper procedures for those who choose permanent servitude.",
      "16": "Moses establishes the three major annual festivals—Passover, Feast of Weeks, and Feast of Tabernacles—and provides instructions for appointing judges who will administer justice fairly without partiality or bribes.",
      "17": "Moses gives laws concerning proper sacrifices, procedures for dealing with idolatry, the role of priests and Levites in difficult legal cases, and regulations for future kings who must be guided by God's law.",
      "18": "Moses defines the inheritance and duties of the Levitical priests, warns against occult practices of the nations, and promises that God will raise up a prophet like Moses to speak His words to the people.",
      "19": "Moses establishes cities of refuge for accidental killers and sets procedures for witnesses in legal cases, emphasizing the principle of justice and the requirement of multiple witnesses for serious accusations.",
      "20": "Moses provides laws for warfare, including encouragement for soldiers, exemptions from military service, procedures for besieging cities, and instructions for dealing with both distant and nearby enemies.",
      "21": "Moses addresses various civil laws including procedures for unsolved murders, treatment of captive women, inheritance rights of firstborn sons, and dealing with rebellious children and executed criminals.",
      "22": "Moses establishes laws for social responsibility and moral purity, covering topics from returning lost property and helping neighbors to regulations concerning marriage, sexual conduct, and proper gender distinctions.",
      "23": "Moses defines who may enter the assembly of the Lord, establishes laws for maintaining cleanliness in military camps, and provides regulations for escaped slaves, temple prostitution, and lending practices.",
      "24": "Moses provides laws concerning divorce and remarriage, fair treatment of workers and debtors, justice for the vulnerable, and proper procedures for punishment while maintaining human dignity.",
      "25": "Moses establishes limits on corporal punishment, laws for levirate marriage to preserve family lines, honest business practices with accurate weights and measures, and the command to destroy the Amalekites.",
      "26": "Moses prescribes rituals for offering firstfruits and tithes that include reciting God's mighty acts in Israel's history, concluding with mutual covenant declarations between God and His people.",
      "27": "Moses, with the elders and priests, commands Israel to set up stones inscribed with the law on Mount Ebal and prescribes a covenant renewal ceremony with blessings and curses proclaimed from mounts Gerizim and Ebal.",
      "28": "Moses presents the covenant's blessings for obedience and extensive curses for disobedience, describing in vivid detail the prosperity that comes from following God and the devastating consequences of rebellion.",
      "29": "Moses calls Israel to renew their covenant with the Lord, warning that future generations will witness God's judgment if they forsake the covenant, while acknowledging that some things belong to God's secret counsel.",
      "30": "Moses prophesies Israel's future exile and restoration, calling them to choose life by loving and obeying the Lord, emphasizing that God's commandment is not too difficult or distant but near to their hearts.",
      "31": "Moses transfers leadership to Joshua, commands the regular public reading of the law, and receives God's prediction that Israel will rebel after his death, prompting the writing of a song as a witness against them.",
      "32": "Moses recites his song that serves as a prophetic witness, recounting God's faithfulness to unfaithful Israel and declaring that God will ultimately vindicate His people and judge their enemies.",
      "33": "Moses delivers his final blessing upon the twelve tribes of Israel, celebrating God as their eternal refuge and strength while prophesying each tribe's distinctive future and calling Israel blessed among nations.",
      "34": "Moses views the Promised Land from Mount Nebo before dying at age 120 with undiminished strength, and the narrative concludes by affirming that no prophet like Moses has since arisen in Israel."
    }
  },
  {
    "name": "Joshua",
    "slug": "joshua",
    "testament": "Old Testament",
    "category": "History",
    "author": "Joshua",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "God commands Joshua to lead Israel into the Promised Land, promising His presence and success if they courageously obey His law. Joshua prepares the people for crossing the Jordan River into Canaan.",
      "2": "Joshua sends two spies to scout Jericho, where Rahab the prostitute hides them and professes faith in Israel's God. In return for her protection, the spies promise to spare her and her family when Israel conquers the city.",
      "3": "The Israelites cross the Jordan River on dry ground as God miraculously stops the flowing water when the priests carrying the ark step into it. This miracle demonstrates God's power and establishes Joshua's leadership before all Israel.",
      "4": "Twelve stones are taken from the Jordan riverbed to create a memorial at Gilgal, serving as a lasting testimony to God's mighty work for future generations. The crossing is completed and the people camp at Gilgal, their first base in the Promised Land.",
      "5": "The Israelite men are circumcised at Gilgal, and the people celebrate Passover in the Promised Land for the first time. The manna ceases as they begin eating the produce of Canaan, and Joshua encounters the commander of the Lord's army.",
      "6": "Jericho falls after Israel marches around the city for seven days according to God's specific instructions, with the walls collapsing when they shout and blow trumpets. Rahab and her family are spared, but the city is devoted to destruction except for items going to God's treasury.",
      "7": "Israel suffers defeat at Ai because Achan secretly took devoted items from Jericho, violating God's command. After Achan and his family are executed for their sin, God's anger is turned away from Israel.",
      "8": "Israel successfully conquers Ai using a divinely-given battle strategy involving an ambush, demonstrating that victory comes through obedience to God. Joshua builds an altar on Mount Ebal and publicly reads the entire law to all Israel.",
      "9": "The Gibeonites deceive Israel into making a peace treaty by pretending to be from a distant land, violating God's command to destroy all Canaanites. Though bound by their oath, Israel makes the Gibeonites servants, showing the consequences of not seeking God's counsel.",
      "10": "Joshua leads Israel to victory over a coalition of five Amorite kings who attacked Gibeon, with God fighting for Israel by sending hailstones and making the sun stand still. The southern region of Canaan is conquered as God delivers enemy after enemy into Israel's hands.",
      "11": "Joshua defeats a northern coalition led by Jabin of Hazor, completing the conquest of Canaan's major population centers. The chapter emphasizes that Joshua carried out all of Moses' commands and that the land had rest from war.",
      "12": "A comprehensive list records all the kings defeated by Moses east of the Jordan and by Joshua west of the Jordan. This chapter serves as a testimony to God's faithfulness in giving Israel victory over 31 kings and their territories.",
      "13": "Though much land remains to be possessed, God instructs Joshua to begin dividing the inheritance among the nine and a half tribes. The chapter details the territory of Reuben, Gad, and half of Manasseh who received their inheritance east of the Jordan.",
      "14": "The inheritance process begins west of the Jordan, with Caleb receiving Hebron as his personal inheritance due to his faithful service and wholehearted devotion to God. At 85 years old, Caleb demonstrates continued strength and faith in claiming his promised territory.",
      "15": "The detailed boundaries and cities of Judah's tribal inheritance are established, showing God's faithfulness in fulfilling His promises to the patriarchs. Caleb successfully drives out the Anakim from his inheritance, while the Jebusites remain in Jerusalem.",
      "16": "The inheritance boundaries for the tribe of Ephraim are described, though they fail to completely drive out the Canaanites from their territory. This partial obedience foreshadows future problems and compromises in Israel's faithfulness to God.",
      "17": "The other half of Manasseh receives their inheritance, including special provisions for Zelophehad's daughters who inherit land according to Moses' earlier ruling. The tribe complains about their allotment size, but Joshua challenges them to clear the forested hill country.",
      "18": "The remaining seven tribes receive their inheritances after Joshua rebukes their delay in claiming what God has given them. The tabernacle is set up at Shiloh, and surveyors map out the remaining land for division by lot.",
      "19": "The final six tribes (Simeon, Zebulun, Issachar, Asher, Naphtali, and Dan) receive their territorial inheritances through the casting of lots. Joshua himself receives the city of Timnath-serah as his personal inheritance, completing the land distribution process.",
      "20": "Six cities of refuge are established where those who accidentally kill someone can flee for protection from the avenger of blood. This provision demonstrates God's justice and mercy, providing due process while protecting both the innocent and the rights of victims' families.",
      "21": "The Levites receive 48 cities scattered throughout all the tribal territories, fulfilling God's promise to provide for those who serve Him in the tabernacle. The chapter concludes by affirming that God kept every promise He made to Israel regarding the land.",
      "22": "The eastern tribes (Reuben, Gad, and half of Manasseh) return home after faithfully serving in the conquest, but build an altar that nearly causes civil war. The crisis is resolved when they explain the altar is a witness to their faithfulness, not for forbidden worship.",
      "23": "In his first farewell address, an aged Joshua warns Israel to remain faithful to God and continue driving out the remaining Canaanites. He emphasizes that obedience brings blessing while disobedience will result in losing the Promised Land.",
      "24": "Joshua's final address recounts God's faithfulness throughout Israel's history and challenges the people to choose whom they will serve. Israel covenant renewally commits to serve the Lord alone, and Joshua dies at 110 years old, having faithfully completed his calling."
    }
  },
  {
    "name": "Judges",
    "slug": "judges",
    "testament": "Old Testament",
    "category": "History",
    "author": "Samuel (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Ruth",
    "slug": "ruth",
    "testament": "Old Testament",
    "category": "History",
    "author": "Samuel (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "1 Samuel",
    "slug": "1-samuel",
    "testament": "Old Testament",
    "category": "History",
    "author": "Samuel, Gad, Nathan (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "2 Samuel",
    "slug": "2-samuel",
    "testament": "Old Testament",
    "category": "History",
    "author": "Gad, Nathan (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "1 Kings",
    "slug": "1-kings",
    "testament": "Old Testament",
    "category": "History",
    "author": "Jeremiah (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "2 Kings",
    "slug": "2-kings",
    "testament": "Old Testament",
    "category": "History",
    "author": "Jeremiah (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "1 Chronicles",
    "slug": "1-chronicles",
    "testament": "Old Testament",
    "category": "History",
    "author": "Ezra (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "2 Chronicles",
    "slug": "2-chronicles",
    "testament": "Old Testament",
    "category": "History",
    "author": "Ezra (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Ezra",
    "slug": "ezra",
    "testament": "Old Testament",
    "category": "History",
    "author": "Ezra",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Nehemiah",
    "slug": "nehemiah",
    "testament": "Old Testament",
    "category": "History",
    "author": "Nehemiah (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Esther",
    "slug": "esther",
    "testament": "Old Testament",
    "category": "History",
    "author": "Unknown (trad. Mordecai)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Job",
    "slug": "job",
    "testament": "Old Testament",
    "category": "Poetry & Writings",
    "author": "Unknown",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Psalms",
    "slug": "psalms",
    "testament": "Old Testament",
    "category": "Poetry & Writings",
    "author": "David & others",
    "language": "Hebrew",
    "chapterSummaries": {
      "1": "Blessed is the one who delights in God's law and meditates on it day and night; the righteous prosper.",
      "2": "The nations rage against God's Anointed, but God laughs; His Son will rule with an iron rod.",
      "3": "David trusts God's protection against many enemies; the Lord is his shield and glory.",
      "4": "Evening prayer for God's favor; He gives peace and security to those who trust Him.",
      "8": "God's majesty in creation; humans crowned with glory and honor to rule over His works.",
      "16": "David finds refuge in God; the path of life leads to joy and eternal pleasures.",
      "19": "Creation declares God's glory; His law is perfect, converting the soul and making wise.",
      "22": "Messianic psalm of suffering and triumph; 'My God, why have you forsaken me?' ends in praise.",
      "23": "The Lord is my shepherd; He leads, restores, protects, and prepares a feast for His own.",
      "24": "Who may ascend God's holy hill? The clean-handed and pure-hearted; the King of Glory enters.",
      "25": "David seeks God's guidance and forgiveness; God teaches the humble His ways and covenant love.",
      "27": "The Lord is light and salvation; David desires to dwell in God's house and seek His face.",
      "32": "Blessed are those whose sins are forgiven; confession brings joy and God's guidance.",
      "37": "Don't fret over evildoers; trust God, do good, and inherit the land; the meek will prosper.",
      "40": "God lifts David from the pit; sacrifice and offering aren't desired, but obedience to God's will.",
      "42": "As the deer pants for water, so David's soul thirsts for God in his exile and depression.",
      "46": "God is our refuge and strength; He makes wars cease and will be exalted among the nations.",
      "51": "David's confession after adultery with Bathsheba; create in me a clean heart, O God.",
      "62": "David waits silently for God alone; He is rock, salvation, and fortress; trust Him always.",
      "63": "David thirsts for God in the wilderness; his soul clings to God who upholds him.",
      "73": "Asaph struggles with prosperity of the wicked until he enters God's sanctuary and sees their end.",
      "84": "How lovely is God's dwelling place; blessed are those who dwell in His house and trust Him.",
      "90": "Moses reflects on human frailty and God's eternity; teach us to number our days wisely.",
      "91": "He who dwells in God's secret place abides under His shadow; angels guard His beloved.",
      "100": "Joyful call to worship; serve the Lord with gladness; enter His gates with thanksgiving and praise.",
      "103": "Bless the Lord, my soul; He forgives, heals, redeems, and shows steadfast love and compassion.",
      "110": "Messianic psalm: 'The Lord said to my Lord, sit at My right hand until I make Your enemies footstool.'",
      "118": "Give thanks to the Lord for His steadfast love; the stone the builders rejected becomes cornerstone.",
      "119": "Longest psalm celebrating God's word; blessed are those who walk in His law and keep His testimonies.",
      "121": "I lift my eyes to the hills; my help comes from the Lord who made heaven and earth.",
      "126": "When the Lord restored Zion's fortunes, we were like those who dream; tears of sowing, joy of harvest.",
      "130": "Out of the depths I cry to God; if He marked iniquity, who could stand? With Him is forgiveness.",
      "139": "God knows David completely; fearfully and wonderfully made; His thoughts are precious and vast.",
      "145": "David's praise of God's greatness, grace, and goodness; every generation will declare His mighty acts.",
      "150": "Final psalm: Praise God with all instruments and voices; let everything that breathes praise the Lord!"
    }
  },
  {
    "name": "Proverbs",
    "slug": "proverbs",
    "testament": "Old Testament",
    "category": "Poetry & Writings",
    "author": "Solomon & others",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Ecclesiastes",
    "slug": "ecclesiastes",
    "testament": "Old Testament",
    "category": "Poetry & Writings",
    "author": "Solomon (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Song of Songs",
    "slug": "song-of-songs",
    "testament": "Old Testament",
    "category": "Poetry & Writings",
    "author": "Solomon (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Isaiah",
    "slug": "isaiah",
    "testament": "Old Testament",
    "category": "Major Prophets",
    "author": "Isaiah",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Jeremiah",
    "slug": "jeremiah",
    "testament": "Old Testament",
    "category": "Major Prophets",
    "author": "Jeremiah",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Lamentations",
    "slug": "lamentations",
    "testament": "Old Testament",
    "category": "Major Prophets",
    "author": "Jeremiah (trad.)",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Ezekiel",
    "slug": "ezekiel",
    "testament": "Old Testament",
    "category": "Major Prophets",
    "author": "Ezekiel",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Daniel",
    "slug": "daniel",
    "testament": "Old Testament",
    "category": "Major Prophets",
    "author": "Daniel (Aramaic portions)",
    "language": "Hebrew/Aramaic",
    "chapterSummaries": {}
  },
  {
    "name": "Hosea",
    "slug": "hosea",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Hosea",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Joel",
    "slug": "joel",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Joel",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Amos",
    "slug": "amos",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Amos",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Obadiah",
    "slug": "obadiah",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Obadiah",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Jonah",
    "slug": "jonah",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Jonah",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Micah",
    "slug": "micah",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Micah",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Nahum",
    "slug": "nahum",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Nahum",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Habakkuk",
    "slug": "habakkuk",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Habakkuk",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Zephaniah",
    "slug": "zephaniah",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Zephaniah",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Haggai",
    "slug": "haggai",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Haggai",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Zechariah",
    "slug": "zechariah",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Zechariah",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Malachi",
    "slug": "malachi",
    "testament": "Old Testament",
    "category": "Minor Prophets",
    "author": "Malachi",
    "language": "Hebrew",
    "chapterSummaries": {}
  },
  {
    "name": "Matthew",
    "slug": "matthew",
    "testament": "New Testament",
    "category": "Gospels",
    "author": "Matthew",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Jesus' genealogy proves He's the promised Messiah; virgin Mary conceives by the Holy Spirit; Joseph obeys God's angel.",
      "2": "Wise men worship infant Jesus; jealous Herod massacres Bethlehem's babies; the family flees to Egypt, fulfilling prophecy.",
      "3": "John the Baptist prepares the way for Messiah; Jesus is baptized, receiving the Spirit and the Father's approval.",
      "4": "Satan tempts Jesus in the wilderness for 40 days; Jesus resists with Scripture and begins His Galilean ministry.",
      "5": "Jesus teaches the Beatitudes and kingdom principles; believers are salt and light; righteousness exceeds that of Pharisees.",
      "6": "Jesus teaches about authentic worship: giving, prayer, and fasting are for God's glory, not human recognition.",
      "7": "Don't judge others harshly; ask God persistently; the narrow gate leads to life; false prophets bear bad fruit.",
      "8": "Jesus demonstrates His authority by healing leprosy, paralysis, fever, and storms; the cost of discipleship is high.",
      "9": "Jesus heals a paralytic, calls Matthew, raises the dead, heals bleeding and blindness; workers are few but harvest is plentiful.",
      "10": "Jesus commissions the twelve apostles to preach to Israel; persecution will come, but God will vindicate the faithful."
    }
  },
  {
    "name": "Mark",
    "slug": "mark",
    "testament": "New Testament",
    "category": "Gospels",
    "author": "Mark",
    "language": "Greek",
    "chapterSummaries": {
      "1": "John baptizes Jesus; the Spirit descends; Jesus calls fishermen; teaches with authority; heals many.",
      "2": "Jesus heals paralytic; calls Levi; defends disciples' behavior on Sabbath and fasting.",
      "3": "Withered hand healed on Sabbath; twelve apostles chosen; Jesus accused of casting out demons by Beelzebul.",
      "4": "Parable of sower and others; Jesus calms the storm, showing power over nature.",
      "5": "Legion of demons cast into swine; Jairus' daughter raised; woman with bleeding healed.",
      "6": "Rejection in Nazareth; twelve sent out; John the Baptist beheaded; feeding of 5,000; Jesus walks on water.",
      "7": "Pharisees criticized for tradition over God's law; Syrophoenician woman's faith; deaf man healed.",
      "8": "Feeding 4,000; Pharisees seek sign; Peter confesses Jesus as Christ; cross predicted.",
      "9": "Transfiguration reveals Jesus' glory; boy with demon healed; greatness through service.",
      "10": "Divorce teaching; children blessed; rich young ruler; James and John's request; blind Bartimaeus healed.",
      "11": "Triumphal entry; temple cleansed; fig tree cursed; authority questioned.",
      "12": "Parable of vineyard tenants; taxes to Caesar; resurrection question; greatest commandment; widow's offering.",
      "13": "Temple's destruction predicted; signs of the end; perseverance encouraged; no one knows the hour.",
      "14": "Anointing at Bethany; Last Supper; Gethsemane agony; betrayal and arrest; Peter's denial.",
      "15": "Trial before Pilate; crucifixion between two thieves; Joseph of Arimathea buries Jesus.",
      "16": "Empty tomb; angel announces resurrection; women flee in fear; appearances to disciples; great commission."
    }
  },
  {
    "name": "Luke",
    "slug": "luke",
    "testament": "New Testament",
    "category": "Gospels",
    "author": "Luke",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Angel Gabriel announces Jesus' birth to Mary; Mary visits Elizabeth, praising God; Zechariah's song celebrates salvation for all people.",
      "2": "Jesus born in Bethlehem; angels announce good news to shepherds; Jesus presented in temple where Simeon and Anna recognize the Messiah.",
      "3": "John the Baptist calls all to repentance; Jesus baptized and affirmed by the Father; Luke traces Jesus' universal genealogy to Adam.",
      "4": "Satan tempts Jesus who responds with Scripture; Jesus begins ministry in Nazareth, proclaiming good news to the poor but facing rejection.",
      "5": "Jesus calls fishermen disciples; cleanses leper and paralytic, demonstrating power over sickness; calls tax collector Levi, dining with sinners.",
      "6": "Jesus teaches that mercy matters more than Sabbath rules; chooses twelve apostles; blesses the poor and marginalied in radical kingdom teaching.",
      "7": "Jesus heals centurion's servant and widow's son; John the Baptist questions from prison; Jesus defends ministry to outcasts and sinners.",
      "8": "Women support Jesus' ministry; parable of soils; Jesus calms storm and heals demon-possessed man, showing power over nature and evil.",
      "9": "Twelve sent to preach and heal; feeding of 5,000; Peter confesses Jesus as Messiah; transfiguration reveals Jesus' glory; journey to Jerusalem begins.",
      "10": "Seventy-two sent out with kingdom authority; Good Samaritan teaches love for neighbors; Mary chooses better portion while Martha serves anxiously.",
      "11": "Jesus teaches disciples to pray; delivers man from demon; religious leaders accuse Him of using Satan's power; warns against spiritual pride.",
      "12": "Jesus warns against hypocrisy; teaches about worry and wealth; calls disciples to readiness for His return and faithful stewardship.",
      "13": "Jesus calls all to repentance; heals bent woman on Sabbath; kingdom grows like mustard seed; narrow door requires urgent response.",
      "14": "Jesus heals on Sabbath; teaches humility at dinner; parables about discipleship's cost and the great banquet welcoming outcasts.",
      "15": "Three parables of lost things found: sheep, coin, and prodigal son, revealing God's heart for seeking and saving the lost.",
      "16": "Shrewd manager parable teaches faithful stewardship; rich man and Lazarus shows eternal consequences of ignoring the poor.",
      "17": "Jesus teaches about forgiveness, faith, and humble service; heals ten lepers but only Samaritan returns grateful; kingdom is within you.",
      "18": "Persistent widow and humble tax collector teach about prayer; Jesus welcomes children; rich ruler can't let go of wealth for eternal life.",
      "19": "Jesus saves tax collector Zacchaeus; parable of ten minas about faithful service; triumphal entry and temple cleansing in Jerusalem.",
      "20": "Religious leaders challenge Jesus' authority; parable of wicked tenants; questions about taxes, resurrection, and David's son confound opponents.",
      "21": "Widow's offering shows true generosity; Jesus predicts temple's destruction and His return; disciples must endure persecution with patient faith.",
      "22": "Judas betrays Jesus for money; Last Supper establishes new covenant; Jesus agonizes in prayer; arrested while disciples argue about greatness.",
      "23": "Jesus tried before Pilate and Herod; crucified between two criminals, showing mercy to repentant thief; buried by Joseph of Arimathea.",
      "24": "Women find empty tomb; Jesus appears on Emmaus road; shows disciples His wounds; explains Scripture; ascends after commissioning them as witnesses."
    }
  },
  {
    "name": "John",
    "slug": "john",
    "testament": "New Testament",
    "category": "Gospels",
    "author": "John",
    "language": "Greek",
    "chapterSummaries": {
      "1": "The Word became flesh; John the Baptist testifies to Jesus; first disciples called; Jesus is the Lamb of God.",
      "2": "Wedding at Cana: Jesus' first miracle; cleansing the temple shows His zeal for God's house.",
      "3": "Nicodemus learns about new birth; Jesus explains God's love and the necessity of believing in Him.",
      "4": "Samaritan woman at the well discovers living water; many Samaritans believe; official's son healed.",
      "5": "Lame man healed at pool of Bethesda on Sabbath; Jesus claims equality with the Father.",
      "6": "Feeding 5,000; walking on water; Jesus is the bread of life; many disciples turn away.",
      "7": "Jesus teaches at Feast of Tabernacles; division among people; living water promised to believers.",
      "8": "Woman caught in adultery; Jesus is the light of the world; truth sets free; Abraham rejoiced to see Jesus' day.",
      "9": "Man born blind receives sight; Pharisees investigate and expel him; Jesus reveals spiritual blindness.",
      "10": "Jesus is the good shepherd who lays down His life; sheep know His voice; unity with the Father.",
      "11": "Lazarus dies and is raised after four days; Martha confesses Jesus as Messiah; plot to kill Jesus intensifies.",
      "12": "Mary anoints Jesus' feet; triumphal entry; Jesus predicts His death and glorification; some Greeks seek Him.",
      "13": "Jesus washes disciples' feet; teaches about humble service; predicts betrayal; gives new commandment of love.",
      "14": "Jesus is the way, truth, and life; promises the Holy Spirit as Helper; peace amid trouble.",
      "15": "Jesus is the true vine; believers must remain in Him to bear fruit; world will hate His followers.",
      "16": "Holy Spirit will convict the world; sorrow will turn to joy; Jesus has overcome the world.",
      "17": "Jesus' high priestly prayer for Himself, His disciples, and all future believers; unity and glory.",
      "18": "Betrayal and arrest in garden; trials before Annas, Caiaphas, and Pilate; Peter's denials.",
      "19": "Jesus scourged and crucified; 'It is finished'; buried in Joseph's new tomb; Sabbath approaches.",
      "20": "Empty tomb; Jesus appears to Mary, then disciples; Thomas believes; these signs written for faith.",
      "21": "Miraculous catch of fish; Jesus restores Peter with threefold commissioning to feed His sheep."
    }
  },
  {
    "name": "Acts",
    "slug": "acts",
    "testament": "New Testament",
    "category": "Acts",
    "author": "Luke",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Jesus ascends to heaven after commanding the apostles to wait for the Holy Spirit and be witnesses to the ends of the earth. Matthias is chosen to replace Judas among the twelve apostles.",
      "2": "The Holy Spirit comes upon the apostles at Pentecost, enabling them to speak in different languages. Peter preaches boldly, and about 3,000 people are baptized and added to the church.",
      "3": "Peter and John heal a lame man at the temple gate, drawing a crowd to whom Peter preaches about Jesus as the promised Messiah. The healing demonstrates God's power working through the apostles.",
      "4": "Peter and John are arrested for preaching about Jesus but boldly defend their faith before the religious authorities. The early church prays for boldness and continues to grow in unity and power.",
      "5": "Ananias and Sapphira die for lying to the Holy Spirit about their offering, demonstrating God's holiness. The apostles perform many signs and wonders despite increasing persecution from religious leaders.",
      "6": "Seven deacons, including Stephen, are chosen to serve the church and care for widows. Stephen performs great wonders and faces opposition from those who cannot refute his Spirit-filled wisdom.",
      "7": "Stephen delivers a powerful speech tracing Israel's history and accusing the religious leaders of rejecting God's messengers. He becomes the first Christian martyr, stoned to death while Saul watches approvingly.",
      "8": "Persecution scatters Christians throughout Judea and Samaria, spreading the gospel beyond Jerusalem. Philip preaches in Samaria and baptizes an Ethiopian eunuch, showing the gospel reaching all nations.",
      "9": "Saul encounters the risen Christ on the road to Damascus and is dramatically converted from persecutor to preacher. Ananias baptizes Saul, who immediately begins proclaiming Jesus as the Son of God.",
      "10": "God gives Peter a vision about clean and unclean foods, preparing him to preach to Cornelius, a Gentile centurion. The Holy Spirit falls on Cornelius and his household, proving that salvation is for all people.",
      "11": "Peter defends his ministry to Gentiles before the Jerusalem church, explaining God's clear leading through visions and the Spirit's work. The church in Antioch grows and becomes the first place where believers are called Christians.",
      "12": "King Herod persecutes the church, executing James and imprisoning Peter, but an angel miraculously frees Peter from prison. Herod dies under God's judgment, while the word of God continues to spread.",
      "13": "The Holy Spirit sends Barnabas and Saul (Paul) on their first missionary journey from Antioch. They preach in Cyprus and Pisidian Antioch, where Paul delivers his first recorded sermon about Jesus as the promised Savior.",
      "14": "Paul and Barnabas continue their missionary work in Iconium, Lystra, and Derbe, facing both acceptance and persecution. They strengthen new believers and appoint elders before returning to Antioch to report on God's work among the Gentiles.",
      "15": "The Jerusalem Council meets to decide whether Gentile converts must follow Jewish law, concluding that salvation is by grace alone. This pivotal decision opens the door for the gospel to spread freely among all nations.",
      "16": "Paul begins his second missionary journey with Silas, traveling through Asia Minor and receiving the Macedonian call to Europe. In Philippi, Lydia becomes a believer and Paul and Silas are miraculously freed from prison.",
      "17": "Paul preaches in Thessalonica and Berea, then travels to Athens where he delivers his famous sermon about the unknown God. Some mock his message about resurrection, but others believe and join him.",
      "18": "Paul spends 18 months in Corinth, working with Aquila and Priscilla while establishing a strong church. Despite opposition, God encourages Paul in a vision to continue speaking boldly.",
      "19": "Paul ministers in Ephesus for over two years, performing extraordinary miracles and seeing many turn from magic and idolatry to Christ. A riot erupts when silversmiths fear losing business from decreased idol worship.",
      "20": "Paul travels through Macedonia and Greece, then delivers a farewell address to the Ephesian elders in Miletus. He warns them of coming difficulties and commends them to God's grace while heading toward Jerusalem.",
      "21": "Despite warnings from the Holy Spirit, Paul continues to Jerusalem where he is arrested in the temple after being falsely accused of bringing Gentiles into restricted areas. Roman soldiers rescue him from an angry mob.",
      "22": "Paul addresses the Jerusalem crowd in Hebrew, recounting his conversion and calling to minister to the Gentiles. The crowd listens until he mentions the Gentiles, then erupts in anger demanding his death.",
      "23": "Paul appears before the Sanhedrin and cleverly divides the council by raising the issue of resurrection. After discovering a plot to kill Paul, Roman officials secretly transfer him to Caesarea for his protection.",
      "24": "Paul defends himself before Governor Felix against accusations brought by the high priest Ananias and lawyer Tertullus. Felix keeps Paul imprisoned for two years, occasionally summoning him to hear about faith in Christ.",
      "25": "The new governor Festus hears Paul's case and suggests he return to Jerusalem for trial. Paul exercises his right as a Roman citizen and appeals to Caesar, ensuring his journey to Rome.",
      "26": "Paul presents his defense before King Agrippa, powerfully recounting his conversion and calling to preach to both Jews and Gentiles. Agrippa admits Paul could have been freed if he hadn't appealed to Caesar.",
      "27": "Paul begins his journey to Rome as a prisoner, encountering a fierce storm at sea that threatens to destroy the ship. Through Paul's faith and God's protection, all 276 people aboard safely reach the island of Malta.",
      "28": "After being shipwrecked on Malta and bitten by a viper with no harm, Paul is recognized as special by the islanders. He finally reaches Rome, where he continues preaching about the kingdom of God with boldness and freedom."
    }
  },
  {
    "name": "Romans",
    "slug": "romans",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul declares the gospel as God's power for salvation; all humanity is guilty before God and under His wrath.",
      "2": "God's judgment is impartial and based on deeds; both Jews and Gentiles are condemned; true circumcision is of the heart.",
      "3": "All have sinned and fall short of God's glory; justification comes only through faith in Jesus Christ, not works.",
      "4": "Abraham was justified by faith before circumcision; he's the father of all believers; righteousness is credited, not earned.",
      "5": "Justified believers have peace with God; Adam brought sin and death, but Christ brings grace and life to all.",
      "6": "Believers died to sin in baptism and live new lives; sin no longer masters us; we're slaves to righteousness.",
      "7": "The law reveals sin but cannot save; Paul struggles with his sinful nature; only Christ delivers from condemnation.",
      "8": "No condemnation for those in Christ; the Spirit gives life; all creation awaits redemption; nothing separates us from God's love."
    }
  },
  {
    "name": "1 Corinthians",
    "slug": "1-corinthians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {
      "1": "Paul planted, Apollos watered, but God gave growth; Christ crucified is wisdom and power, not worldly wisdom.",
      "2": "Paul's ministry demonstrated Spirit's power, not eloquent words; spiritual truths are spiritually discerned.",
      "3": "Corinthians are still carnal babies; ministers are servants; the church is God's temple and building.",
      "4": "Apostles are stewards and spectacles to the world; Paul warns against pride and appoints Timothy.",
      "5": "Sexual immorality in the church must be judged; deliver the offender to Satan for restoration.",
      "6": "Christians shouldn't sue each other; our bodies are temples; flee sexual immorality and honor God.",
      "7": "Marriage is good; singleness allows undistracted devotion; remain in your calling when converted.",
      "8": "Knowledge puffs up, love builds up; be careful not to cause weaker brothers to stumble.",
      "9": "Paul's rights as apostle; he becomes all things to all men to save some; run to win.",
      "10": "Israel's wilderness failures warn us; flee idolatry; seek others' good, not your own.",
      "11": "Head coverings reflect divine order; the Lord's Supper requires proper examination and unity.",
      "12": "One Spirit gives diverse gifts to one body; every member is important; seek the best gifts.",
      "13": "Love is the most excellent way; it's patient, kind, not envious; greatest of faith, hope, love.",
      "14": "Prophecy builds up the church more than tongues; women should ask husbands at home; all things orderly.",
      "15": "Christ's resurrection is historical fact and future hope; death is swallowed up in victory.",
      "16": "Collection for Jerusalem saints; final instructions; Maranatha (Come, Lord Jesus)."
    }
  },
  {
    "name": "2 Corinthians",
    "slug": "2-corinthians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "Galatians",
    "slug": "galatians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "Ephesians",
    "slug": "ephesians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "Philippians",
    "slug": "philippians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "Colossians",
    "slug": "colossians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "1 Thessalonians",
    "slug": "1-thessalonians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "2 Thessalonians",
    "slug": "2-thessalonians",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "1 Timothy",
    "slug": "1-timothy",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "2 Timothy",
    "slug": "2-timothy",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "Titus",
    "slug": "titus",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "Philemon",
    "slug": "philemon",
    "testament": "New Testament",
    "category": "Pauline Epistles",
    "author": "Paul",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "Hebrews",
    "slug": "hebrews",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "Unknown (trad. Paul)",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "James",
    "slug": "james",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "James",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "1 Peter",
    "slug": "1-peter",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "Peter",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "2 Peter",
    "slug": "2-peter",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "Peter",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "1 John",
    "slug": "1-john",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "John",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "2 John",
    "slug": "2-john",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "John",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "3 John",
    "slug": "3-john",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "John",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "Jude",
    "slug": "jude",
    "testament": "New Testament",
    "category": "General Epistles",
    "author": "Jude",
    "language": "Greek",
    "chapterSummaries": {}
  },
  {
    "name": "Revelation",
    "slug": "revelation",
    "testament": "New Testament",
    "category": "Apocalypse",
    "author": "John",
    "language": "Greek",
    "chapterSummaries": {}
  }
]